{
  "course_name": "AP Psychology",
  "units": [
    {
      "unit_number": 1,
      "unit_title": "Unit 1: Biological Bases of Behavior",
      "ced_class_periods": "~17-23 CLASS PERIODS",
      "exam_weight": "15-25%",
      "unit_overview": {
        "summary": "Welcome to the biological foundations of psychology! This unit dives into the intricate connection between our biology and our behavior. We'll explore the classic 'nature vs. nurture' debate, examining how both our genes and our environment shape who we are. You'll learn about the body's communication systems: the nervous system and its building block, the neuron, as well as the slower endocrine system. A major focus will be a tour of the brain, mapping its structures to their functions in thought, emotion, and action. We'll also cover the essential topics of sleep and sensation, understanding how we detect physical energy from the environment. This unit provides the essential biological hardware knowledge needed to understand the rest of psychology.",
        "ced_class_periods": "~17-23 Class Periods",
        "exam_weight": "15-25%",
        "prepgo_estimated_minutes": 223
      },
      "topics": [
        {
          "topic_number": "1.1",
          "ced_topic_title": "Interaction of Heredity and Environment",
          "topic_title": "Interaction of Heredity and Environment",
          "topic_overview": "Are you a product of your genes or your upbringing? This topic tackles the timeless 'nature versus nurture' debate. You'll explore how behavior geneticists study the relative influence of our genetic inheritance and environmental experiences on our behavior. We will define key concepts like heredity and heritability, and look at how twin and adoption studies are used as natural experiments to untangle these complex interactions. The goal is to understand that our traits are not simply one or the other, but a result of the intricate interplay between our genetic predispositions and the world around us.",
          "prepgo_plan": {
            "total_estimated_minutes": 34,
            "learn_minutes": 12,
            "review_minutes": 7,
            "practice_minutes": 15,
            "target_study_guide_words": 1800,
            "target_flashcards_count": 14,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "1.1.A",
              "summary": "Explain the relationship between heredity and environment in shaping behavior and mental processes."
            }
          ],
          "essential_knowledge": [
            {
              "id": "1.1.A.1",
              "summary": "Heredity and environmental factors interact to shape behavior and mental processes."
            },
            {
              "id": "1.1.A.1.1",
              "summary": "Heredity ('nature') refers to genetic characteristics that influence traits and processes."
            },
            {
              "id": "1.1.A.1.ii",
              "summary": "Environmental factors ('nurture') refer to external experiences like family interactions or education."
            },
            {
              "id": "1.1.A.2",
              "summary": "The evolutionary perspective explores how natural selection affects behavior and mental processes to increase survival and reproduction."
            },
            {
              "id": "1.1.A.3",
              "summary": "Research on gene effects is often conducted using twin, family, and adoption studies."
            }
          ]
        },
        {
          "topic_number": "1.2",
          "ced_topic_title": "Overview of the Nervous System",
          "topic_title": "Overview of the Nervous System",
          "topic_overview": "Let's explore the body's superfast electrochemical communication network. This topic introduces the nervous system, which is divided into two main parts: the central nervous system (CNS), consisting of the brain and spinal cord, and the peripheral nervous system (PNS), which connects the CNS to the rest of the body. You'll learn about the different divisions of the PNS, including the somatic and autonomic systems. The objective is to build a clear structural map of how information travels throughout your body, allowing you to react to the world and regulate your internal functions.",
          "prepgo_plan": {
            "total_estimated_minutes": 35,
            "learn_minutes": 12,
            "review_minutes": 8,
            "practice_minutes": 15,
            "target_study_guide_words": 1800,
            "target_flashcards_count": 16,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "1.2.A",
              "summary": "Differentiate among the subsystems of the human nervous system and their functions."
            }
          ],
          "essential_knowledge": [
            {
              "id": "1.2.A.1",
              "summary": "The central nervous system includes the brain and spinal cord, interacting with all body processes."
            },
            {
              "id": "1.2.A.2",
              "summary": "The peripheral nervous system relays messages from the central nervous system and includes the autonomic and somatic nervous systems."
            },
            {
              "id": "1.2.A.2.i",
              "summary": "The autonomic nervous system governs involuntary processes and includes the parasympathetic and sympathetic systems."
            },
            {
              "id": "1.2.A.2.ii",
              "summary": "The somatic nervous system governs voluntary processes."
            }
          ]
        },
        {
          "topic_number": "1.3",
          "ced_topic_title": "The Neuron and Neural Firing",
          "topic_title": "The Neuron and Neural Firing",
          "topic_overview": "This topic zooms in on the building block of the nervous system: the neuron. You will learn the parts of a neuron—the dendrites, axon, and myelin sheath—and their functions. The core of this lesson is understanding the action potential, the electrical impulse that travels down the axon. We'll cover how this 'all-or-none' signal works and what happens at the synapse, where neurons communicate using chemical messengers called neurotransmitters. Mastering this process is key to understanding how all brain activity, from a simple reflex to a complex thought, occurs.",
          "prepgo_plan": {
            "total_estimated_minutes": 40,
            "learn_minutes": 14,
            "review_minutes": 11,
            "practice_minutes": 15,
            "target_study_guide_words": 2100,
            "target_flashcards_count": 22,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "1.3.A",
              "summary": "Explain how the structures and functions of typical neurons in the central nervous system affect behavior and mental processes."
            },
            {
              "id": "1.3.B",
              "summary": "Explain how the basic process of neural transmission is related to behavior and mental processes."
            },
            {
              "id": "1.3.C",
              "summary": "Explain how psychoactive drugs affect behavior and mental processes."
            }
          ],
          "essential_knowledge": [
            {
              "id": "1.3.A.1",
              "summary": "Neurons (transmit information) and glial cells (provide support) are the basis of the nervous system."
            },
            {
              "id": "1.3.A.2",
              "summary": "The reflex arc in the spinal cord demonstrates how sensory neurons, motor neurons, and interneurons work together to respond to stimuli."
            },
            {
              "id": "1.3.B.1",
              "summary": "Neural transmission involves the all-or-nothing principle, depolarization, refractory period, resting potential, reuptake, and threshold."
            },
            {
              "id": "1.3.B.2",
              "summary": "Neurotransmitters have specific functions and communicate either excitatory or inhibitory messages."
            },
            {
              "id": "1.3.B.3",
              "summary": "Hormones perform actions similar to neurotransmitters outside of the nervous system."
            },
            {
              "id": "1.3.C.1",
              "summary": "Psychoactive drugs can act as agonists (encourage firing), antagonists (discourage firing), or reuptake inhibitors (block reabsorption)."
            },
            {
              "id": "1.3.C.2",
              "summary": "Psychoactive drugs have both psychological and physiological effects."
            },
            {
              "id": "1.3.C.2.i",
              "summary": "Stimulants (e.g., caffeine, cocaine) typically increase neural activity."
            },
            {
              "id": "1.3.C.2.ii",
              "summary": "Depressants (e.g., alcohol) typically decrease neural activity."
            },
            {
              "id": "1.3.C.2.iii",
              "summary": "Hallucinogens (e.g., marijuana) typically cause distortions in perception or cognition."
            },
            {
              "id": "1.3.C.2.iv",
              "summary": "Opioids (e.g., heroin) typically act as pain relievers."
            },
            {
              "id": "1.3.C.3",
              "summary": "Psychoactive drug use can lead to tolerance, addiction, and withdrawal symptoms."
            }
          ]
        },
        {
          "topic_number": "1.4",
          "ced_topic_title": "The Brain",
          "topic_title": "The Brain",
          "topic_overview": "Welcome to the command center! This topic is a tour of the brain's major regions and their specialized functions. We'll explore the older brain structures like the brainstem and cerebellum that handle basic survival functions. Then we'll move to the limbic system, which is linked to emotions, memory, and drives, including the hippocampus and amygdala. Finally, we'll map the cerebral cortex and its four lobes, the ultimate control and information-processing center. The goal is to understand how these different parts work together to create our rich conscious experience and control our behavior.",
          "prepgo_plan": {
            "total_estimated_minutes": 45,
            "learn_minutes": 16,
            "review_minutes": 11,
            "practice_minutes": 18,
            "target_study_guide_words": 2400,
            "target_flashcards_count": 22,
            "target_mcq_count": 12
          },
          "learning_objectives": [
            {
              "id": "1.4.A",
              "summary": "Explain how the structures and functions of the brain apply to behavior and mental processes."
            }
          ],
          "essential_knowledge": [
            {
              "id": "1.4.A.1",
              "summary": "The brain stem (including the medulla) generally controls basic functions like breathing and heart rate."
            },
            {
              "id": "1.4.A.2",
              "summary": "The reticular activating system and the brain's reward center generally control some voluntary movement, learning, and emotion."
            },
            {
              "id": "1.4.A.3",
              "summary": "The cerebellum generally controls muscle coordination, balance, and some procedural learning."
            },
            {
              "id": "1.4.A.4",
              "summary": "The cerebral cortex is divided into two hemispheres and includes the limbic system, corpus callosum, and lobes."
            },
            {
              "id": "1.4.A.4.i",
              "summary": "The occipital lobes generally control visual information processing."
            },
            {
              "id": "1.4.A.4.ii",
              "summary": "The temporal lobes generally control auditory and linguistic processing."
            },
            {
              "id": "1.4.A.4.iii",
              "summary": "The parietal lobes generally control association areas and the somatosensory cortex (touch)."
            },
            {
              "id": "1.4.A.4.iv",
              "summary": "The frontal lobes generally control linguistic processing, higher-order thinking, and executive functioning."
            },
            {
              "id": "1.4.A.5",
              "summary": "Split-brain research reveals that the right and left hemispheres may specialize in different functions."
            },
            {
              "id": "1.4.A.5.i",
              "summary": "Language areas (Broca's and Wernicke's) are typically located in the left hemisphere."
            },
            {
              "id": "1.4.A.5.ii",
              "summary": "Researchers test for cortex specialization by taking advantage of the brain's contralateral organization."
            },
            {
              "id": "1.4.A.6",
              "summary": "Brain plasticity is the ability of the brain to rewire itself or create new connections."
            },
            {
              "id": "1.4.A.7",
              "summary": "Brain research uses scans (EEG, fMRI), case studies, and surgical procedures to understand brain structure and function."
            }
          ]
        },
        {
          "topic_number": "1.5",
          "ced_topic_title": "Sleep",
          "topic_title": "Sleep",
          "topic_overview": "We spend about a third of our lives doing it, but why is sleep so important? This topic explores the biological rhythms and distinct stages of our sleep cycle. You'll learn to differentiate between NREM sleep and the paradoxical REM sleep stage, where most vivid dreaming occurs. We will examine various theories on the functions of sleep, from its role in memory consolidation to physical restoration. You'll also learn about common sleep disorders. The objective is to understand why sleep is a critical biological need that profoundly impacts our physical and mental well-being.",
          "prepgo_plan": {
            "total_estimated_minutes": 34,
            "learn_minutes": 12,
            "review_minutes": 7,
            "practice_minutes": 15,
            "target_study_guide_words": 1800,
            "target_flashcards_count": 14,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "1.5.A",
              "summary": "Explain how the sleep/wake cycle affects behavior and mental processes throughout the day and night."
            }
          ],
          "essential_knowledge": [
            {
              "id": "1.5.A.1",
              "summary": "Consciousness has varying levels of awareness; sleep and wakefulness are two types of consciousness."
            },
            {
              "id": "1.5.A.2",
              "summary": "The sleep/wake cycle is a circadian rhythm, approximately a 24-hour cycle in humans."
            },
            {
              "id": "1.5.A.3",
              "summary": "Stages of sleep are identified by specific EEG patterns."
            },
            {
              "id": "1.5.A.3.i",
              "summary": "NREM sleep occurs in Stages 1 through 3; hypnagogic sensations occur when entering Stage 1."
            },
            {
              "id": "1.5.A.3.ii",
              "summary": "REM sleep is paradoxical, with brain waves similar to wakefulness but a relaxed body; dreaming typically occurs in REM."
            },
            {
              "id": "1.5.A.4",
              "summary": "Theories about dream function include activation-synthesis and consolidation theory."
            },
            {
              "id": "1.5.A.5",
              "summary": "Current theories suggest sleep is for memory consolidation and restoration of depleted resources."
            },
            {
              "id": "1.5.A.6",
              "summary": "Sleep disorders (e.g., insomnia, narcolepsy, sleep apnea) interrupt healthy sleep and can affect waking behavior."
            }
          ]
        },
        {
          "topic_number": "1.6",
          "ced_topic_title": "Sensation",
          "topic_title": "Sensation",
          "topic_overview": "How does the outside world get into our brains? This topic introduces sensation, the process by which our sensory receptors and nervous system receive and represent stimulus energies from our environment. You will learn about the basic principles that apply to all our senses, such as absolute thresholds and the process of sensory adaptation. We'll then briefly survey our major senses—vision, hearing, touch, taste, and smell—and identify their specialized receptor cells. The goal is to understand the first step in how we construct our awareness of the world, a process known as bottom-up processing.",
          "prepgo_plan": {
            "total_estimated_minutes": 35,
            "learn_minutes": 12,
            "review_minutes": 8,
            "practice_minutes": 15,
            "target_study_guide_words": 1800,
            "target_flashcards_count": 16,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "1.6.A",
              "summary": "Explain how the process of sensation is related to behavior and mental processes."
            },
            {
              "id": "1.6.B",
              "summary": "Explain how the structures and functions of the visual sensory system relate to behavior and mental processes."
            },
            {
              "id": "1.6.C",
              "summary": "Explain how the structures and functions of the auditory sensory system relate to behavior and mental processes."
            },
            {
              "id": "1.6.D",
              "summary": "Explain how the structures and functions of the chemical sensory systems relate to behavior and mental processes."
            },
            {
              "id": "1.6.E",
              "summary": "Explain how the structures and functions of the touch sensory system relate to behavior and mental processes."
            },
            {
              "id": "1.6.F",
              "summary": "Explain how the structures and functions of the pain sensory system relate to behavior and mental processes."
            },
            {
              "id": "1.6.G",
              "summary": "Explain how the structures and functions that maintain balance (vestibular) and body movement (kinesthetic) relate to behavior and mental processes."
            }
          ],
          "essential_knowledge": [
            {
              "id": "1.6.A.1",
              "summary": "Sensation is the process of detecting environmental information and transducing it into neurochemical messages."
            },
            {
              "id": "1.6.A.2",
              "summary": "Detection of change is explained by the just-noticeable difference (Weber's law) and sensory adaptation."
            },
            {
              "id": "1.6.A.3",
              "summary": "Sensory systems work together in a process called sensory interaction; synesthesia is an example."
            },
            {
              "id": "1.6.B.1",
              "summary": "The retina captures visual information, which is transduced to the brain for processing."
            },
            {
              "id": "1.6.B.2",
              "summary": "Visual stimuli are focused onto the retina by the lens via accommodation."
            },
            {
              "id": "1.6.B.3",
              "summary": "Rods in the periphery of the eye detect shapes and movement in low light."
            },
            {
              "id": "1.6.B.4",
              "summary": "Color vision is explained by both the trichromatic and opponent-process theories."
            },
            {
              "id": "1.6.B.4.i",
              "summary": "Cones, located in the fovea, process color and detail."
            },
            {
              "id": "1.6.B.4.ii",
              "summary": "Afterimages result from the activation and non-activation of opponent-process ganglion cells (red/green, blue/yellow, black/white)."
            },
            {
              "id": "1.6.B.4.iii",
              "summary": "Color vision deficiency involves irregularities in cones or ganglion cells."
            },
            {
              "id": "1.6.B.5",
              "summary": "Damage to visual brain areas can result in disorders like prosopagnosia (face blindness) and blindsight."
            },
            {
              "id": "1.6.C.1",
              "summary": "Sound occurs through air molecule movement at different wavelengths (pitch) and amplitudes (loudness)."
            },
            {
              "id": "1.6.C.2",
              "summary": "Theories explaining pitch perception include place theory, volley theory, and frequency theory."
            },
            {
              "id": "1.6.C.3",
              "summary": "Sound localization describes how we identify the source of sounds."
            },
            {
              "id": "1.6.C.4",
              "summary": "Hearing difficulties can result from aging and damage, leading to conduction or sensorineural deafness."
            },
            {
              "id": "1.6.D.1",
              "summary": "Olfactory stimuli are processed in the nose and brain; smell is the only sense not first processed in the thalamus."
            },
            {
              "id": "1.6.D.2",
              "summary": "Gustation is the sense of taste, including sweet, sour, salty, bitter, umami, and oleogustus."
            },
            {
              "id": "1.6.D.3",
              "summary": "The number of taste receptors on the tongue relates to taste sensitivity (supertasters, etc.)."
            },
            {
              "id": "1.6.D.4",
              "summary": "The chemical senses of smell and taste interact to create the sensation of flavor."
            },
            {
              "id": "1.6.E.1",
              "summary": "Structures in the skin and brain process touch stimuli; 'hot' is produced by activating warm and cold receptors."
            },
            {
              "id": "1.6.F.1",
              "summary": "Pain is processed in the body and brain; gate control theory attempts to describe its complexities."
            },
            {
              "id": "1.6.G.1",
              "summary": "The vestibular sense controls balance and is detected by semicircular canals and brain structures."
            },
            {
              "id": "1.6.G.2",
              "summary": "Kinesthesis is the sense of one's body movement, allowing for coordinated motion."
            }
          ]
        }
      ]
    },
    {
      "unit_number": 2,
      "unit_title": "Unit 2: Cognition",
      "ced_class_periods": "~17-23 CLASS PERIODS",
      "exam_weight": "15-25%",
      "unit_overview": {
        "summary": "This unit is all about the mind at work. We will explore the fascinating world of cognition, the mental activities associated with thinking, knowing, remembering, and communicating. We'll start by seeing how the brain takes raw sensory data and organizes it into meaningful perceptions. From there, we'll investigate higher-level thinking, including problem-solving, judgment, and decision-making, learning about the mental shortcuts and biases that shape our thoughts. A major part of this unit is a deep dive into memory, covering the processes of encoding, storing, and retrieving information, as well as why we forget. Finally, we will examine the concepts of intelligence and achievement, exploring how they are defined, measured, and influenced.",
        "ced_class_periods": "~17-23 Class Periods",
        "exam_weight": "15-25%",
        "prepgo_estimated_minutes": 272
      },
      "topics": [
        {
          "topic_number": "2.1",
          "ced_topic_title": "Perception",
          "topic_title": "Perception",
          "topic_overview": "Sensation is detecting stimuli; perception is making sense of it. This topic explores how our brain organizes and interprets sensory information, enabling us to recognize meaningful objects and events. You will learn about top-down processing, where our experiences and expectations guide our interpretations. We will cover key principles of perceptual organization, such as the Gestalt principles, and how we perceive depth and motion. The key takeaway is that our perception of the world is not a perfect photograph but an active, creative construction of the brain.",
          "prepgo_plan": {
            "total_estimated_minutes": 34,
            "learn_minutes": 12,
            "review_minutes": 7,
            "practice_minutes": 15,
            "target_study_guide_words": 1800,
            "target_flashcards_count": 14,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "2.1.A",
              "summary": "Explain how internal and external factors influence perception."
            },
            {
              "id": "2.1.B",
              "summary": "Explain how visual perceptual processes produce correct or incorrect interpretations of stimuli."
            }
          ],
          "essential_knowledge": [
            {
              "id": "2.1.A.1",
              "summary": "Perception is influenced by reliance on sensory information (bottom-up) or prior expectations (top-down)."
            },
            {
              "id": "2.1.A.2",
              "summary": "Schemas and perceptual sets are internal factors that filter perceptions."
            },
            {
              "id": "2.1.A.3",
              "summary": "Contexts, experiences, and culture are external factors that filter perceptions."
            },
            {
              "id": "2.1.A.4",
              "summary": "Gestalt principles (closure, figure-ground, proximity, similarity) explain how humans organize perceptions."
            },
            {
              "id": "2.1.A.5",
              "summary": "Attention is an interaction of sensation and perception affected by internal and external processes."
            },
            {
              "id": "2.1.A.5.i",
              "summary": "Selective attention allows focus, as seen in the cocktail party effect."
            },
            {
              "id": "2.1.A.5.ii",
              "summary": "Inattention can lead to blindness to environmental aspects, such as change blindness."
            },
            {
              "id": "2.1.B.1",
              "summary": "Binocular depth cues (retinal disparity, convergence) use images from both eyes for depth perception."
            },
            {
              "id": "2.1.B.2",
              "summary": "Monocular depth cues (e.g., relative size, linear perspective) give the illusion of depth on 2D surfaces."
            },
            {
              "id": "2.1.B.3",
              "summary": "Visual perceptual constancies maintain perception of an object despite changes in the visual field."
            },
            {
              "id": "2.1.B.4",
              "summary": "Apparent movement can be visually perceived even when objects are stationary."
            }
          ]
        },
        {
          "topic_number": "2.2",
          "ced_topic_title": "Thinking, Problem-Solving, Judgements, and Decision-Making",
          "topic_title": "Thinking, Problem-Solving, Judgments, and Decision-Making",
          "topic_overview": "How do we think? This topic explores the core components of cognition. You'll learn about concepts, the mental groupings that help us organize our world. We will examine various strategies for problem-solving, from methodical algorithms to quicker heuristics (mental shortcuts). A key focus will be on the common cognitive biases and errors in judgment, such as confirmation bias and the availability heuristic, that can lead our thinking astray. The goal is to understand both the impressive power and the predictable pitfalls of human reasoning.",
          "prepgo_plan": {
            "total_estimated_minutes": 38,
            "learn_minutes": 14,
            "review_minutes": 9,
            "practice_minutes": 15,
            "target_study_guide_words": 2100,
            "target_flashcards_count": 18,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "2.2.A",
              "summary": "Explain how psychological concepts and theories account for thinking, problem-solving, judgment, and decision-making."
            }
          ],
          "essential_knowledge": [
            {
              "id": "2.2.A.1",
              "summary": "Concepts form the basis of thought; prototypes are the ideal examples of concepts."
            },
            {
              "id": "2.2.A.2",
              "summary": "People form and modify schemas through assimilation (fitting new info in) and accommodation (changing schema for new info)."
            },
            {
              "id": "2.2.A.3",
              "summary": "Algorithms solve problems by attempting all possible solutions."
            },
            {
              "id": "2.2.A.4",
              "summary": "Heuristics use mental shortcuts for judgments, which can lead to errors like the representativeness and availability heuristics."
            },
            {
              "id": "2.2.A.5",
              "summary": "Decision-making can be influenced by prior successes (mental set) or surrounding circumstances (priming, framing)."
            },
            {
              "id": "2.2.A.6",
              "summary": "Cognitive fallacies like the gambler's fallacy and sunk-cost fallacy can hinder good decision-making."
            },
            {
              "id": "2.2.A.7",
              "summary": "Executive functions are cognitive processes for goal-directed behaviors and critical thinking."
            },
            {
              "id": "2.2.A.8",
              "summary": "Creativity involves generating novel ideas and divergent thinking, hindered by functional fixedness."
            }
          ]
        },
        {
          "topic_number": "2.3",
          "ced_topic_title": "Introduction to Memory",
          "topic_title": "Introduction to Memory",
          "topic_overview": "This topic introduces the essential models of how memory works. You will learn about the classic three-stage model of memory: sensory memory, short-term/working memory, and long-term memory. We'll define the core processes of encoding (getting information in), storage (keeping it there), and retrieval (getting it back out). You'll also be introduced to the distinction between effortful and automatic processing. The objective is to build a foundational framework for understanding the complex architecture of our memory system, which we will explore in greater detail in the topics to come.",
          "prepgo_plan": {
            "total_estimated_minutes": 28,
            "learn_minutes": 10,
            "review_minutes": 6,
            "practice_minutes": 12,
            "target_study_guide_words": 1500,
            "target_flashcards_count": 12,
            "target_mcq_count": 8
          },
          "learning_objectives": [
            {
              "id": "2.3.A",
              "summary": "Explain how the types, structures, and processes of memory work."
            }
          ],
          "essential_knowledge": [
            {
              "id": "2.3.A.1",
              "summary": "Memories differ by how they are processed, stored, and retrieved by the brain."
            },
            {
              "id": "2.3.A.1.i",
              "summary": "Explicit memory (episodic, semantic) is easily described to others."
            },
            {
              "id": "2.3.A.1.ii",
              "summary": "Implicit memory (e.g., procedural) is challenging to describe to others."
            },
            {
              "id": "2.3.A.1.iii",
              "summary": "Prospective memory relates to future actions."
            },
            {
              "id": "2.3.A.2",
              "summary": "Long-term potentiation, the strengthening of synaptic connections with frequent activation, is a biological basis for memory."
            },
            {
              "id": "2.3.A.3",
              "summary": "The working memory model involves the central executive, phonological loop, and visuospatial sketchpad interacting with long-term memory."
            },
            {
              "id": "2.3.A.4",
              "summary": "The multi-store model proposes three systems: sensory, short-term, and long-term memory."
            },
            {
              "id": "2.3.A.5",
              "summary": "The levels of processing model proposes memory is encoded on structural, phonemic, and semantic levels."
            }
          ]
        },
        {
          "topic_number": "2.4",
          "ced_topic_title": "Encoding Memories",
          "topic_title": "Encoding Memories",
          "topic_overview": "How do we get information into our long-term memory? This topic focuses on the crucial process of encoding. You will learn about different levels of processing, from shallow to deep, and discover why deeper, semantic encoding leads to much better retention. We will explore a variety of effective encoding strategies that you can use to improve your own learning, such as chunking, mnemonics, and the spacing effect. The goal is to understand that effective memory formation is an active process and to gain a toolkit of techniques for more successful learning.",
          "prepgo_plan": {
            "total_estimated_minutes": 35,
            "learn_minutes": 12,
            "review_minutes": 8,
            "practice_minutes": 15,
            "target_study_guide_words": 1800,
            "target_flashcards_count": 16,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "2.4.A",
              "summary": "Explain how different encoding processes work to get information into memory."
            }
          ],
          "essential_knowledge": [
            {
              "id": "2.4.A.1",
              "summary": "Encoding involves strategies to get information into memory; how it's encoded affects storage and retrieval."
            },
            {
              "id": "2.4.A.2",
              "summary": "Mnemonic devices, like the method of loci, aid in encoding information."
            },
            {
              "id": "2.4.A.3",
              "summary": "Encoding can be improved by grouping information into meaningful chunks, categories, or hierarchies."
            },
            {
              "id": "2.4.A.4",
              "summary": "The spacing effect shows distributed practice is more effective for encoding than massed practice."
            },
            {
              "id": "2.4.A.5",
              "summary": "The serial position effect predicts that information at the beginning (primacy) and end (recency) of a list is most memorable."
            }
          ]
        },
        {
          "topic_number": "2.5",
          "ced_topic_title": "Storing Memories",
          "topic_title": "Storing Memories",
          "topic_overview": "Once a memory is encoded, where is it stored? This topic explores the biological basis of memory storage. You will learn about the different types of long-term memories, such as explicit (declarative) and implicit (nondeclarative) memories, and the different brain structures that handle them, including the hippocampus and cerebellum. We'll also touch on the neural basis of learning through the concept of long-term potentiation. The objective is to understand how our brains physically change to retain information over short and long periods.",
          "prepgo_plan": {
            "total_estimated_minutes": 34,
            "learn_minutes": 12,
            "review_minutes": 7,
            "practice_minutes": 15,
            "target_study_guide_words": 1800,
            "target_flashcards_count": 14,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "2.5.A",
              "summary": "Explain how memory storage processes retain information in memory."
            }
          ],
          "essential_knowledge": [
            {
              "id": "2.5.A.1",
              "summary": "Sensory, short-term, working, and long-term memory differ in storage duration, capacity, and content."
            },
            {
              "id": "2.5.A.2",
              "summary": "Maintenance rehearsal prolongs storage; elaborative rehearsal, which promotes meaning, helps retention."
            },
            {
              "id": "2.5.A.3",
              "summary": "Highly superior autobiographical memory suggests biological processes for superior storage; self-referential memories are more memorable."
            },
            {
              "id": "2.5.A.4",
              "summary": "Storage can be negatively affected by physical impairment like amnesia, Alzheimer's disease, and infantile amnesia."
            }
          ]
        },
        {
          "topic_number": "2.6",
          "ced_topic_title": "Retrieving Memories",
          "topic_title": "Retrieving Memories",
          "topic_overview": "Having a memory stored isn't useful unless you can get it back out. This topic covers the process of retrieval. You will learn about the different ways we access memories, such as recall versus recognition. We will explore the powerful effect of retrieval cues and the phenomena of context-dependent and state-dependent memory. The concept of priming will also be introduced. Understanding the principles of retrieval is essential for explaining why we sometimes can't access information we know is there and for developing better ways to access it when needed.",
          "prepgo_plan": {
            "total_estimated_minutes": 34,
            "learn_minutes": 12,
            "review_minutes": 7,
            "practice_minutes": 15,
            "target_study_guide_words": 1800,
            "target_flashcards_count": 14,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "2.6.A",
              "summary": "Explain how memory retrieval processes get information out of memory."
            }
          ],
          "essential_knowledge": [
            {
              "id": "2.6.A.1",
              "summary": "Memory retrieval occurs through recall (without cues) or recognition (with cues)."
            },
            {
              "id": "2.6.A.2",
              "summary": "Retrieval can be enhanced when the context, mood, or physical state matches the encoding conditions."
            },
            {
              "id": "2.6.A.3",
              "summary": "Successful retrieval is more likely when using retrieval practice processes like the testing effect and metacognition."
            }
          ]
        },
        {
          "topic_number": "2.7",
          "ced_topic_title": "Forgetting and Other Memory Challenges",
          "topic_title": "Forgetting and Other Memory Challenges",
          "topic_overview": "Why does our memory sometimes fail us? This topic examines the various ways memory can go wrong. You will learn about the different causes of forgetting, including encoding failure, storage decay, and retrieval failure due to interference. We will also explore the fascinating and sometimes troubling idea that memory is not a perfect playback but a reconstruction. This leads to an investigation of memory distortion, including the misinformation effect and source amnesia, pioneered by psychologist Elizabeth Loftus. The goal is to appreciate the fallibility of human memory.",
          "prepgo_plan": {
            "total_estimated_minutes": 35,
            "learn_minutes": 12,
            "review_minutes": 8,
            "practice_minutes": 15,
            "target_study_guide_words": 1800,
            "target_flashcards_count": 16,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "2.7.A",
              "summary": "Explain possible reasons why memory failure or errors may occur."
            }
          ],
          "essential_knowledge": [
            {
              "id": "2.7.A.1",
              "summary": "The forgetting curve shows that forgetting occurs rapidly after initial learning and then levels off."
            },
            {
              "id": "2.7.A.2",
              "summary": "Memories can be difficult to retrieve due to encoding failure, interference (proactive/retroactive), or inadequate retrieval cues."
            },
            {
              "id": "2.7.A.3",
              "summary": "Psychodynamic theorists believe in repression, where information is forgotten to defend the ego from distress."
            },
            {
              "id": "2.7.A.4",
              "summary": "Memory accuracy can be affected by the misinformation effect, source amnesia, or constructive memory."
            }
          ]
        },
        {
          "topic_number": "2.8",
          "ced_topic_title": "Intelligence and Achievement",
          "topic_title": "Intelligence and Achievement",
          "topic_overview": "What does it mean to be intelligent? This topic explores the concepts of intelligence and achievement. You will learn about different theories of intelligence, from Spearman's single 'g factor' to more modern ideas of multiple intelligences. We will also cover the principles of psychological testing, including the importance of standardization, reliability, and validity in creating assessments like intelligence and achievement tests. The objective is to understand how psychologists define and measure these complex cognitive abilities and to appreciate the factors that contribute to them.",
          "prepgo_plan": {
            "total_estimated_minutes": 34,
            "learn_minutes": 12,
            "review_minutes": 7,
            "practice_minutes": 15,
            "target_study_guide_words": 1800,
            "target_flashcards_count": 14,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "2.8.A",
              "summary": "Explain how modern and historical theories describe intelligence."
            },
            {
              "id": "2.8.B",
              "summary": "Explain how intelligence is measured."
            },
            {
              "id": "2.8.C",
              "summary": "Explain how systemic issues relate to the quantitative and qualitative uses of intelligence assessments."
            },
            {
              "id": "2.8.D",
              "summary": "Explain how academic achievement is measured and experienced as compared to intelligence."
            }
          ],
          "essential_knowledge": [
            {
              "id": "2.8.A.1",
              "summary": "Defining and measuring intelligence is complex and subject to bias; debate exists over whether intelligence is a general ability (g) or multiple abilities."
            },
            {
              "id": "2.8.B.1",
              "summary": "Early intelligence tests yielded an IQ (mental age / chronological age); modern IQ scores are often used for educational services."
            },
            {
              "id": "2.8.B.2",
              "summary": "Psychological assessments should adhere to sound psychometric principles."
            },
            {
              "id": "2.8.B.2.i",
              "summary": "Standardization means a test is administered using consistent procedures."
            },
            {
              "id": "2.8.B.2.ii",
              "summary": "Validity means a test measures what it is designed to measure (e.g., construct, predictive)."
            },
            {
              "id": "2.8.B.2.iii",
              "summary": "Reliability means a test yields similar results each time (e.g., test-retest, split-half)."
            },
            {
              "id": "2.8.B.3",
              "summary": "Researchers strive to develop socio-culturally responsive intelligence assessments to reduce stereotype threat and potential inequity."
            },
            {
              "id": "2.8.C.1",
              "summary": "The Flynn Effect shows that IQ scores have generally increased over time due to societal factors."
            },
            {
              "id": "2.8.C.2",
              "summary": "IQ scores vary more within groups than between them; biases and inequities can negatively influence scores."
            },
            {
              "id": "2.8.C.3",
              "summary": "Intelligence test scores have been used historically to limit access to jobs, education, and immigration."
            },
            {
              "id": "2.8.D.1",
              "summary": "Achievement tests measure what someone knows, while aptitude tests predict future performance."
            },
            {
              "id": "2.8.D.2",
              "summary": "Beliefs about whether intelligence is fixed or malleable (growth mindset) can affect academic achievement."
            }
          ]
        }
      ]
    },
    {
      "unit_number": 3,
      "unit_title": "Unit 3: Development and Learning",
      "ced_class_periods": "~17-23 CLASS PERIODS",
      "exam_weight": "15-25%",
      "unit_overview": {
        "summary": "This unit covers two fundamental processes that shape who we are: development and learning. First, we'll journey through the lifespan, examining the physical, cognitive, and social-emotional changes we undergo from infancy to adulthood. We'll explore the influential theories of Piaget on cognitive stages and Erikson on psychosocial stages. The second half of the unit shifts to learning, defined as a relatively permanent change in behavior due to experience. You'll learn the core principles of classical conditioning (learning through association) and operant conditioning (learning through consequences). We'll also see how cognitive and social factors, like observation, play a crucial role. This unit beautifully illustrates the constant interplay of nature and nurture in our lives.",
        "ced_class_periods": "~17-23 Class Periods",
        "exam_weight": "15-25%",
        "prepgo_estimated_minutes": 328
      },
      "topics": [
        {
          "topic_number": "3.1",
          "ced_topic_title": "Themes and Methods in Developmental Psychology",
          "topic_title": "Themes and Methods in Developmental Psychology",
          "topic_overview": "This topic sets the stage for our exploration of human development. You will be introduced to the major themes that guide developmental psychology, such as nature vs. nurture and continuity vs. stages. We will also explore the primary research methods used to study change over time, including cross-sectional and longitudinal studies, weighing the pros and cons of each. The goal is to provide you with the foundational concepts and methodological tools needed to critically evaluate the theories and research we will cover throughout this unit.",
          "prepgo_plan": {
            "total_estimated_minutes": 31,
            "learn_minutes": 10,
            "review_minutes": 8,
            "practice_minutes": 13,
            "target_study_guide_words": 1500,
            "target_flashcards_count": 16,
            "target_mcq_count": 9
          },
          "learning_objectives": [
            {
              "id": "3.1.A",
              "summary": "Explain how enduring themes inform developmental psychology."
            },
            {
              "id": "3.1.B",
              "summary": "Describe how cross-sectional and longitudinal research methods inform understanding of behavior."
            }
          ],
          "essential_knowledge": [
            {
              "id": "3.1.A.1",
              "summary": "Developmental psychology is concerned with chronological and thematic issues across the lifespan, such as nature vs. nurture and continuous vs. discontinuous stages."
            }
          ]
        },
        {
          "topic_number": "3.2",
          "ced_topic_title": "Physical Development Across the Lifespan",
          "topic_title": "Physical Development Across the Lifespan",
          "topic_overview": "Our journey through development begins with the body. This topic traces physical development from the prenatal period through infancy, childhood, adolescence, and into adulthood. You will learn about key milestones in motor development and the significant physical changes that occur during puberty and later in life. A central theme is the continuous interaction between our biological maturation and our experiences. The objective is to understand the predictable patterns of physical growth and change that provide the foundation for our cognitive and social development.",
          "prepgo_plan": {
            "total_estimated_minutes": 32,
            "learn_minutes": 10,
            "review_minutes": 7,
            "practice_minutes": 15,
            "target_study_guide_words": 1500,
            "target_flashcards_count": 15,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "3.2.A",
              "summary": "Explain how physical development before birth applies to behavior and mental processes."
            },
            {
              "id": "3.2.B",
              "summary": "Explain how physical development in infancy and childhood apply to behavior and mental processes."
            },
            {
              "id": "3.2.C",
              "summary": "Explain how physical development in adolescence applies to behavior and mental processes."
            },
            {
              "id": "3.2.D",
              "summary": "Explain how physical development in adulthood applies to behavior and mental processes."
            }
          ],
          "essential_knowledge": [
            {
              "id": "3.2.A.1",
              "summary": "Teratogens, maternal illness, and other factors can influence physical and psychological milestones during prenatal development."
            },
            {
              "id": "3.2.B.1",
              "summary": "Physical development in infancy and childhood follows a general order, with milestones like fine and gross motor coordination."
            },
            {
              "id": "3.2.B.2",
              "summary": "Infant reflexes, like the rooting reflex, indicate on-track physical and psychological development."
            },
            {
              "id": "3.2.B.3",
              "summary": "The visual cliff apparatus demonstrates an early ability in infants to perceive depth."
            },
            {
              "id": "3.2.B.4",
              "summary": "Critical or sensitive periods in infancy have strong developmental effects, especially for skills like language."
            },
            {
              "id": "3.2.C.1",
              "summary": "Adolescent physical milestones include the growth spurt and puberty, with development of primary and secondary sex characteristics."
            },
            {
              "id": "3.2.D.1",
              "summary": "Adulthood is characterized by a general decline in reproductive ability, mobility, and sensory acuity."
            }
          ]
        },
        {
          "topic_number": "3.3",
          "ced_topic_title": "Gender and Sexual Orientation",
          "topic_title": "Gender and Sexual Orientation",
          "topic_overview": "This topic explores the psychological aspects of two important components of identity. You will learn to differentiate between biological sex, socially constructed gender roles, and an individual's internal gender identity. We will also define sexual orientation as an enduring pattern of emotional, romantic, or sexual attraction. The focus is on understanding these concepts from a psychological perspective, recognizing the diversity of human experience and the interplay of biological, psychological, and social factors in development.",
          "prepgo_plan": {
            "total_estimated_minutes": 34,
            "learn_minutes": 12,
            "review_minutes": 7,
            "practice_minutes": 15,
            "target_study_guide_words": 1800,
            "target_flashcards_count": 14,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "3.3.A",
              "summary": "Describe how sex and gender influence socialization and other aspects of development."
            }
          ],
          "essential_knowledge": []
        },
        {
          "topic_number": "3.4",
          "ced_topic_title": "Cognitive Development Across the Lifespan",
          "topic_title": "Cognitive Development Across the Lifespan",
          "topic_overview": "How do our ways of thinking change as we grow? This topic focuses on cognitive development, with a primary emphasis on Jean Piaget's groundbreaking stage theory. You will learn his core concepts of schemas, assimilation, and accommodation, and be able to describe the key characteristics of the sensorimotor, preoperational, concrete operational, and formal operational stages. We will also contrast Piaget's theory with Lev Vygotsky's sociocultural perspective. The objective is to master these influential frameworks for understanding the development of reasoning and problem-solving abilities.",
          "prepgo_plan": {
            "total_estimated_minutes": 42,
            "learn_minutes": 16,
            "review_minutes": 8,
            "practice_minutes": 18,
            "target_study_guide_words": 2400,
            "target_flashcards_count": 15,
            "target_mcq_count": 12
          },
          "learning_objectives": [
            {
              "id": "3.4.A",
              "summary": "Explain how theories of cognitive development apply to behavior and mental processes."
            }
          ],
          "essential_knowledge": [
            {
              "id": "3.4.A.1",
              "summary": "According to Piaget, children develop schemas via assimilation and accommodation."
            },
            {
              "id": "3.4.A.1.i",
              "summary": "The sensorimotor stage (infancy) is characterized by the development of object permanence."
            },
            {
              "id": "3.4.A.1.ii",
              "summary": "The preoperational stage (early childhood) is marked by symbolic thought but inability to perform tasks like conservation."
            },
            {
              "id": "3.4.A.1.iii",
              "summary": "The concrete operational stage (late childhood) involves logical thinking but struggles with abstract thought."
            },
            {
              "id": "3.4.A.1.iv",
              "summary": "The formal operational stage (adolescence-adulthood) is characterized by abstract and hypothetical thinking."
            },
            {
              "id": "3.4.A.2",
              "summary": "According to Vygotsky, children are social learners who develop through interaction and scaffolding within their zone of proximal development."
            },
            {
              "id": "3.4.A.3",
              "summary": "In adulthood, crystallized intelligence remains stable while fluid intelligence tends to decline."
            }
          ]
        },
        {
          "topic_number": "3.5",
          "ced_topic_title": "Communication and Language Development",
          "topic_title": "Communication and Language Development",
          "topic_overview": "This topic explores the remarkable human capacity for language. You will trace the predictable stages of language acquisition in children, from babbling to one-word and two-word stages. We will examine different theories that attempt to explain this rapid development, including the behaviorist perspective (operant learning) and Noam Chomsky's nativist theory (inborn universal grammar). The goal is to understand the building blocks of language and appreciate the complex cognitive processes involved in learning to communicate.",
          "prepgo_plan": {
            "total_estimated_minutes": 34,
            "learn_minutes": 12,
            "review_minutes": 7,
            "practice_minutes": 15,
            "target_study_guide_words": 1800,
            "target_flashcards_count": 14,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "3.5.A",
              "summary": "Explain how key components of language and communication apply to behavior and mental processes."
            },
            {
              "id": "3.5.B",
              "summary": "Explain how language develops in humans."
            }
          ],
          "essential_knowledge": [
            {
              "id": "3.5.A.1",
              "summary": "Language is a shared system of arbitrary, rule-governed symbols (phonemes, morphemes) that is generative."
            },
            {
              "id": "3.5.B.1",
              "summary": "Language development proceeds through stages: cooing, babbling, one-word, and telegraphic speech."
            }
          ]
        },
        {
          "topic_number": "3.6",
          "ced_topic_title": "Social-Emotional Development Across the Lifespan",
          "topic_title": "Social-Emotional Development Across the Lifespan",
          "topic_overview": "How do we develop our sense of self and our relationships with others? This topic focuses on our social and emotional journey. You will learn about the critical concept of attachment in infancy, including the work of Harlow and Ainsworth. A major focus will be Erik Erikson's influential theory of psychosocial development, which proposes that we face a specific social challenge at each stage of life, from trust vs. mistrust in infancy to integrity vs. despair in old age. The objective is to understand these key milestones in our social and emotional lives.",
          "prepgo_plan": {
            "total_estimated_minutes": 38,
            "learn_minutes": 14,
            "review_minutes": 9,
            "practice_minutes": 15,
            "target_study_guide_words": 2100,
            "target_flashcards_count": 18,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "3.6.A",
              "summary": "Explain how social development relates to behavior and mental processes."
            }
          ],
          "essential_knowledge": [
            {
              "id": "3.6.A.1",
              "summary": "Ecological systems theory explores how social environments (microsystem, mesosystem, etc.) influence development."
            },
            {
              "id": "3.6.A.2",
              "summary": "Parenting styles (authoritarian, authoritative, permissive) affect child outcomes, with cultural differences."
            },
            {
              "id": "3.6.A.3",
              "summary": "Infant attachment styles (secure, insecure) vary by culture and relate to temperament."
            },
            {
              "id": "3.6.A.3.i",
              "summary": "Separation anxiety is fear when away from a caregiver or with a stranger."
            },
            {
              "id": "3.6.A.3.ii",
              "summary": "Monkey studies demonstrate the importance of comfort over food in attachment."
            },
            {
              "id": "3.6.A.4",
              "summary": "Developmental psychologists study the evolution of peer relationships."
            },
            {
              "id": "3.6.A.4.i",
              "summary": "Children engage with peers through parallel and pretend play."
            },
            {
              "id": "3.6.A.4.ii",
              "summary": "Adolescents rely more on peer relationships and demonstrate egocentrism (imaginary audience, personal fable)."
            },
            {
              "id": "3.6.A.5",
              "summary": "Developmental psychologists study how adults develop socially over time."
            },
            {
              "id": "3.6.A.5.i",
              "summary": "Culture influences the social clock, determining when major life events occur."
            },
            {
              "id": "3.6.A.5.ii",
              "summary": "Adult relationships provide mutual support; childhood attachment styles can affect adult attachments."
            },
            {
              "id": "3.6.A.6",
              "summary": "The stage theory of psychosocial development proposes conflicts to be resolved at each life stage (e.g., trust vs. mistrust)."
            },
            {
              "id": "3.6.A.7",
              "summary": "Adverse childhood experiences (ACEs) affect relationships throughout the lifespan."
            },
            {
              "id": "3.6.A.8",
              "summary": "Adolescents develop a sense of identity through processes of achievement, diffusion, foreclosure, and moratorium."
            }
          ]
        },
        {
          "topic_number": "3.7",
          "ced_topic_title": "Classical Conditioning",
          "topic_title": "Classical Conditioning",
          "topic_overview": "This topic introduces a fundamental form of learning discovered by Ivan Pavlov. You will learn how classical conditioning creates associations between stimuli. We will define and apply all the key components: the unconditioned stimulus (US), unconditioned response (UR), neutral stimulus (NS), conditioned stimulus (CS), and conditioned response (CR). You'll also learn about related processes like acquisition, extinction, spontaneous recovery, generalization, and discrimination. The goal is to understand how we learn to anticipate events and how this process explains many of our automatic, involuntary responses.",
          "prepgo_plan": {
            "total_estimated_minutes": 40,
            "learn_minutes": 14,
            "review_minutes": 11,
            "practice_minutes": 15,
            "target_study_guide_words": 2100,
            "target_flashcards_count": 22,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "3.7.A",
              "summary": "Explain how classical conditioning applies to behavior and mental processes."
            }
          ],
          "essential_knowledge": [
            {
              "id": "3.7.A.1",
              "summary": "The behavioral perspective evolved from theories about learning via conditioning, focusing on observable behavior."
            },
            {
              "id": "3.7.A.2",
              "summary": "Classical conditioning focuses on associating one stimulus with another to elicit a response."
            },
            {
              "id": "3.7.A.2.i",
              "summary": "An unconditioned stimulus (UCS) elicits an unconditioned response (UCR); this becomes a conditioned response (CR) to a conditioned stimulus (CS)."
            },
            {
              "id": "3.7.A.2.ii",
              "summary": "The order of presenting the CS with the UCS is important for successful acquisition."
            },
            {
              "id": "3.7.A.2.iii",
              "summary": "A CR can become extinct if the CS is no longer paired with the UCS, but can be spontaneously recovered."
            },
            {
              "id": "3.7.A.2.iv",
              "summary": "Stimulus discrimination and generalization are demonstrated in classical conditioning studies."
            },
            {
              "id": "3.7.A.2.v",
              "summary": "A CS can be used as a UCS in higher-order conditioning."
            },
            {
              "id": "3.7.A.3",
              "summary": "Emotional responses can be classically conditioned, forming the basis for therapies like counterconditioning."
            },
            {
              "id": "3.7.A.4",
              "summary": "Taste aversions demonstrate one-trial conditioning and biological preparedness."
            },
            {
              "id": "3.7.A.5",
              "summary": "Habituation occurs when organisms show a diminished response to a repeated stimulus."
            }
          ]
        },
        {
          "topic_number": "3.8",
          "ced_topic_title": "Operant Conditioning",
          "topic_title": "Operant Conditioning",
          "topic_overview": "How do consequences shape our choices? This topic explores operant conditioning, a type of learning where voluntary behavior is controlled by its consequences. You will master the core concepts developed by B. F. Skinner, distinguishing between reinforcement (which increases behavior) and punishment (which decreases it). We will also cover different schedules of reinforcement and the concept of shaping. Understanding operant conditioning provides powerful insights into how habits are formed and how behavior can be modified in real-world settings.",
          "prepgo_plan": {
            "total_estimated_minutes": 42,
            "learn_minutes": 16,
            "review_minutes": 8,
            "practice_minutes": 18,
            "target_study_guide_words": 2400,
            "target_flashcards_count": 15,
            "target_mcq_count": 12
          },
          "learning_objectives": [
            {
              "id": "3.8.A",
              "summary": "Explain how operant conditioning applies to behavior and mental processes."
            }
          ],
          "essential_knowledge": [
            {
              "id": "3.8.A.1",
              "summary": "Operant conditioning associates consequences (reinforcement, punishment) with behaviors, as described by the Law of Effect."
            },
            {
              "id": "3.8.A.2",
              "summary": "Reinforcement and punishment can be positive or negative; reinforcers can be primary or secondary."
            },
            {
              "id": "3.8.A.3",
              "summary": "Shaping is the process of gradually rewarding successive approximations of a desired behavior."
            },
            {
              "id": "3.8.A.4",
              "summary": "Superstitious behavior and learned helplessness can result from operant conditioning processes."
            },
            {
              "id": "3.8.A.5",
              "summary": "The reinforcement schedule determines the strength of the association between consequence and response."
            },
            {
              "id": "3.8.A.5.i",
              "summary": "Continuous reinforcement schedules deliver reinforcement for every correct behavior."
            },
            {
              "id": "3.8.A.5.ii",
              "summary": "Partial reinforcement schedules can be time-based (interval) or behavior-based (ratio), and fixed or variable."
            }
          ]
        },
        {
          "topic_number": "3.9",
          "ced_topic_title": "Social, Cognitive, and Neurological Factors in Learning",
          "topic_title": "Social, Cognitive, and Neurological Factors in Learning",
          "topic_overview": "Learning is more than just conditioning. This topic explores the crucial role of social and cognitive factors. You will learn about observational learning through Albert Bandura's classic Bobo doll experiments, showing how we learn by watching and imitating others. We'll also examine cognitive processes in learning, such as latent learning and insight. The goal is to move beyond strict behaviorism and appreciate that our thoughts, expectations, and social contexts, along with neurological constraints, profoundly influence how we learn.",
          "prepgo_plan": {
            "total_estimated_minutes": 35,
            "learn_minutes": 12,
            "review_minutes": 8,
            "practice_minutes": 15,
            "target_study_guide_words": 1800,
            "target_flashcards_count": 16,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "3.9.A",
              "summary": "Explain how social learning applies to behavior and mental processes."
            },
            {
              "id": "3.9.B",
              "summary": "Explain how cognitive factors in learning apply to behavior and mental processes."
            }
          ],
          "essential_knowledge": [
            {
              "id": "3.9.A.1",
              "summary": "Social learning theory proposes that learning can occur by observation (vicarious conditioning) and modeling."
            },
            {
              "id": "3.9.B.1",
              "summary": "Insight learning occurs when a solution to a problem appears without direct conditioning or modeling."
            },
            {
              "id": "3.9.B.2",
              "summary": "Latent learning occurs without reinforcement but is not immediately evident, often demonstrated by cognitive maps."
            }
          ]
        }
      ]
    },
    {
      "unit_number": 4,
      "unit_title": "Unit 4: Social Psychology and Personality",
      "ced_class_periods": "~17-23 CLASS PERIODS",
      "exam_weight": "15-25%",
      "unit_overview": {
        "summary": "This unit explores the fascinating interplay between the individual and the group. In the first half, social psychology, we'll examine how we think about, influence, and relate to one another. You'll learn how we explain behavior, how attitudes are formed, and how we are swayed by group pressure, covering classic experiments on conformity and obedience. The second half of the unit shifts inward to personality, the unique pattern of thinking, feeling, and acting that defines an individual. We will survey the major theories that attempt to explain personality, from the psychodynamic and humanistic perspectives to modern trait and social-cognitive theories. Finally, we'll tie everything together by looking at the universal drivers of motivation and emotion.",
        "ced_class_periods": "~17-23 Class Periods",
        "exam_weight": "15-25%",
        "prepgo_estimated_minutes": 257
      },
      "topics": [
        {
          "topic_number": "4.1",
          "ced_topic_title": "Attribution Theory and Person Perception",
          "topic_title": "Attribution Theory and Person Perception",
          "topic_overview": "How do we form impressions of others and explain their behavior? This topic introduces attribution theory, which deals with how we explain the causes of events or behaviors. You will learn to distinguish between situational attributions (crediting the environment) and dispositional attributions (crediting the person's traits). A key concept is the fundamental attribution error, our common tendency to overestimate personality factors and underestimate situational factors when judging others. The goal is to understand the mental processes that shape our perception of people.",
          "prepgo_plan": {
            "total_estimated_minutes": 35,
            "learn_minutes": 12,
            "review_minutes": 8,
            "practice_minutes": 15,
            "target_study_guide_words": 1800,
            "target_flashcards_count": 16,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "4.1.A",
              "summary": "Explain how attribution theory applies to behavior and mental processes."
            },
            {
              "id": "4.1.B",
              "summary": "Explain how locus of control (internal and external) applies to behavior and mental processes."
            },
            {
              "id": "4.1.C",
              "summary": "Explain how person perception applies to behavior and mental processes."
            }
          ],
          "essential_knowledge": [
            {
              "id": "4.1.A.1",
              "summary": "Attributions are how people explain behavior, either dispositional (internal) or situational (external)."
            },
            {
              "id": "4.1.A.2",
              "summary": "Explanatory style is a predictable pattern of attributions (optimistic or pessimistic)."
            },
            {
              "id": "4.1.A.3",
              "summary": "Attribution biases include actor-observer bias, fundamental attribution error, and self-serving bias."
            },
            {
              "id": "4.1.C.1",
              "summary": "The mere exposure effect occurs when repeated exposure to a stimulus increases liking for it."
            },
            {
              "id": "4.1.C.2",
              "summary": "A self-fulfilling prophecy occurs when people behave in ways that elicit confirming behaviors from others."
            },
            {
              "id": "4.1.C.3",
              "summary": "Social comparison occurs when people evaluate themselves based on comparisons to others."
            }
          ]
        },
        {
          "topic_number": "4.2",
          "ced_topic_title": "Attitude Formation and Attitude Change",
          "topic_title": "Attitude Formation and Attitude Change",
          "topic_overview": "This topic explores our attitudes—our feelings and beliefs that guide how we respond to people and events. You will learn how attitudes are formed through experience and social influence. We will examine the relationship between attitudes and actions, with a special focus on the cognitive dissonance theory, which proposes that we feel tension when our attitudes and behaviors are inconsistent and are motivated to reduce that tension, often by changing our attitude. The objective is to understand the psychological forces that shape and change our evaluations of the world.",
          "prepgo_plan": {
            "total_estimated_minutes": 35,
            "learn_minutes": 12,
            "review_minutes": 8,
            "practice_minutes": 15,
            "target_study_guide_words": 1800,
            "target_flashcards_count": 16,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "4.2.A",
              "summary": "Explain how stereotypes and implicit attitudes contribute to prejudice and discrimination."
            },
            {
              "id": "4.2.B",
              "summary": "Explain how belief perseverance and cognitive dissonance apply to attitude formation and change."
            }
          ],
          "essential_knowledge": [
            {
              "id": "4.2.A.1",
              "summary": "A stereotype is a generalized concept about a group, often the basis of prejudice and discrimination."
            },
            {
              "id": "4.2.A.2",
              "summary": "Implicit attitudes are those held but unacknowledged, reflecting biases like the just-world phenomenon or in-group bias."
            },
            {
              "id": "4.2.B.1",
              "summary": "Belief perseverance is when a belief persists despite contradictory evidence."
            },
            {
              "id": "4.2.B.2",
              "summary": "Cognitive dissonance is mental discomfort when actions and attitudes conflict, motivating change in one or the other."
            }
          ]
        },
        {
          "topic_number": "4.3",
          "ced_topic_title": "Psychology of Social Situations",
          "topic_title": "Psychology of Social Situations",
          "topic_overview": "How does the mere presence of others affect our behavior? This topic dives into the power of the social situation. You will learn about key concepts like conformity, as demonstrated in Asch's classic experiments, and obedience to authority, as studied in Milgram's controversial research. We will also explore how being in a group can lead to phenomena like social facilitation, social loafing, and deindividuation. The goal is to appreciate how profoundly our actions and decisions can be influenced by the social context we are in.",
          "prepgo_plan": {
            "total_estimated_minutes": 42,
            "learn_minutes": 16,
            "review_minutes": 8,
            "practice_minutes": 18,
            "target_study_guide_words": 2400,
            "target_flashcards_count": 15,
            "target_mcq_count": 12
          },
          "learning_objectives": [
            {
              "id": "4.3.A",
              "summary": "Explain how the social situation affects behavior and mental processes."
            },
            {
              "id": "4.3.B",
              "summary": "Explain how being in a group can affect an individual’s behavior and mental processes."
            },
            {
              "id": "4.3.C",
              "summary": "Explain how prosocial behavior affects behavior and mental processes."
            }
          ],
          "essential_knowledge": [
            {
              "id": "4.3.A.1",
              "summary": "Social norms define societal expectations and roles."
            },
            {
              "id": "4.3.A.2",
              "summary": "Social influence theory proposes that pressure to conform can be normative or informational."
            },
            {
              "id": "4.3.A.3",
              "summary": "Persuasion refers to techniques to convince others of ideas, actions, or beliefs."
            },
            {
              "id": "4.3.A.3.i",
              "summary": "The elaboration likelihood model outlines central and peripheral routes to persuasion."
            },
            {
              "id": "4.3.A.3.ii",
              "summary": "Persuasion techniques include the foot-in-the-door and door-in-the-face phenomena."
            },
            {
              "id": "4.3.A.4",
              "summary": "Research on conformity clarifies conditions strengthening adherence to unspoken rules."
            },
            {
              "id": "4.3.A.5",
              "summary": "Research on obedience clarifies conditions strengthening compliance with authority."
            },
            {
              "id": "4.3.B.1",
              "summary": "Cultural phenomena like individualism and collectivism influence self-perception and behavior towards others."
            },
            {
              "id": "4.3.B.2",
              "summary": "Group membership can influence behavior via group polarization, groupthink, diffusion of responsibility, social loafing, and deindividuation."
            },
            {
              "id": "4.3.B.3",
              "summary": "Performing in front of a group can lead to social facilitation."
            },
            {
              "id": "4.3.B.4",
              "summary": "The false consensus effect is overestimating the extent to which others agree with you."
            },
            {
              "id": "4.3.B.5",
              "summary": "Superordinate goals unite groups, while social traps occur when individuals act in self-interest to the group's detriment."
            },
            {
              "id": "4.3.B.6",
              "summary": "Industrial-organizational (I/O) psychologists study how people perform in the workplace."
            },
            {
              "id": "4.3.C.1",
              "summary": "Altruism is selfless behavior, but it can be explained by social reciprocity and responsibility norms."
            },
            {
              "id": "4.3.C.2",
              "summary": "The bystander effect demonstrates that situational variables predict the likelihood of helping someone."
            }
          ]
        },
        {
          "topic_number": "4.4",
          "ced_topic_title": "Psychodynamic and Humanistic Theories of Personality",
          "topic_title": "Psychodynamic and Humanistic Theories of Personality",
          "topic_overview": "This topic introduces two influential, and very different, perspectives on personality. First, you'll explore Freud's psychodynamic theory, with its focus on unconscious conflicts, the structures of the id, ego, and superego, and defense mechanisms. Then, we will turn to the humanistic perspective of Maslow and Rogers, which emphasizes our potential for growth, free will, and self-actualization. The objective is to compare and contrast these foundational theories and understand their unique contributions to the study of the self.",
          "prepgo_plan": {
            "total_estimated_minutes": 38,
            "learn_minutes": 14,
            "review_minutes": 9,
            "practice_minutes": 15,
            "target_study_guide_words": 2100,
            "target_flashcards_count": 18,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "4.4.A",
              "summary": "Explain how the psychodynamic theory of personality defines and assesses personality."
            },
            {
              "id": "4.4.B",
              "summary": "Explain how the humanistic theory of personality defines and assesses personality."
            }
          ],
          "essential_knowledge": [
            {
              "id": "4.4.A.1",
              "summary": "According to psychodynamic theory, unconscious processes drive personality."
            },
            {
              "id": "4.4.A.2",
              "summary": "Ego defense mechanisms (e.g., denial, projection, repression) unconsciously protect the ego from threats."
            },
            {
              "id": "4.4.A.3",
              "summary": "Psychodynamic psychologists assess personality using projective tests to probe the unconscious mind."
            },
            {
              "id": "4.4.B.1",
              "summary": "According to humanistic psychology, personality is motivated by unconditional regard and the self-actualizing tendency."
            }
          ]
        },
        {
          "topic_number": "4.5",
          "ced_topic_title": "Social-Cognitive and Trait Theories of Personality",
          "topic_title": "Social-Cognitive and Trait Theories of Personality",
          "topic_overview": "This topic covers modern approaches to understanding personality. You will learn about the social-cognitive perspective, particularly Albert Bandura's concept of reciprocal determinism, which highlights the interplay between our traits, our thoughts, and our environment. Then, we will explore trait theories, which focus on describing personality in terms of stable and enduring behavior patterns, or traits. The primary model here is the 'Big Five' personality factors (conscientiousness, agreeableness, neuroticism, openness, and extraversion). The goal is to understand how these theories measure and describe individual differences.",
          "prepgo_plan": {
            "total_estimated_minutes": 35,
            "learn_minutes": 12,
            "review_minutes": 8,
            "practice_minutes": 15,
            "target_study_guide_words": 1800,
            "target_flashcards_count": 16,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "4.5.A",
              "summary": "Explain how the social-cognitive theory of personality defines and assesses personality."
            },
            {
              "id": "4.5.B",
              "summary": "Explain how trait theories of personality define and assess personality."
            }
          ],
          "essential_knowledge": [
            {
              "id": "4.5.A.1",
              "summary": "Social-cognitive theory posits that reciprocal determinism shapes personality, involving self-concept, self-efficacy, and self-esteem."
            },
            {
              "id": "4.5.B.1",
              "summary": "Trait theories conclude that personality involves a set of enduring characteristics that lead to typical responses."
            },
            {
              "id": "4.5.B.2",
              "summary": "The Big Five theory proposes traits of agreeableness, openness, extraversion, conscientiousness, and emotional stability make up personality."
            }
          ]
        },
        {
          "topic_number": "4.6",
          "ced_topic_title": "Motivation",
          "topic_title": "Motivation",
          "topic_overview": "What are the forces that energize and direct our behavior? This topic introduces the psychology of motivation. You will learn about several major theories that attempt to explain our drives, including drive-reduction theory, arousal theory, and Maslow's hierarchy of needs. We will apply these theories to understand specific motivations, such as hunger and the need to belong. The objective is to gain a framework for analyzing the biological, psychological, and social factors that compel us to act.",
          "prepgo_plan": {
            "total_estimated_minutes": 38,
            "learn_minutes": 14,
            "review_minutes": 9,
            "practice_minutes": 15,
            "target_study_guide_words": 2100,
            "target_flashcards_count": 18,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "4.6.A",
              "summary": "Explain how theories about motivation apply to behavior and mental processes."
            },
            {
              "id": "4.6.B",
              "summary": "Explain how eating and belongingness motivate behavior and mental processes."
            }
          ],
          "essential_knowledge": [
            {
              "id": "4.6.A.1",
              "summary": "Motivation theories like drive-reduction and arousal theory focus on addressing physical needs and desires."
            },
            {
              "id": "4.6.A.2",
              "summary": "Self-determination theory proposes people are motivated by intrinsic or extrinsic factors."
            },
            {
              "id": "4.6.A.3",
              "summary": "Many non-human animals are motivated by instincts, which do not seem to be a primary motivator for humans."
            },
            {
              "id": "4.6.A.4",
              "summary": "Lewin’s motivational conflicts theory proposes that choices (approach-approach, approach-avoidance, avoidance-avoidance) create conflicts to resolve."
            },
            {
              "id": "4.6.A.5",
              "summary": "Sensation-seeking theory proposes that the need for varied or novel experiences is the basis of motivation."
            },
            {
              "id": "4.6.B.1",
              "summary": "Eating is a complex motivated behavior involving the interaction of physical and mental processes."
            },
            {
              "id": "4.6.B.1.i",
              "summary": "Hormones like ghrelin and leptin regulate feelings of hunger and satiety."
            },
            {
              "id": "4.6.B.1.ii",
              "summary": "External factors like food presence, time of day, or social gatherings also influence eating."
            }
          ]
        },
        {
          "topic_number": "4.7",
          "ced_topic_title": "Emotion",
          "topic_title": "Emotion",
          "topic_overview": "This topic delves into the complex experience of emotion. You will learn about the three key components of an emotion: physiological arousal, expressive behaviors, and conscious experience. We will examine and compare the major theories that explain the relationship between these components, including the James-Lange, Cannon-Bard, and Schachter-Singer two-factor theories. The goal is to understand how our bodies and minds work together to create the feelings that color our lives, from joy to sadness to fear.",
          "prepgo_plan": {
            "total_estimated_minutes": 34,
            "learn_minutes": 12,
            "review_minutes": 7,
            "practice_minutes": 15,
            "target_study_guide_words": 1800,
            "target_flashcards_count": 14,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "4.7.A",
              "summary": "Explain how theories of emotion apply to behavior and mental processes."
            },
            {
              "id": "4.7.B",
              "summary": "Explain how social norms and experiences influence the expression of emotions."
            }
          ],
          "essential_knowledge": [
            {
              "id": "4.7.A.1",
              "summary": "Emotion is a complex process; early theories debated whether physiological or cognitive experiences came first."
            },
            {
              "id": "4.7.A.2",
              "summary": "The broaden-and-build theory proposes that positive emotions broaden awareness while negative emotions narrow it."
            },
            {
              "id": "4.7.B.1",
              "summary": "Research has explored whether emotional expressions are universal, with some emotions (e.g., anger, fear, happiness) showing commonality."
            },
            {
              "id": "4.7.B.2",
              "summary": "Display rules and elicitors for emotional expression can differ among cultures, genders, and ages."
            }
          ]
        }
      ]
    },
    {
      "unit_number": 5,
      "unit_title": "Unit 5: Mental and Physical Health",
      "ced_class_periods": "~17-23 CLASS PERIODS",
      "exam_weight": "15-25%",
      "unit_overview": {
        "summary": "This final unit explores the critical intersection of psychology, health, and well-being. We'll begin by looking at health psychology, understanding how psychological factors influence physical health, with a special focus on stress and coping. Then we'll shift to positive psychology, the scientific study of human flourishing and what makes life worth living. The majority of the unit is dedicated to clinical psychology. You will learn how psychological disorders are defined, explained, and classified using the DSM. We'll survey the major categories of disorders, including anxiety, depressive, and schizophrenic disorders. Finally, we will review the main approaches to treatment, from various forms of psychotherapy to biomedical interventions. This unit provides a vital overview of mental health challenges and the paths to recovery.",
        "ced_class_periods": "~17-23 Class Periods",
        "exam_weight": "15-25%",
        "prepgo_estimated_minutes": 194
      },
      "topics": [
        {
          "topic_number": "5.1",
          "ced_topic_title": "Introduction to Health Psychology",
          "topic_title": "Introduction to Health Psychology",
          "topic_overview": "How do our minds and behaviors affect our physical health? This topic introduces health psychology, a field that explores the connections between psychological factors, behavior, and physical well-being. A major focus will be on the psychology of stress. You will learn about the physiological stress response (fight-or-flight) and how chronic stress can impact the immune system and overall health. We will also examine different coping strategies for managing stress. The goal is to understand the biopsychosocial model as it applies to staying healthy.",
          "prepgo_plan": {
            "total_estimated_minutes": 35,
            "learn_minutes": 12,
            "review_minutes": 8,
            "practice_minutes": 15,
            "target_study_guide_words": 1800,
            "target_flashcards_count": 16,
            "target_mcq_count": 10
          },
          "learning_objectives": [
            {
              "id": "5.1.A",
              "summary": "Explain how health psychology addresses issues of physical health and wellness."
            },
            {
              "id": "5.1.B",
              "summary": "Explain how stress applies to behavior and mental processes."
            },
            {
              "id": "5.1.C",
              "summary": "Explain how reactions to stress apply to behavior and mental processes."
            },
            {
              "id": "5.1.D",
              "summary": "Explain how the ways people cope with stress apply to behavior and mental processes."
            }
          ],
          "essential_knowledge": [
            {
              "id": "5.1.B.1",
              "summary": "Stress is a factor in heightened susceptibility to disorders and diseases like hypertension."
            },
            {
              "id": "5.1.B.2",
              "summary": "Stressors can be viewed as motivating (eustress) or debilitating (distress)."
            },
            {
              "id": "5.1.C.1",
              "summary": "The general adaptation syndrome (GAS) describes the stress process: alarm, resistance, and exhaustion."
            },
            {
              "id": "5.1.C.2",
              "summary": "The tend-and-befriend theory proposes that some people react to stress by caring for needs and seeking connection."
            },
            {
              "id": "5.1.D.1",
              "summary": "Problem-focused coping involves seeing stress as a problem to be solved."
            },
            {
              "id": "5.1.D.2",
              "summary": "Emotion-focused coping involves managing emotional reactions to stress."
            }
          ]
        },
        {
          "topic_number": "5.2",
          "ced_topic_title": "Positive Psychology",
          "topic_title": "Positive Psychology",
          "topic_overview": "Psychology isn't just about what goes wrong; it's also about what goes right. This topic introduces positive psychology, the scientific study of human strengths and flourishing. You will learn about key concepts such as happiness, well-being, and resilience. We will explore research on topics like optimism, gratitude, and the 'flow' state of deep engagement. The objective is to understand this growing field's focus on promoting strengths and virtues to help individuals and communities thrive, shifting the focus from simply treating illness to building a meaningful life.",
          "prepgo_plan": {
            "total_estimated_minutes": 28,
            "learn_minutes": 10,
            "review_minutes": 6,
            "practice_minutes": 12,
            "target_study_guide_words": 1500,
            "target_flashcards_count": 12,
            "target_mcq_count": 8
          },
          "learning_objectives": [
            {
              "id": "5.2.A",
              "summary": "Explain how positive psychology approaches the study of behavior and mental processes."
            },
            {
              "id": "5.2.B",
              "summary": "Explain how positive subjective experiences apply to behavior and mental processes."
            }
          ],
          "essential_knowledge": [
            {
              "id": "5.2.A.1",
              "summary": "Positive psychology seeks to identify factors leading to well-being, resilience, and psychological health."
            },
            {
              "id": "5.2.B.1",
              "summary": "Expressing gratitude, a positive subjective experience, increases subjective well-being."
            },
            {
              "id": "5.2.B.2",
              "summary": "People who exercise their signature strengths or virtues report higher levels of happiness."
            },
            {
              "id": "5.2.B.3",
              "summary": "Posttraumatic growth, a positive subjective experience, may result after trauma or stress."
            }
          ]
        },
        {
          "topic_number": "5.3",
          "ced_topic_title": "Explaining and Classifying Psychological Disorders",
          "topic_title": "Explaining and Classifying Psychological Disorders",
          "topic_overview": "What makes a thought or behavior a 'disorder'? This topic provides the foundation for understanding clinical psychology. You will learn the criteria psychologists use to define abnormality. We'll explore the biopsychosocial approach, which explains disorders as the result of interacting biological, psychological, and social-cultural factors. You will also be introduced to the Diagnostic and Statistical Manual of Mental Disorders (DSM), the primary system for classifying psychological disorders, understanding both its uses and its criticisms.",
          "prepgo_plan": {
            "total_estimated_minutes": 42,
            "learn_minutes": 16,
            "review_minutes": 8,
            "practice_minutes": 18,
            "target_study_guide_words": 2400,
            "target_flashcards_count": 15,
            "target_mcq_count": 12
          },
          "learning_objectives": [
            {
              "id": "5.3.A",
              "summary": "Describe the approaches used to define behaviors and mental processes as psychological disorders."
            },
            {
              "id": "5.3.B",
              "summary": "Explain how psychological perspectives define psychological disorders."
            },
            {
              "id": "5.3.C",
              "summary": "Explain how interaction models define psychological disorders."
            }
          ],
          "essential_knowledge": [
            {
              "id": "5.3.A.1",
              "summary": "Level of dysfunction, perception of distress, and deviation from social norms are used to identify psychological disorders."
            },
            {
              "id": "5.3.A.2",
              "summary": "Diagnosing psychological disorders has both positive and negative consequences related to stigma, culture, and discrimination."
            },
            {
              "id": "5.3.A.3",
              "summary": "Diagnosing disorders requires specialized training and tools like the DSM and ICD."
            },
            {
              "id": "5.3.B.1",
              "summary": "Most psychologists use an eclectic approach (multiple perspectives) for diagnosis and treatment."
            },
            {
              "id": "5.3.B.2",
              "summary": "The behavioral perspective focuses on maladaptive learned associations as causes of disorders."
            },
            {
              "id": "5.3.B.3",
              "summary": "The psychodynamic perspective focuses on unconscious thoughts and childhood experiences."
            },
            {
              "id": "5.3.B.4",
              "summary": "The humanistic perspective focuses on a lack of social support and unfulfilled potential."
            },
            {
              "id": "5.3.B.5",
              "summary": "The cognitive perspective focuses on maladaptive thoughts, beliefs, attitudes, or emotions."
            },
            {
              "id": "5.3.B.6",
              "summary": "The evolutionary perspective focuses on behaviors that reduce the likelihood of survival."
            },
            {
              "id": "5.3.B.7",
              "summary": "The sociocultural perspective focuses on maladaptive social and cultural relationships."
            },
            {
              "id": "5.3.B.8",
              "summary": "The biological perspective focuses on physiological or genetic issues."
            },
            {
              "id": "5.3.C.1",
              "summary": "The biopsychosocial model assumes problems involve a combination of biological, psychological, and sociocultural factors."
            },
            {
              "id": "5.3.C.2",
              "summary": "The diathesis-stress model assumes disorders develop from a genetic vulnerability combined with stressful life experiences."
            }
          ]
        },
        {
          "topic_number": "5.4",
          "ced_topic_title": "Selection of Categories of Psychological Disorders",
          "topic_title": "Selection of Categories of Psychological Disorders",
          "topic_overview": "This topic provides a survey of the major categories of psychological disorders as classified in the DSM. You will learn to recognize the core symptoms and defining features of several key disorders, including schizophrenia spectrum disorders, depressive and bipolar disorders, anxiety disorders, and obsessive-compulsive disorder. The goal is not to become a diagnostician, but to develop a clear and accurate understanding of the primary characteristics of these conditions, laying the groundwork for discussing their treatment.",
          "prepgo_plan": {
            "total_estimated_minutes": 45,
            "learn_minutes": 16,
            "review_minutes": 11,
            "practice_minutes": 18,
            "target_study_guide_words": 2400,
            "target_flashcards_count": 22,
            "target_mcq_count": 12
          },
          "learning_objectives": [
            {
              "id": "5.4.A",
              "summary": "Describe the symptoms and possible causes of selected neurodevelopmental disorders."
            },
            {
              "id": "5.4.B",
              "summary": "Describe the symptoms and possible causes of selected schizophrenic spectrum disorders."
            },
            {
              "id": "5.4.C",
              "summary": "Describe the symptoms and possible causes of selected depressive disorders."
            },
            {
              "id": "5.4.D",
              "summary": "Describe the symptoms and possible causes of selected bipolar disorders."
            },
            {
              "id": "5.4.E",
              "summary": "Describe the symptoms and possible causes of selected anxiety disorders."
            },
            {
              "id": "5.4.F",
              "summary": "Describe the symptoms and possible causes of selected obsessive-compulsive and related disorders."
            },
            {
              "id": "5.4.G",
              "summary": "Describe the symptoms and possible causes of selected dissociative disorders."
            },
            {
              "id": "5.4.H",
              "summary": "Describe the symptoms and possible causes of selected trauma and stressor-related disorders."
            },
            {
              "id": "5.4.I",
              "summary": "Describe the symptoms and possible causes of selected feeding and eating disorders."
            },
            {
              "id": "5.4.J",
              "summary": "Describe the symptoms and possible causes of selected personality disorders."
            }
          ],
          "essential_knowledge": [
            {
              "id": "5.4.A.1",
              "summary": "Neurodevelopmental disorders (e.g., ADHD, autism spectrum disorder) have onset during the developmental period."
            },
            {
              "id": "5.4.A.2",
              "summary": "Possible causes of neurodevelopmental disorders may be environmental, physiological, or genetic."
            },
            {
              "id": "5.4.B.1",
              "summary": "Schizophrenic spectrum disorders are characterized by delusions, hallucinations, disorganized thinking, disorganized motor behavior, and/or negative symptoms."
            },
            {
              "id": "5.4.B.1.i",
              "summary": "Delusions (false beliefs) are positive symptoms."
            },
            {
              "id": "5.4.B.1.ii",
              "summary": "Hallucinations (false perceptions) are positive symptoms."
            },
            {
              "id": "5.4.B.1.iii",
              "summary": "Disorganized thinking or speech is a positive symptom."
            },
            {
              "id": "5.4.B.1.iv",
              "summary": "Disorganized motor behavior may manifest as catatonia."
            },
            {
              "id": "5.4.B.1.v",
              "summary": "Negative symptoms present as the lack of a typical behavior, such as flat affect."
            },
            {
              "id": "5.4.B.2",
              "summary": "Possible causes of schizophrenia suggest a genetic or biological link, such as the dopamine hypothesis."
            },
            {
              "id": "5.4.C.1",
              "summary": "Depressive disorders (e.g., major depressive disorder) are characterized by sad, empty, or irritable mood."
            },
            {
              "id": "5.4.C.2",
              "summary": "Possible causes of depressive disorders focus on biological, genetic, social, cultural, behavioral, or cognitive sources."
            },
            {
              "id": "5.4.D.1",
              "summary": "Bipolar disorders are characterized by alternating periods of mania and depression."
            },
            {
              "id": "5.4.D.2",
              "summary": "Possible causes of bipolar disorders focus on biological, genetic, social, cultural, behavioral, or cognitive sources."
            },
            {
              "id": "5.4.E.1",
              "summary": "Anxiety disorders are characterized by excessive fear and/or anxiety."
            },
            {
              "id": "5.4.E.1.i",
              "summary": "Specific phobia involves fear or anxiety toward a specific object or situation."
            },
            {
              "id": "5.4.E.1.ii",
              "summary": "Agoraphobia is intense fear of specific social situations like open spaces or crowds."
            },
            {
              "id": "5.4.E.1.iii",
              "summary": "Panic disorder involves unanticipated panic attacks."
            },
            {
              "id": "5.4.E.1.iv",
              "summary": "Social anxiety disorder involves the intense fear of being judged or watched by others."
            },
            {
              "id": "5.4.E.1.v",
              "summary": "Generalized anxiety disorder (GAD) involves prolonged, nonspecific anxiety or fear."
            },
            {
              "id": "5.4.E.2",
              "summary": "Possible causes of anxiety disorders focus on learned associations, maladaptive thinking, and biological/genetic sources."
            },
            {
              "id": "5.4.F.1",
              "summary": "Obsessive-compulsive and related disorders (e.g., OCD, hoarding) are characterized by obsessions and compulsions."
            },
            {
              "id": "5.4.F.2",
              "summary": "Possible causes of OCD involve learned associations, maladaptive thinking, and biological/genetic sources."
            },
            {
              "id": "5.4.G.1",
              "summary": "Dissociative disorders (e.g., dissociative amnesia, DID) are characterized by dissociations from consciousness, memory, or identity."
            },
            {
              "id": "5.4.G.2",
              "summary": "Possible causes of dissociative disorders involve the experience of trauma or stress."
            },
            {
              "id": "5.4.H.1",
              "summary": "Trauma and stressor-related disorders (e.g., PTSD) are characterized by exposure to a traumatic event and subsequent distress."
            },
            {
              "id": "5.4.H.2",
              "summary": "Possible causes of trauma and stressor-related disorders involve the experience of trauma or stress."
            },
            {
              "id": "5.4.I.1",
              "summary": "Feeding and eating disorders (e.g., anorexia nervosa, bulimia nervosa) are characterized by altered food consumption that impairs health."
            },
            {
              "id": "5.4.I.2",
              "summary": "Possible causes of eating disorders focus on biological, genetic, social, cultural, behavioral, or cognitive sources."
            },
            {
              "id": "5.4.J.1",
              "summary": "Personality disorders are enduring, pervasive, and inflexible patterns of experience and behavior deviant from one's culture."
            },
            {
              "id": "5.4.J.1.i",
              "summary": "Cluster A personality disorders (paranoid, schizoid, schizotypal) are odd or eccentric."
            },
            {
              "id": "5.4.J.1.ii",
              "summary": "Cluster B personality disorders (antisocial, histrionic, narcissistic, borderline) are dramatic, emotional, or erratic."
            },
            {
              "id": "5.4.J.1.iii",
              "summary": "Cluster C personality disorders (avoidant, dependent, obsessive-compulsive) are anxious or fearful."
            },
            {
              "id": "5.4.J.2",
              "summary": "Possible causes of personality disorders focus on biological, genetic, social, cultural, behavioral, or cognitive sources."
            }
          ]
        },
        {
          "topic_number": "5.5",
          "ced_topic_title": "Treatment of Psychological Disorders",
          "topic_title": "Treatment of Psychological Disorders",
          "topic_overview": "How can psychological disorders be treated? This final topic reviews the major approaches to therapy. You will learn about different types of psychotherapy, including psychodynamic, humanistic, behavioral (like exposure therapy), and cognitive-behavioral therapy (CBT). We will also cover biomedical treatments, primarily the use of psychopharmacology (medications) for various disorders. The objective is to be able to compare the goals and methods of these different therapeutic approaches and understand that treatment is often most effective when combining methods.",
          "prepgo_plan": {
            "total_estimated_minutes": 44,
            "learn_minutes": 16,
            "review_minutes": 10,
            "practice_minutes": 18,
            "target_study_guide_words": 2400,
            "target_flashcards_count": 20,
            "target_mcq_count": 12
          },
          "learning_objectives": [
            {
              "id": "5.5.A",
              "summary": "Describe research and trends in the treatment of psychological disorders."
            },
            {
              "id": "5.5.B",
              "summary": "Describe research and trends in the treatment of psychological disorders."
            },
            {
              "id": "5.5.C",
              "summary": "Describe ethical principles in the treatment of psychological disorders."
            },
            {
              "id": "5.5.D",
              "summary": "Describe techniques used with psychological therapies."
            },
            {
              "id": "5.5.E",
              "summary": "Explain how group therapy is different from individual therapy."
            },
            {
              "id": "5.5.F",
              "summary": "Describe effective uses of hypnosis."
            },
            {
              "id": "5.5.G",
              "summary": "Describe interventions derived from the biological perspective."
            }
          ],
          "essential_knowledge": [
            {
              "id": "5.5.A.1",
              "summary": "Research concludes that psychotherapies are generally effective; many psychologists use evidence-based interventions."
            },
            {
              "id": "5.5.B.1",
              "summary": "Due to effective medication, deinstitutionalization occurred; treatment is now often a combination of medication and therapy."
            },
            {
              "id": "5.5.C.1",
              "summary": "Psychologists must follow APA ethical principles, including nonmaleficence, fidelity, integrity, and respect."
            },
            {
              "id": "5.5.D.1",
              "summary": "Psychodynamic therapies use free association and dream interpretation to uncover the unconscious."
            },
            {
              "id": "5.5.D.2",
              "summary": "Cognitive therapies may use cognitive restructuring to combat maladaptive thinking."
            },
            {
              "id": "5.5.D.3",
              "summary": "Applied behavior analysis uses conditioning principles, seen in exposure therapies, aversion therapies, and token economies."
            },
            {
              "id": "5.5.D.4",
              "summary": "Cognitive-behavioral therapies (e.g., DBT, REBT) combine cognitive and behavioral techniques."
            },
            {
              "id": "5.5.D.5",
              "summary": "Humanistic therapy (person-centered) employs active listening and unconditional positive regard."
            },
            {
              "id": "5.5.F.1",
              "summary": "Hypnosis has shown effectiveness in treating pain and anxiety but is not supported for memory retrieval."
            },
            {
              "id": "5.5.G.1",
              "summary": "Psychoactive medications (e.g., antidepressants, antipsychotics) interact with neurotransmitters to address biochemical causes of disorders."
            },
            {
              "id": "5.5.G.2",
              "summary": "Surgical or invasive interventions include psychosurgery, TMS, or electroconvulsive therapy."
            }
          ]
        }
      ]
    }
  ]
}