{
  "course_name": "AP Statistics",
  "units": [
    {
      "unit_number": 1,
      "unit_title": "Unit 1: Exploring One-Variable Data",
      "ced_class_periods": "~14-16 CLASS PERIODS",
      "exam_weight": "15-23%",
      "unit_overview": {
        "summary": "Welcome to the world of data! This foundational unit is your launchpad into the fascinating field of statistics. You'll start by learning how to describe and display data for a single variable. We'll explore different types of variables—categorical and quantitative—and the best ways to represent them using tables, charts, and graphs. You'll master the art of describing distributions by their shape, center, and spread, and learn to identify any unusual features like outliers. We'll dive into key summary statistics such as mean, median, standard deviation, and quartiles, understanding what they tell us and when to use them. Finally, you'll be introduced to the most famous distribution in statistics: the Normal model. This unit provides the essential vocabulary and analytical skills you'll use throughout the entire course to make sense of the data that surrounds us every day.",
        "ced_class_periods": "~14-16 Class Periods",
        "exam_weight": "15-23%",
        "prepgo_estimated_minutes": 218
      },
      "topics": [
        {
          "topic_number": "1.1",
          "topic_title": "Introducing Statistics: What Can We Learn from Data?",
          "ced_topic_title": "Introducing Statistics: What Can We Learn from Data?",
          "topic_overview": "This topic sets the stage for our entire statistical journey. We'll explore the fundamental question of what we can learn from data. You'll discover that statistics is the science of collecting, analyzing, and drawing conclusions from data. This involves understanding that variation exists everywhere and learning to distinguish between meaningful patterns and random chance. We'll discuss how data is not just a set of numbers, but a collection of values that hold context and meaning. By the end of this topic, you will understand the basic vocabulary of statistics and appreciate how it provides a powerful framework for making sense of the world.",
          "prepgo_plan": {
            "total_estimated_minutes": 15,
            "learn_minutes": 4,
            "review_minutes": 4,
            "practice_minutes": 7,
            "target_study_guide_words": 600,
            "target_flashcards_count": 8,
            "target_mcq_count": 5
          },
          "learning_objectives": [
            {
              "id": "VAR-1.A",
              "summary": "Identify questions to be answered based on variation in one-variable data."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-1.A.1",
              "summary": "Numbers can convey meaningful information when placed in context."
            }
          ]
        },
        {
          "topic_number": "1.2",
          "topic_title": "The Language of Variation: Variables",
          "ced_topic_title": "The Language of Variation: Variables",
          "topic_overview": "Data is made up of variables, but not all variables are the same. This topic introduces the two main types: categorical and quantitative. You'll learn to identify and classify variables based on the type of information they convey. Categorical variables place individuals into groups or categories (like eye color or favorite sport), while quantitative variables take on numerical values for which it makes sense to do arithmetic (like height or temperature). Understanding this distinction is crucial as it dictates the types of graphs and numerical summaries we can use. This foundational knowledge is the first step in choosing the correct statistical tools for analysis.",
          "prepgo_plan": {
            "total_estimated_minutes": 15,
            "learn_minutes": 4,
            "review_minutes": 4,
            "practice_minutes": 7,
            "target_study_guide_words": 600,
            "target_flashcards_count": 8,
            "target_mcq_count": 5
          },
          "learning_objectives": [
            {
              "id": "VAR-1.B",
              "summary": "Identify variables in a set of data."
            },
            {
              "id": "VAR-1.C",
              "summary": "Classify types of variables."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-1.B.1",
              "summary": "A variable is a characteristic that changes from one individual to another."
            },
            {
              "id": "VAR-1.C.1",
              "summary": "A categorical variable takes on values that are category names or group labels."
            },
            {
              "id": "VAR-1.C.2",
              "summary": "A quantitative variable takes on numerical values for a measured or counted quantity."
            }
          ]
        },
        {
          "topic_number": "1.3",
          "topic_title": "Representing a Categorical Variable with Tables",
          "ced_topic_title": "Representing a Categorical Variable with Tables",
          "topic_overview": "How can we organize and summarize data from a categorical variable? This topic focuses on using frequency and relative frequency tables. You'll learn how to take raw categorical data and condense it into a clear, understandable table that shows the counts (frequency) or proportions (relative frequency) for each category. These tables are the first step in identifying patterns and making comparisons. We'll explore how to properly label tables and interpret the information they contain, turning a simple list of data into a powerful summary tool that reveals key features about the group being studied.",
          "prepgo_plan": {
            "total_estimated_minutes": 18,
            "learn_minutes": 5,
            "review_minutes": 5,
            "practice_minutes": 8,
            "target_study_guide_words": 750,
            "target_flashcards_count": 10,
            "target_mcq_count": 5
          },
          "learning_objectives": [
            {
              "id": "UNC-1.A",
              "summary": "Represent categorical data using frequency or relative frequency tables."
            },
            {
              "id": "UNC-1.B",
              "summary": "Describe categorical data represented in frequency or relative tables."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-1.A.1",
              "summary": "A frequency table shows counts per category; a relative frequency table shows proportions."
            },
            {
              "id": "UNC-1.B.1",
              "summary": "Percentages, relative frequencies, and rates provide the same information as proportions."
            },
            {
              "id": "UNC-1.B.2",
              "summary": "Counts and relative frequencies of categorical data can be used to justify claims about the data in context."
            }
          ]
        },
        {
          "topic_number": "1.4",
          "topic_title": "Representing a Categorical Variable with Graphs",
          "ced_topic_title": "Representing a Categorical Variable with Graphs",
          "topic_overview": "A picture is worth a thousand words, especially in statistics! This topic teaches you how to create and interpret graphical displays for categorical data, primarily focusing on bar charts and pie charts. You'll learn the key principles of making accurate and effective graphs, ensuring they correctly represent the data from your frequency tables. We will cover how to properly label axes, use consistent scales, and choose the right type of chart for your purpose. You'll also learn to describe what you see in the graphs, identifying the most and least common categories and making comparisons between different groups.",
          "prepgo_plan": {
            "total_estimated_minutes": 20,
            "learn_minutes": 5,
            "review_minutes": 6,
            "practice_minutes": 9,
            "target_study_guide_words": 800,
            "target_flashcards_count": 12,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "UNC-1.C",
              "summary": "Represent categorical data graphically."
            },
            {
              "id": "UNC-1.D",
              "summary": "Describe categorical data represented graphically."
            },
            {
              "id": "UNC-1.E",
              "summary": "Compare multiple sets of categorical data."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-1.C.1",
              "summary": "Bar charts display frequencies or relative frequencies for categorical data."
            },
            {
              "id": "UNC-1.C.2",
              "summary": "The length of a bar in a bar graph corresponds to the count or proportion of observations in a category."
            },
            {
              "id": "UNC-1.C.3",
              "summary": "Many other types of graphs can represent frequencies for categorical data."
            },
            {
              "id": "UNC-1.D.1",
              "summary": "Graphical representations of a categorical variable can justify claims about the data in context."
            },
            {
              "id": "UNC-1.E.1",
              "summary": "Frequency tables and bar graphs can be used to compare two or more data sets for the same categorical variable."
            }
          ]
        },
        {
          "topic_number": "1.5",
          "topic_title": "Representing a Quantitative Variable with Graphs",
          "ced_topic_title": "Representing a Quantitative Variable with Graphs",
          "topic_overview": "Now we shift our focus to visualizing quantitative data. This topic introduces several key graphical displays: dotplots, stemplots, and histograms. You will learn the specific steps to construct each of these graphs by hand and using technology. Each type of graph has its own strengths, and you'll discover when to use each one to get the best picture of the data's distribution. The goal is to move beyond a list of numbers to a visual representation that reveals the underlying pattern, shape, and spread of the data, setting the stage for more formal numerical analysis.",
          "prepgo_plan": {
            "total_estimated_minutes": 26,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 12,
            "target_study_guide_words": 1000,
            "target_flashcards_count": 15,
            "target_mcq_count": 8
          },
          "learning_objectives": [
            {
              "id": "UNC-1.F",
              "summary": "Classify types of quantitative variables."
            },
            {
              "id": "UNC-1.G",
              "summary": "Represent quantitative data graphically."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-1.F.1",
              "summary": "A discrete variable can take a countable number of values."
            },
            {
              "id": "UNC-1.F.2",
              "summary": "A continuous variable can take on infinitely many values within an interval."
            },
            {
              "id": "UNC-1.G.1",
              "summary": "A histogram's bar height shows the number or proportion of observations in an interval."
            },
            {
              "id": "UNC-1.G.2",
              "summary": "A stem and leaf plot splits each data value into a 'stem' and a 'leaf'."
            },
            {
              "id": "UNC-1.G.3",
              "summary": "A dotplot represents each observation with a dot on a horizontal axis."
            },
            {
              "id": "UNC-1.G.4",
              "summary": "A cumulative graph shows the number or proportion of data less than or equal to a given value."
            },
            {
              "id": "UNC-1.G.5",
              "summary": "Many other graphical representations exist for quantitative data distributions."
            }
          ]
        },
        {
          "topic_number": "1.6",
          "topic_title": "Describing the Distribution of a Quantitative Variable",
          "ced_topic_title": "Describing the Distribution of a Quantitative Variable",
          "topic_overview": "Once we have a graph of quantitative data, we need a systematic way to describe what we see. This topic provides the essential framework for that description. You'll learn to analyze a distribution in terms of its Shape (symmetric, skewed left, skewed right, unimodal, bimodal), Outliers and other unusual features, Center (the typical value), and Spread (the amount of variability). Mastering this 'SOCS' framework is fundamental to statistics. It allows you to communicate the key features of a dataset in a clear and consistent manner, telling the story hidden within the numbers and graphs.",
          "prepgo_plan": {
            "total_estimated_minutes": 22,
            "learn_minutes": 6,
            "review_minutes": 7,
            "practice_minutes": 9,
            "target_study_guide_words": 900,
            "target_flashcards_count": 14,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "UNC-1.H",
              "summary": "Describe the characteristics of quantitative data distributions."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-1.H.1",
              "summary": "Descriptions of quantitative data include shape, center, variability, and unusual features like outliers, gaps, clusters, or multiple peaks."
            },
            {
              "id": "UNC-1.H.2",
              "summary": "Outliers are data points that are unusually small or large relative to the rest of the data."
            },
            {
              "id": "UNC-1.H.3",
              "summary": "A distribution's skew is determined by the length of its tails; symmetric distributions have mirrored halves."
            },
            {
              "id": "UNC-1.H.4",
              "summary": "Distributions can be described by their number of peaks (unimodal, bimodal) or as approximately uniform."
            },
            {
              "id": "UNC-1.H.5",
              "summary": "A gap is a region in a distribution with no observed data."
            },
            {
              "id": "UNC-1.H.6",
              "summary": "Clusters are concentrations of data, usually separated by gaps."
            },
            {
              "id": "UNC-1.H.7",
              "summary": "Descriptive statistics summarize a data set but do not attribute its properties to a larger population."
            }
          ]
        },
        {
          "topic_number": "1.7",
          "topic_title": "Summary Statistics for a Quantitative Variable",
          "ced_topic_title": "Summary Statistics for a Quantitative Variable",
          "topic_overview": "While graphs give us a visual sense of the data, numbers provide precise measures. This topic introduces the key numerical summaries for quantitative data. We'll cover measures of center, like the mean and median, and learn how they are affected by the shape of the distribution. You'll also learn to calculate measures of spread, including the range, interquartile range (IQR), and standard deviation, to quantify the variability in the data. Understanding how to calculate and interpret these statistics is crucial for summarizing data, comparing different datasets, and identifying potential outliers using rules like the 1.5xIQR rule.",
          "prepgo_plan": {
            "total_estimated_minutes": 28,
            "learn_minutes": 8,
            "review_minutes": 8,
            "practice_minutes": 12,
            "target_study_guide_words": 1200,
            "target_flashcards_count": 16,
            "target_mcq_count": 8
          },
          "learning_objectives": [
            {
              "id": "UNC-1.I",
              "summary": "Calculate measures of center and position for quantitative data."
            },
            {
              "id": "UNC-1.J",
              "summary": "Calculate measures of variability for quantitative data."
            },
            {
              "id": "UNC-1.K",
              "summary": "Explain the selection of a particular measure of center and/or variability for describing a set of quantitative data."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-1.I.1",
              "summary": "A statistic is a numerical summary of sample data."
            },
            {
              "id": "UNC-1.I.2",
              "summary": "The mean is the sum of data values divided by the number of values."
            },
            {
              "id": "UNC-1.I.3",
              "summary": "The median is the middle value of an ordered data set."
            },
            {
              "id": "UNC-1.I.4",
              "summary": "The first quartile (Q1) and third quartile (Q3) are the medians of the lower and upper halves of the data, respectively."
            },
            {
              "id": "UNC-1.I.5",
              "summary": "The Pth percentile is the value that has p% of the data less than or equal to it."
            },
            {
              "id": "UNC-1.J.1",
              "summary": "Common measures of variability are range, interquartile range (IQR), and standard deviation."
            },
            {
              "id": "UNC-1.J.2",
              "summary": "Range is the difference between the maximum and minimum values; IQR is the difference between Q3 and Q1."
            },
            {
              "id": "UNC-1.J.3",
              "summary": "Standard deviation measures variability; its square is called the variance."
            },
            {
              "id": "UNC-1.J.4",
              "summary": "Changing units of measurement affects calculated statistics."
            },
            {
              "id": "UNC-1.K.1",
              "summary": "Outliers can be identified as values more than 1.5xIQR beyond the quartiles or 2 or more standard deviations from the mean."
            },
            {
              "id": "UNC-1.K.2",
              "summary": "Mean, standard deviation, and range are nonresistant to outliers, while median and IQR are resistant."
            }
          ]
        },
        {
          "topic_number": "1.8",
          "topic_title": "Graphical Representations of Summary Statistics",
          "ced_topic_title": "Graphical Representations of Summary Statistics",
          "topic_overview": "Let's combine our knowledge of numerical summaries and graphical displays. This topic focuses on the boxplot (or box-and-whisker plot), a powerful graph that is created from the five-number summary (minimum, Q1, median, Q3, maximum). You will learn how to construct a boxplot and how it visually represents the center, spread, and symmetry or skewness of a distribution. Boxplots are particularly useful for identifying outliers and for comparing the distributions of two or more groups side-by-side, which is a key skill for later units in the course.",
          "prepgo_plan": {
            "total_estimated_minutes": 20,
            "learn_minutes": 5,
            "review_minutes": 6,
            "practice_minutes": 9,
            "target_study_guide_words": 800,
            "target_flashcards_count": 12,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "UNC-1.L",
              "summary": "Represent summary statistics for quantitative data graphically."
            },
            {
              "id": "UNC-1.M",
              "summary": "Describe summary statistics of quantitative data represented graphically."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-1.L.1",
              "summary": "The five-number summary consists of the minimum, first quartile (Q1), median, third quartile (Q3), and maximum."
            },
            {
              "id": "UNC-1.L.2",
              "summary": "A boxplot is a graphical representation of the five-number summary."
            },
            {
              "id": "UNC-1.M.1",
              "summary": "Summary statistics can be used to justify claims about quantitative data in context."
            },
            {
              "id": "UNC-1.M.2",
              "summary": "The relationship between mean and median is affected by the skewness of the distribution."
            }
          ]
        },
        {
          "topic_number": "1.9",
          "topic_title": "Comparing Distributions of a Quantitative Variable",
          "ced_topic_title": "Comparing Distributions of a Quantitative Variable",
          "topic_overview": "Statistics is often about comparison. This topic pulls together everything you've learned so far to compare the distributions of a quantitative variable across two or more groups. Using side-by-side graphical displays (like histograms or boxplots) and comparing relevant summary statistics (like means and standard deviations), you will learn to make meaningful, context-based comparisons. The key is to use comparative language and to address all four key features: shape, outliers, center, and spread. This skill is essential for answering many real-world questions, such as whether a new teaching method is more effective than an old one.",
          "prepgo_plan": {
            "total_estimated_minutes": 25,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 11,
            "target_study_guide_words": 1050,
            "target_flashcards_count": 14,
            "target_mcq_count": 7
          },
          "learning_objectives": [
            {
              "id": "UNC-1.N",
              "summary": "Compare graphical representations for multiple sets of quantitative data."
            },
            {
              "id": "UNC-1.O",
              "summary": "Compare summary statistics for multiple sets of quantitative data."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-1.N.1",
              "summary": "Graphical representations can be used to compare two or more independent samples on various features."
            },
            {
              "id": "UNC-1.O.1",
              "summary": "Numerical summaries can be used to compare two or more independent samples."
            }
          ]
        },
        {
          "topic_number": "1.10",
          "topic_title": "The Normal Distribution",
          "ced_topic_title": "The Normal Distribution",
          "topic_overview": "This topic introduces the most important and frequently used distribution in statistics: the Normal distribution. You'll learn about its unique bell shape, its properties of symmetry, and how it is defined by its mean and standard deviation. We'll explore the Empirical Rule (68-95-99.7 rule) as a way to quickly understand the spread of data in a Normal model. You'll also learn how to calculate and interpret z-scores to find the relative standing of any observation within a distribution. This powerful model serves as the foundation for statistical inference that we will build upon throughout the rest of the course.",
          "prepgo_plan": {
            "total_estimated_minutes": 31,
            "learn_minutes": 9,
            "review_minutes": 10,
            "practice_minutes": 12,
            "target_study_guide_words": 1300,
            "target_flashcards_count": 20,
            "target_mcq_count": 8
          },
          "learning_objectives": [
            {
              "id": "VAR-1.A",
              "summary": "Identify questions to be answered based on variation in one-variable data."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-1.A.1",
              "summary": "Numbers can convey meaningful information when placed in context."
            }
          ]
        }
      ]
    },
    {
      "unit_number": 2,
      "unit_title": "Unit 2: Exploring Two-Variable Data",
      "ced_class_periods": "~10-11 CLASS PERIODS",
      "exam_weight": "5-7%",
      "unit_overview": {
        "summary": "In this unit, we move from analyzing one variable at a time to exploring relationships between two variables. You'll discover how to analyze patterns in bivariate data, which is a critical skill for understanding the complex connections in the world around us. We'll start by examining relationships between two categorical variables using two-way tables and graphical displays. Then, you'll dive into the world of quantitative relationships, learning how to create and interpret scatterplots to describe the form, direction, and strength of an association. You will learn to calculate and interpret correlation, a numerical measure of the strength and direction of a linear relationship. Finally, you'll learn how to model linear relationships with a least-squares regression line, use it to make predictions, and assess how well the model fits the data.",
        "ced_class_periods": "~10-11 Class Periods",
        "exam_weight": "5-7%",
        "prepgo_estimated_minutes": 204
      },
      "topics": [
        {
          "topic_number": "2.1",
          "topic_title": "Introducing Statistics: Are Variables Related?",
          "ced_topic_title": "Introducing Statistics: Are Variables Related?",
          "topic_overview": "This introductory topic frames our exploration of bivariate data. We'll focus on the core question: are two variables related? You'll learn to distinguish between an explanatory variable (which may help predict or explain changes) and a response variable (which measures the outcome). Understanding this relationship is the first step in formal analysis. We will discuss the concept of association, recognizing that just because two variables are related, it doesn't mean one causes the other. This topic sets the conceptual foundation for the specific graphical and numerical tools you'll learn to investigate and describe these relationships.",
          "prepgo_plan": {
            "total_estimated_minutes": 15,
            "learn_minutes": 4,
            "review_minutes": 4,
            "practice_minutes": 7,
            "target_study_guide_words": 600,
            "target_flashcards_count": 8,
            "target_mcq_count": 5
          },
          "learning_objectives": [
            {
              "id": "VAR-1.D",
              "summary": "Identify questions to be answered about possible relationships in data."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-1.D.1",
              "summary": "Apparent patterns and associations in data may be random or not."
            }
          ]
        },
        {
          "topic_number": "2.2",
          "topic_title": "Representing Two Categorical Variables",
          "ced_topic_title": "Representing Two Categorical Variables",
          "topic_overview": "How do we examine the relationship between two categorical variables? This topic introduces the two-way table as the primary tool for organizing the data. You'll learn to read and construct these tables to display the joint frequencies of two variables. We will also explore graphical methods like side-by-side bar charts and segmented bar charts, which provide powerful visual comparisons. These tools allow you to see how the distribution of one categorical variable changes across the categories of another, which is the first step in identifying a possible association between them.",
          "prepgo_plan": {
            "total_estimated_minutes": 20,
            "learn_minutes": 5,
            "review_minutes": 6,
            "practice_minutes": 9,
            "target_study_guide_words": 800,
            "target_flashcards_count": 12,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "UNC-1.P",
              "summary": "Compare numerical and graphical representations for two categorical variables."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-1.P.1",
              "summary": "Side-by-side, segmented, and mosaic bar graphs are used for two categorical variables."
            },
            {
              "id": "UNC-1.P.2",
              "summary": "Graphical representations of two categorical variables can compare distributions or determine association."
            },
            {
              "id": "UNC-1.P.3",
              "summary": "A two-way table (contingency table) summarizes two categorical variables with frequencies or relative frequencies."
            },
            {
              "id": "UNC-1.P.4",
              "summary": "A joint relative frequency is a cell frequency divided by the total for the entire table."
            }
          ]
        },
        {
          "topic_number": "2.3",
          "topic_title": "Statistics for Two Categorical Variables",
          "ced_topic_title": "Statistics for Two Categorical Variables",
          "topic_overview": "Beyond just looking at counts, this topic delves into the numerical summaries for two-way tables. You'll learn to calculate and interpret marginal and conditional distributions. Marginal distributions focus on the totals for each variable separately, while conditional distributions are the key to exploring relationships. By calculating conditional relative frequencies, you can examine the distribution of one variable 'conditional on' the category of the other. Comparing these conditional distributions allows us to determine if there is an association between the two variables. If the distributions are different, it provides evidence of a relationship.",
          "prepgo_plan": {
            "total_estimated_minutes": 25,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 11,
            "target_study_guide_words": 1000,
            "target_flashcards_count": 15,
            "target_mcq_count": 7
          },
          "learning_objectives": [
            {
              "id": "UNC-1.Q",
              "summary": "Calculate statistics for two categorical variables."
            },
            {
              "id": "UNC-1.R",
              "summary": "Compare statistics for two categorical variables."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-1.Q.1",
              "summary": "Marginal relative frequencies are row or column totals divided by the grand total in a two-way table."
            },
            {
              "id": "UNC-1.Q.2",
              "summary": "A conditional relative frequency is a relative frequency for a specific part of a contingency table."
            },
            {
              "id": "UNC-1.R.1",
              "summary": "Summary statistics for two categorical variables can compare distributions or determine association."
            }
          ]
        },
        {
          "topic_number": "2.4",
          "topic_title": "Representing the Relationship Between Two Quantitative Variables",
          "ced_topic_title": "Representing the Relationship Between Two Quantitative Variables",
          "topic_overview": "Now we turn to relationships between two quantitative variables. The primary tool for this is the scatterplot. In this topic, you will learn how to construct and, more importantly, interpret scatterplots. We'll develop a framework for describing the relationship based on four key characteristics: Direction (positive or negative), Form (linear or non-linear), Strength (weak, moderate, or strong), and Unusual Features (like outliers or clusters). This descriptive framework is the quantitative equivalent of 'SOCS' from Unit 1 and is essential for communicating your analysis of bivariate quantitative data.",
          "prepgo_plan": {
            "total_estimated_minutes": 22,
            "learn_minutes": 6,
            "review_minutes": 7,
            "practice_minutes": 9,
            "target_study_guide_words": 900,
            "target_flashcards_count": 14,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "UNC-1.S",
              "summary": "Represent bivariate quantitative data using scatterplots."
            },
            {
              "id": "DAT-1.A",
              "summary": "Describe the characteristics of a scatter plot."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-1.S.1",
              "summary": "A bivariate quantitative data set consists of observations of two different quantitative variables."
            },
            {
              "id": "UNC-1.S.2",
              "summary": "A scatterplot shows two numeric values for each observation, one for the x-axis and one for the y-axis."
            },
            {
              "id": "UNC-1.S.3",
              "summary": "An explanatory variable is used to explain or predict values of the response variable."
            },
            {
              "id": "DAT-1.A.1",
              "summary": "A description of a scatter plot includes form, direction, strength, and unusual features."
            },
            {
              "id": "DAT-1.A.2",
              "summary": "The direction of association in a scatterplot can be positive or negative."
            },
            {
              "id": "DAT-1.A.3",
              "summary": "A positive association means as one variable increases, the other tends to increase; a negative association means as one increases, the other tends to decrease."
            },
            {
              "id": "DAT-1.A.4",
              "summary": "The form of association can be described as linear or non-linear."
            },
            {
              "id": "DAT-1.A.5",
              "summary": "The strength of association is how closely points follow a pattern and can be described as strong, moderate, or weak."
            },
            {
              "id": "DAT-1.A.6",
              "summary": "Unusual features of a scatter plot include clusters or points with large residuals."
            }
          ]
        },
        {
          "topic_number": "2.5",
          "topic_title": "Correlation",
          "ced_topic_title": "Correlation",
          "topic_overview": "While a scatterplot gives us a visual sense of the relationship, the correlation coefficient, 'r', provides a precise numerical measure of the strength and direction of a *linear* relationship. In this topic, you will learn about the properties of correlation, such as the fact that it is always between -1 and 1. You'll learn how to interpret the value of 'r' in context. A key takeaway is understanding the limitations of correlation: it only measures linear associations and does not imply causation. Correlation is a powerful tool, but it's crucial to understand what it does and does not tell us.",
          "prepgo_plan": {
            "total_estimated_minutes": 25,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 11,
            "target_study_guide_words": 1000,
            "target_flashcards_count": 15,
            "target_mcq_count": 7
          },
          "learning_objectives": [
            {
              "id": "DAT-1.B",
              "summary": "Determine the correlation for a linear relationship."
            },
            {
              "id": "DAT-1.C",
              "summary": "Interpret the correlation for a linear relationship."
            }
          ],
          "essential_knowledge": [
            {
              "id": "DAT-1.B.1",
              "summary": "The correlation, r, gives the direction and quantifies the strength of a linear association."
            },
            {
              "id": "DAT-1.B.2",
              "summary": "The correlation coefficient is most commonly determined using technology."
            },
            {
              "id": "DAT-1.B.3",
              "summary": "A correlation coefficient close to 1 or -1 does not necessarily mean a linear model is appropriate."
            },
            {
              "id": "DAT-1.C.1",
              "summary": "Correlation, r, is unit-free and always between -1 and 1. A value of 0 indicates no linear association."
            },
            {
              "id": "DAT-1.C.2",
              "summary": "Correlation does not necessarily imply causation."
            }
          ]
        },
        {
          "topic_number": "2.6",
          "topic_title": "Linear Regression Models",
          "ced_topic_title": "Linear Regression Models",
          "topic_overview": "When a scatterplot shows a linear relationship, we can model it with a straight line. This topic introduces the concept of a regression line, a model that describes how a response variable 'y' changes as an explanatory variable 'x' changes. You will learn to use the equation of a least-squares regression line, y-hat = a + bx, to predict values of 'y' for given values of 'x'. We will also focus heavily on interpreting the slope and y-intercept of the line in the context of the real-world data. It's essential to understand that these models are for prediction, not for making definitive statements.",
          "prepgo_plan": {
            "total_estimated_minutes": 25,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 11,
            "target_study_guide_words": 1050,
            "target_flashcards_count": 14,
            "target_mcq_count": 7
          },
          "learning_objectives": [
            {
              "id": "DAT-1.D",
              "summary": "Calculate a predicted response value using a linear regression model."
            }
          ],
          "essential_knowledge": [
            {
              "id": "DAT-1.D.1",
              "summary": "A simple linear regression model is an equation that uses an explanatory variable, x, to predict a response variable, y."
            },
            {
              "id": "DAT-1.D.2",
              "summary": "The predicted response value is calculated as y-hat = a + bx, where a is the y-intercept and b is the slope."
            },
            {
              "id": "DAT-1.D.3",
              "summary": "Extrapolation is predicting a response for an x-value outside the interval used to determine the regression line; it is less reliable."
            }
          ]
        },
        {
          "topic_number": "2.7",
          "topic_title": "Residuals",
          "ced_topic_title": "Residuals",
          "topic_overview": "How well does our linear model fit the data? This topic introduces residuals, which are the prediction errors for each data point. A residual is the difference between the observed y-value and the predicted y-value (y - y-hat). You will learn to calculate and interpret residuals. More importantly, you will learn to create and analyze a residual plot—a scatterplot of the residuals against the explanatory variable. The pattern in the residual plot is a key diagnostic tool. A random scatter of points indicates a good linear fit, while a curved pattern or changing spread suggests that a linear model may not be appropriate.",
          "prepgo_plan": {
            "total_estimated_minutes": 22,
            "learn_minutes": 6,
            "review_minutes": 7,
            "practice_minutes": 9,
            "target_study_guide_words": 900,
            "target_flashcards_count": 14,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "DAT-1.E",
              "summary": "Represent differences between measured and predicted responses using residual plots."
            },
            {
              "id": "DAT-1.F",
              "summary": "Describe the form of association of bivariate data using residual plots."
            }
          ],
          "essential_knowledge": [
            {
              "id": "DAT-1.E.1",
              "summary": "A residual is the difference between the actual and predicted value: residual = y - y-hat."
            },
            {
              "id": "DAT-1.E.2",
              "summary": "A residual plot is a plot of residuals versus explanatory variable values or predicted response values."
            },
            {
              "id": "DAT-1.F.1",
              "summary": "Apparent randomness in a residual plot for a linear model suggests a linear form of association."
            },
            {
              "id": "DAT-1.F.2",
              "summary": "Residual plots can be used to investigate the appropriateness of a selected model."
            }
          ]
        },
        {
          "topic_number": "2.8",
          "topic_title": "Least Squares Regression",
          "ced_topic_title": "Least Squares Regression",
          "topic_overview": "This topic gets into the details of how the 'best' regression line is found. You'll learn about the least-squares criterion, which minimizes the sum of the squared residuals. We will explore the formulas for the slope and intercept of the least-squares regression line and how they relate to the means, standard deviations, and correlation of the two variables. You'll also learn about two important measures for assessing the model: the standard deviation of the residuals (s) and the coefficient of determination (r-squared). Interpreting these values in context is a critical skill for evaluating the usefulness of a regression model.",
          "prepgo_plan": {
            "total_estimated_minutes": 28,
            "learn_minutes": 8,
            "review_minutes": 8,
            "practice_minutes": 12,
            "target_study_guide_words": 1200,
            "target_flashcards_count": 16,
            "target_mcq_count": 8
          },
          "learning_objectives": [
            {
              "id": "DAT-1.G",
              "summary": "Estimate parameters for the least-squares regression line model."
            },
            {
              "id": "DAT-1.H",
              "summary": "Interpret coefficients for the least-squares regression line model."
            }
          ],
          "essential_knowledge": [
            {
              "id": "DAT-1.G.1",
              "summary": "The least-squares regression model minimizes the sum of squared residuals and passes through the point (x-bar, y-bar)."
            },
            {
              "id": "DAT-1.G.2",
              "summary": "The slope, b, of the regression line can be calculated as b = r(sy/sx)."
            },
            {
              "id": "DAT-1.G.3",
              "summary": "The y-intercept may not have a logical interpretation in context."
            },
            {
              "id": "DAT-1.G.4",
              "summary": "r-squared, the coefficient of determination, is the proportion of variation in the response variable explained by the model."
            },
            {
              "id": "DAT-1.H.1",
              "summary": "The coefficients of the least-squares regression model are the estimated slope and y-intercept."
            },
            {
              "id": "DAT-1.H.2",
              "summary": "The slope is the amount the predicted y-value changes for every unit increase in x."
            },
            {
              "id": "DAT-1.H.3",
              "summary": "The y-intercept is the predicted y-value when the explanatory variable is 0."
            }
          ]
        },
        {
          "topic_number": "2.9",
          "topic_title": "Analyzing Departures from Linearity",
          "ced_topic_title": "Analyzing Departures from Linearity",
          "topic_overview": "Not all relationships between two quantitative variables are linear. This topic teaches you how to recognize when a linear model is not appropriate and what to do about it. By examining scatterplots and, more importantly, residual plots, you will learn to identify non-linear patterns. We'll briefly explore methods for transforming data (such as using logarithms or powers) to make a non-linear relationship more linear. You'll also learn to identify influential points, such as outliers, and understand how they can affect the correlation and the regression line. This topic adds a layer of sophistication to your modeling skills.",
          "prepgo_plan": {
            "total_estimated_minutes": 22,
            "learn_minutes": 6,
            "review_minutes": 7,
            "practice_minutes": 9,
            "target_study_guide_words": 900,
            "target_flashcards_count": 14,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "DAT-1.I",
              "summary": "Identify influential points in regression."
            },
            {
              "id": "DAT-1.J",
              "summary": "Calculate a predicted response using a least-squares regression line for a transformed data set."
            }
          ],
          "essential_knowledge": [
            {
              "id": "DAT-1.I.1",
              "summary": "An outlier in regression does not follow the general trend and has a large residual."
            },
            {
              "id": "DAT-1.I.2",
              "summary": "A high-leverage point has a substantially larger or smaller x-value than other observations."
            },
            {
              "id": "DAT-1.I.3",
              "summary": "An influential point, if removed, substantially changes the regression model."
            },
            {
              "id": "DAT-1.J.1",
              "summary": "Transforming variables can create a data set that is more linear."
            },
            {
              "id": "DAT-1.J.2",
              "summary": "Increased randomness in residual plots and an r-squared value closer to 1 after transformation suggest a more appropriate model."
            }
          ]
        }
      ]
    },
    {
      "unit_number": 3,
      "unit_title": "Unit 3: Collecting Data",
      "ced_class_periods": "~9-10 CLASS PERIODS",
      "exam_weight": "12-15%",
      "unit_overview": {
        "summary": "This unit focuses on a cornerstone of statistics: how we collect data. The methods we use to gather information are critical, as they determine the scope and validity of our conclusions. You will learn the difference between an observational study and an experiment and understand the types of conclusions that can be drawn from each. We will explore various sampling methods—such as simple random, stratified, and cluster sampling—and the importance of randomness in avoiding bias. You'll also learn to identify potential sources of bias in sampling and surveys. Then, you'll dive into the principles of good experimental design, including comparison, random assignment, control, and replication. This unit is essential for understanding how to produce high-quality data that can be used to make reliable inferences about the world.",
        "ced_class_periods": "~9-10 Class Periods",
        "exam_weight": "12-15%",
        "prepgo_estimated_minutes": 149
      },
      "topics": [
        {
          "topic_number": "3.1",
          "topic_title": "Introducing Statistics: Do the Data We Collected Tell the Truth?",
          "ced_topic_title": "Introducing Statistics: Do the Data We Collected Tell the Truth?",
          "topic_overview": "This topic poses a critical question that underlies all of data collection: can we trust our data? We will explore the idea that the conclusions we draw are only as good as the data they are based on. You will learn that data collection methods that do not incorporate randomness are likely to produce misleading results due to bias. This introduction emphasizes the importance of planning how to collect data before we start. It sets the stage for why we must learn about proper sampling techniques and experimental design to ensure our statistical conclusions are valid and trustworthy.",
          "prepgo_plan": {
            "total_estimated_minutes": 15,
            "learn_minutes": 4,
            "review_minutes": 4,
            "practice_minutes": 7,
            "target_study_guide_words": 600,
            "target_flashcards_count": 8,
            "target_mcq_count": 5
          },
          "learning_objectives": [
            {
              "id": "VAR-1.E",
              "summary": "Identify questions to be answered about data collection methods."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-1.E.1",
              "summary": "Data collection methods not based on chance can lead to untrustworthy conclusions."
            }
          ]
        },
        {
          "topic_number": "3.2",
          "topic_title": "Introduction to Planning a Study",
          "ced_topic_title": "Introduction to Planning a Study",
          "topic_overview": "This topic introduces the two primary ways of producing data: observational studies and experiments. You will learn the fundamental difference between them: in an experiment, a treatment is deliberately imposed on individuals to observe their responses, while in an observational study, we simply observe individuals and measure variables of interest without attempting to influence the responses. This distinction is crucial because it determines the type of conclusions we can draw. While experiments can provide evidence for causation, observational studies can only show association. We'll explore the vocabulary of studies, including population, sample, and census.",
          "prepgo_plan": {
            "total_estimated_minutes": 20,
            "learn_minutes": 5,
            "review_minutes": 6,
            "practice_minutes": 9,
            "target_study_guide_words": 800,
            "target_flashcards_count": 12,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "DAT-2.A",
              "summary": "Identify the type of a study."
            },
            {
              "id": "DAT-2.B",
              "summary": "Identify appropriate generalizations and determinations based on observational studies."
            }
          ],
          "essential_knowledge": [
            {
              "id": "DAT-2.A.1",
              "summary": "A population consists of all items or subjects of interest."
            },
            {
              "id": "DAT-2.A.2",
              "summary": "A sample is a subset of the population."
            },
            {
              "id": "DAT-2.A.3",
              "summary": "In an observational study, treatments are not imposed; investigators simply observe."
            },
            {
              "id": "DAT-2.A.4",
              "summary": "In an experiment, different conditions (treatments) are assigned to experimental units."
            },
            {
              "id": "DAT-2.B.1",
              "summary": "Generalizations about a population can only be made from randomly selected or representative samples."
            },
            {
              "id": "DAT-2.B.2",
              "summary": "A sample is only generalizable to the population from which it was selected."
            },
            {
              "id": "DAT-2.B.3",
              "summary": "Causal relationships cannot be determined from an observational study."
            }
          ]
        },
        {
          "topic_number": "3.3",
          "topic_title": "Random Sampling and Data Collection",
          "ced_topic_title": "Random Sampling and Data Collection",
          "topic_overview": "How can we select a sample that we trust to represent a larger population? This topic dives into the methods of random sampling. You'll learn about the gold standard, the Simple Random Sample (SRS), where every group has an equal chance of being selected. We will also explore other important random sampling methods, including stratified random sampling, cluster sampling, and systematic random sampling. For each method, you'll learn the mechanics of how to perform the sample and, crucially, understand the advantages and disadvantages of each in different situations. The goal is to select a method that gives us the best possible representation of the population.",
          "prepgo_plan": {
            "total_estimated_minutes": 26,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 12,
            "target_study_guide_words": 1000,
            "target_flashcards_count": 15,
            "target_mcq_count": 8
          },
          "learning_objectives": [
            {
              "id": "DAT-2.C",
              "summary": "Identify a sampling method, given a description of a study."
            },
            {
              "id": "DAT-2.D",
              "summary": "Explain why a particular sampling method is or is not appropriate for a given situation."
            }
          ],
          "essential_knowledge": [
            {
              "id": "DAT-2.C.1",
              "summary": "Sampling without replacement means an item can be selected only once; with replacement, it can be selected multiple times."
            },
            {
              "id": "DAT-2.C.2",
              "summary": "A simple random sample (SRS) is one where every group of a given size has an equal chance of being chosen."
            },
            {
              "id": "DAT-2.C.3",
              "summary": "A stratified random sample divides a population into strata (homogeneous groups) and takes an SRS from each."
            },
            {
              "id": "DAT-2.C.4",
              "summary": "A cluster sample divides a population into clusters, randomly selects some clusters, and collects data from all individuals in those clusters."
            },
            {
              "id": "DAT-2.C.5",
              "summary": "A systematic random sample selects members from a population at a fixed periodic interval from a random starting point."
            },
            {
              "id": "DAT-2.C.6",
              "summary": "A census selects all items/subjects in a population."
            },
            {
              "id": "DAT-2.D.1",
              "summary": "Each sampling method has advantages and disadvantages depending on the situation."
            }
          ]
        },
        {
          "topic_number": "3.4",
          "topic_title": "Potential Problems with Sampling",
          "ced_topic_title": "Potential Problems with Sampling",
          "topic_overview": "Even with a good sampling plan, things can go wrong. This topic introduces the concept of bias, where a study's design systematically favors certain outcomes. You'll learn to identify various types of bias that can arise in sampling and surveys. These include undercoverage, where some groups in the population are left out of the sampling process; nonresponse, where an individual chosen for the sample can't be contacted or refuses to participate; and response bias, where there is a systematic pattern of inaccurate answers. Understanding these potential pitfalls is key to being a critical consumer of statistical information.",
          "prepgo_plan": {
            "total_estimated_minutes": 22,
            "learn_minutes": 6,
            "review_minutes": 7,
            "practice_minutes": 9,
            "target_study_guide_words": 900,
            "target_flashcards_count": 14,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "DAT-2.E",
              "summary": "Identify potential sources of bias in sampling methods."
            }
          ],
          "essential_knowledge": [
            {
              "id": "DAT-2.E.1",
              "summary": "Bias occurs when certain responses are systematically favored over others."
            },
            {
              "id": "DAT-2.E.2",
              "summary": "Voluntary response bias occurs when a sample is comprised entirely of volunteers."
            },
            {
              "id": "DAT-2.E.3",
              "summary": "Undercoverage bias occurs when part of the population has a reduced chance of being included in the sample."
            },
            {
              "id": "DAT-2.E.4",
              "summary": "Nonresponse bias occurs when individuals chosen for the sample cannot be reached or refuse to respond."
            },
            {
              "id": "DAT-2.E.5",
              "summary": "Response bias results from problems in the data gathering process, like leading questions."
            },
            {
              "id": "DAT-2.E.6",
              "summary": "Non-random sampling methods introduce potential for bias because they do not use chance."
            }
          ]
        },
        {
          "topic_number": "3.5",
          "topic_title": "Introduction to Experimental Design",
          "ced_topic_title": "Introduction to Experimental Design",
          "topic_overview": "This topic is your guide to the world of experiments. You'll learn the basic vocabulary of experiments, including experimental units, explanatory and response variables, and treatments. We will cover the four key principles of a well-designed experiment: Comparison of at least two treatment groups; Random assignment of experimental units to treatments; Control of other variables that might affect the response; and Replication to ensure we have enough experimental units in each group. You'll also learn about the placebo effect and the importance of blinding to prevent bias in experiments involving human subjects.",
          "prepgo_plan": {
            "total_estimated_minutes": 25,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 11,
            "target_study_guide_words": 1050,
            "target_flashcards_count": 14,
            "target_mcq_count": 7
          },
          "learning_objectives": [
            {
              "id": "VAR-3.A",
              "summary": "Identify the components of an experiment."
            },
            {
              "id": "VAR-3.B",
              "summary": "Describe elements of a well-designed experiment."
            },
            {
              "id": "VAR-3.C",
              "summary": "Compare experimental designs and methods."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-3.A.1",
              "summary": "Experimental units are the individuals to which treatments are assigned."
            },
            {
              "id": "VAR-3.A.2",
              "summary": "An explanatory variable (factor) is intentionally manipulated; its levels are called treatments."
            },
            {
              "id": "VAR-3.A.3",
              "summary": "A response variable is the outcome measured after treatments have been administered."
            },
            {
              "id": "VAR-3.A.4",
              "summary": "A confounding variable is related to the explanatory variable and influences the response variable."
            },
            {
              "id": "VAR-3.B.1",
              "summary": "A well-designed experiment includes comparison of treatments, random assignment, replication, and control of confounding variables."
            },
            {
              "id": "VAR-3.C.1",
              "summary": "In a completely randomized design, treatments are assigned to experimental units completely at random."
            },
            {
              "id": "VAR-3.C.2",
              "summary": "Methods for random assignment include random number generators, tables, or drawing chips."
            },
            {
              "id": "VAR-3.C.3",
              "summary": "In a single-blind experiment, either the subjects or the researchers do not know which treatment is being received."
            },
            {
              "id": "VAR-3.C.4",
              "summary": "In a double-blind experiment, neither the subjects nor the interacting researchers know which treatment is being received."
            },
            {
              "id": "VAR-3.C.5",
              "summary": "A control group receives no treatment or a placebo to determine if the treatment of interest has an effect."
            },
            {
              "id": "VAR-3.C.6",
              "summary": "The placebo effect occurs when experimental units have a response to a placebo."
            },
            {
              "id": "VAR-3.C.7",
              "summary": "In a randomized complete block design, treatments are assigned randomly within each block."
            },
            {
              "id": "VAR-3.C.8",
              "summary": "Blocking ensures units within each block are similar, helping to separate natural variability from treatment effects."
            },
            {
              "id": "VAR-3.C.9",
              "summary": "A matched pairs design is a special case of a block design where subjects are arranged in pairs."
            }
          ]
        },
        {
          "topic_number": "3.6",
          "topic_title": "Selecting an Experimental Design",
          "ced_topic_title": "Selecting an Experimental Design",
          "topic_overview": "Not all experiments are designed the same way. This topic explores different types of experimental designs and when to use them. You will learn about the completely randomized design, where all experimental units are allocated at random among all treatments. We will then explore more advanced designs, such as the randomized block design, which is used to control for a variable that we know is likely to affect the response. A special type of block design, the matched pairs design, is also introduced. Understanding these different designs allows researchers to create more precise and effective experiments.",
          "prepgo_plan": {
            "total_estimated_minutes": 22,
            "learn_minutes": 6,
            "review_minutes": 7,
            "practice_minutes": 9,
            "target_study_guide_words": 900,
            "target_flashcards_count": 14,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "VAR-3.D",
              "summary": "Explain why a particular experimental design is appropriate."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-3.D.1",
              "summary": "Each experimental design has advantages and disadvantages depending on the research question and resources."
            }
          ]
        },
        {
          "topic_number": "3.7",
          "topic_title": "Inference and Experiments",
          "ced_topic_title": "Inference and Experiments",
          "topic_overview": "This topic connects the principles of experimental design to the idea of statistical inference. You will learn why a well-designed experiment is so important: it allows us to draw cause-and-effect conclusions. By using random assignment, we can be confident that significant differences in the response are due to the treatments and not some other confounding variable. We will also discuss the scope of inference. Random selection of subjects allows us to generalize our conclusions to a larger population, while random assignment to treatments allows us to infer causation. Understanding both is key to interpreting experimental results correctly.",
          "prepgo_plan": {
            "total_estimated_minutes": 19,
            "learn_minutes": 5,
            "review_minutes": 5,
            "practice_minutes": 9,
            "target_study_guide_words": 750,
            "target_flashcards_count": 11,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "VAR-3.E",
              "summary": "Interpret the results of a well-designed experiment."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-3.E.1",
              "summary": "Statistical inference attributes conclusions based on data to the distribution from which it was collected."
            },
            {
              "id": "VAR-3.E.2",
              "summary": "Random assignment allows concluding that observed changes are unlikely to be due to chance, i.e., are statistically significant."
            },
            {
              "id": "VAR-3.E.3",
              "summary": "Statistically significant differences between treatment groups are evidence that the treatments caused the effect."
            },
            {
              "id": "VAR-3.E.4",
              "summary": "If experimental units are representative of a larger group, results can be generalized to that group."
            }
          ]
        }
      ]
    },
    {
      "unit_number": 4,
      "unit_title": "Unit 4: Probability, Random Variables, and Probability Distributions",
      "ced_class_periods": "~18-20 CLASS PERIODS",
      "exam_weight": "10-20%",
      "unit_overview": {
        "summary": "Get ready to explore the mathematical foundation of statistics: probability. This unit is all about quantifying uncertainty and understanding the patterns that emerge from random phenomena. You'll start with the basic rules of probability, including the concepts of mutually exclusive and independent events. You'll learn how to use these rules to calculate the probability of complex events. Then, we will introduce the concept of a random variable and its probability distribution, which describes the possible values of the variable and their likelihoods. You will learn to calculate the mean (expected value) and standard deviation of a random variable. Finally, we will study two important discrete probability distributions in detail: the binomial and geometric distributions. This unit provides the essential tools for modeling random processes and is the gateway to statistical inference.",
        "ced_class_periods": "~18-20 Class Periods",
        "exam_weight": "10-20%",
        "prepgo_estimated_minutes": 286
      },
      "topics": [
        {
          "topic_number": "4.1",
          "topic_title": "Introducing Statistics: Random and Non-Random Patterns?",
          "ced_topic_title": "Introducing Statistics: Random and Non-Random Patterns?",
          "topic_overview": "This topic introduces the core idea of probability: the study of randomness. We observe that while the outcomes of individual random events are uncertain, there is a regular, predictable pattern in the long run. You will learn to think about probability as the long-run relative frequency of an event. We will explore how to use simulation to investigate random processes and estimate probabilities. This introduction helps build an intuitive understanding of probability before we dive into the formal mathematical rules. The key is to see that apparent patterns in data do not necessarily mean that the process is not random.",
          "prepgo_plan": {
            "total_estimated_minutes": 15,
            "learn_minutes": 4,
            "review_minutes": 4,
            "practice_minutes": 7,
            "target_study_guide_words": 600,
            "target_flashcards_count": 8,
            "target_mcq_count": 5
          },
          "learning_objectives": [
            {
              "id": "VAR-1.F",
              "summary": "Identify questions suggested by patterns in data."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-1.F.1",
              "summary": "Patterns in data do not necessarily mean that variation is not random."
            }
          ]
        },
        {
          "topic_number": "4.2",
          "topic_title": "Estimating Probabilities Using Simulation",
          "ced_topic_title": "Estimating Probabilities Using Simulation",
          "topic_overview": "How can we determine the probability of a complex event when the theoretical rules are difficult to apply? This topic introduces simulation as a powerful tool for estimating probabilities. You will learn the steps for designing and carrying out a simulation: describe how to use a random process to represent one trial of the event, perform many trials, and use the results to estimate the probability. This hands-on approach builds a strong conceptual understanding of probability and the law of large numbers, which states that our simulation-based estimates will get closer to the true probability as we increase the number of trials.",
          "prepgo_plan": {
            "total_estimated_minutes": 22,
            "learn_minutes": 6,
            "review_minutes": 7,
            "practice_minutes": 9,
            "target_study_guide_words": 900,
            "target_flashcards_count": 14,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "UNC-2.A",
              "summary": "Estimate probabilities using simulation."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-2.A.1",
              "summary": "A random process generates results determined by chance."
            },
            {
              "id": "UNC-2.A.2",
              "summary": "An outcome is the result of a trial of a random process."
            },
            {
              "id": "UNC-2.A.3",
              "summary": "An event is a collection of outcomes."
            },
            {
              "id": "UNC-2.A.4",
              "summary": "Simulation is a way to model random events."
            },
            {
              "id": "UNC-2.A.5",
              "summary": "The relative frequency of an event in a simulation can be used to estimate its probability."
            },
            {
              "id": "UNC-2.A.6",
              "summary": "The law of large numbers states that empirical probabilities approach true probabilities as the number of trials increases."
            }
          ]
        },
        {
          "topic_number": "4.3",
          "topic_title": "Introduction to Probability",
          "ced_topic_title": "Introduction to Probability",
          "topic_overview": "This topic lays the groundwork for formal probability theory. You will learn the basic vocabulary, including sample space, event, and outcome. We'll cover the fundamental rules of probability, such as the fact that all probabilities must be between 0 and 1, and that the probabilities of all outcomes in the sample space must sum to 1. You will also learn the complement rule, which provides a useful shortcut for finding the probability that an event does not occur. We will use tools like Venn diagrams to help visualize and solve probability problems, setting the stage for more complex rules to come.",
          "prepgo_plan": {
            "total_estimated_minutes": 25,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 11,
            "target_study_guide_words": 1050,
            "target_flashcards_count": 14,
            "target_mcq_count": 7
          },
          "learning_objectives": [
            {
              "id": "VAR-4.A",
              "summary": "Calculate probabilities for events and their complements."
            },
            {
              "id": "VAR-4.B",
              "summary": "Interpret probabilities for events."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-4.A.1",
              "summary": "The sample space is the set of all possible non-overlapping outcomes."
            },
            {
              "id": "VAR-4.A.2",
              "summary": "If all outcomes are equally likely, P(E) = (number of outcomes in E) / (total number of outcomes)."
            },
            {
              "id": "VAR-4.A.3",
              "summary": "The probability of an event is a number between 0 and 1, inclusive."
            },
            {
              "id": "VAR-4.A.4",
              "summary": "The probability of the complement of an event E is 1 - P(E)."
            },
            {
              "id": "VAR-4.B.1",
              "summary": "Probability can be interpreted as the long-run relative frequency of an event."
            }
          ]
        },
        {
          "topic_number": "4.4",
          "topic_title": "Mutually Exclusive Events",
          "ced_topic_title": "Mutually Exclusive Events",
          "topic_overview": "In this topic, you'll learn about a special relationship between events called 'mutually exclusive' or 'disjoint.' Two events are mutually exclusive if they have no outcomes in common and thus cannot happen at the same time. For example, when you roll a single die, the events 'rolling a 2' and 'rolling a 5' are mutually exclusive. Understanding this concept is crucial for applying the correct probability rules. We will explore how to identify mutually exclusive events and how this property simplifies the 'addition rule' for finding the probability that one event *or* another occurs.",
          "prepgo_plan": {
            "total_estimated_minutes": 18,
            "learn_minutes": 5,
            "review_minutes": 5,
            "practice_minutes": 8,
            "target_study_guide_words": 750,
            "target_flashcards_count": 10,
            "target_mcq_count": 5
          },
          "learning_objectives": [
            {
              "id": "VAR-4.C",
              "summary": "Explain why two events are (or are not) mutually exclusive."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-4.C.1",
              "summary": "The joint probability, P(A and B), is the probability of the intersection of events A and B."
            },
            {
              "id": "VAR-4.C.2",
              "summary": "Two events are mutually exclusive (disjoint) if they cannot occur at the same time, so P(A and B) = 0."
            }
          ]
        },
        {
          "topic_number": "4.5",
          "topic_title": "Conditional Probability",
          "ced_topic_title": "Conditional Probability",
          "topic_overview": "This topic introduces one of the most important concepts in probability: conditional probability. You will learn how to calculate the probability of an event occurring *given that* another event has already occurred. This is denoted as P(A|B). We will explore the formula for conditional probability and see how it can be derived intuitively from a two-way table. Understanding conditional probability is essential for many real-world applications and is the foundation for the concept of independence between events, which we will explore next. Mastering this concept will significantly enhance your problem-solving skills.",
          "prepgo_plan": {
            "total_estimated_minutes": 28,
            "learn_minutes": 8,
            "review_minutes": 8,
            "practice_minutes": 12,
            "target_study_guide_words": 1200,
            "target_flashcards_count": 16,
            "target_mcq_count": 8
          },
          "learning_objectives": [
            {
              "id": "VAR-4.D",
              "summary": "Calculate conditional probabilities."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-4.D.1",
              "summary": "The conditional probability P(A|B) is P(A and B) / P(B)."
            },
            {
              "id": "VAR-4.D.2",
              "summary": "The multiplication rule states P(A and B) = P(A) * P(B|A)."
            }
          ]
        },
        {
          "topic_number": "4.6",
          "topic_title": "Independent Events and Unions of Events",
          "ced_topic_title": "Independent Events and Unions of Events",
          "topic_overview": "Building on conditional probability, this topic explores the concept of independence. Two events are independent if the occurrence of one does not change the probability of the other. You will learn the formal definition of independence and how to test for it using probability rules. We will also cover the general addition rule for finding the probability of the union of two events (P(A or B)), which applies whether the events are mutually exclusive or not. Finally, we'll introduce the general multiplication rule for finding the probability that two events both occur. Tools like tree diagrams will be used to help organize and solve these more complex problems.",
          "prepgo_plan": {
            "total_estimated_minutes": 28,
            "learn_minutes": 8,
            "review_minutes": 8,
            "practice_minutes": 12,
            "target_study_guide_words": 1200,
            "target_flashcards_count": 16,
            "target_mcq_count": 8
          },
          "learning_objectives": [
            {
              "id": "VAR-4.E",
              "summary": "Calculate probabilities for independent events and for the union of two events."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-4.E.1",
              "summary": "Events A and B are independent if knowing A occurs does not change the probability of B."
            },
            {
              "id": "VAR-4.E.2",
              "summary": "If events A and B are independent, P(A|B) = P(A), P(B|A) = P(B), and P(A and B) = P(A) * P(B)."
            },
            {
              "id": "VAR-4.E.3",
              "summary": "The probability of the union of A and B, P(A or B), is the probability that A, B, or both occur."
            },
            {
              "id": "VAR-4.E.4",
              "summary": "The addition rule states P(A or B) = P(A) + P(B) - P(A and B)."
            }
          ]
        },
        {
          "topic_number": "4.7",
          "topic_title": "Introduction to Random Variables and Probability Distributions",
          "ced_topic_title": "Introduction to Random Variables and Probability Distributions",
          "topic_overview": "This topic shifts our focus from events to numerical outcomes by introducing the concept of a random variable. A random variable, usually denoted by X, takes on a numerical value for each outcome of a random process. You will learn to distinguish between discrete random variables (which have a countable number of possible values) and continuous random variables (which can take any value in an interval). We will focus on creating a probability distribution for a discrete random variable, which lists all possible values and their corresponding probabilities. This distribution is the key to understanding the long-run behavior of the variable.",
          "prepgo_plan": {
            "total_estimated_minutes": 20,
            "learn_minutes": 5,
            "review_minutes": 6,
            "practice_minutes": 9,
            "target_study_guide_words": 800,
            "target_flashcards_count": 12,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "VAR-5.A",
              "summary": "Represent the probability distribution for a discrete random variable."
            },
            {
              "id": "VAR-5.B",
              "summary": "Interpret a probability distribution."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-5.A.1",
              "summary": "The values of a random variable are the numerical outcomes of random behavior."
            },
            {
              "id": "VAR-5.A.2",
              "summary": "A discrete random variable can take a countable number of values, with the sum of probabilities equal to 1."
            },
            {
              "id": "VAR-5.A.3",
              "summary": "A probability distribution can be represented by a graph, table, or function."
            },
            {
              "id": "VAR-5.A.4",
              "summary": "A cumulative probability distribution shows the probability of being less than or equal to each value."
            },
            {
              "id": "VAR-5.B.1",
              "summary": "Interpreting a probability distribution provides information about the shape, center, and spread of a population."
            }
          ]
        },
        {
          "topic_number": "4.8",
          "topic_title": "Mean and Standard Deviation of Random Variables",
          "ced_topic_title": "Mean and Standard Deviation of Random Variables",
          "topic_overview": "Just as we calculated summary statistics for data in Unit 1, we can calculate parameters for a probability distribution. This topic introduces the mean (or expected value) and the standard deviation of a discrete random variable. The expected value represents the theoretical long-run average value of the random variable if the random process were repeated many times. The standard deviation measures the typical distance of the outcomes from the mean. You will learn the formulas for calculating these parameters and, more importantly, how to interpret them in the context of a real-world scenario.",
          "prepgo_plan": {
            "total_estimated_minutes": 25,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 11,
            "target_study_guide_words": 1050,
            "target_flashcards_count": 14,
            "target_mcq_count": 7
          },
          "learning_objectives": [
            {
              "id": "VAR-5.C",
              "summary": "Calculate parameters for a discrete random variable."
            },
            {
              "id": "VAR-5.D",
              "summary": "Interpret parameters for a discrete random variable."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-5.C.1",
              "summary": "A parameter is a numerical value measuring a characteristic of a population or distribution."
            },
            {
              "id": "VAR-5.C.2",
              "summary": "The mean (expected value) of a discrete random variable X is the sum of (value * probability)."
            },
            {
              "id": "VAR-5.C.3",
              "summary": "The standard deviation of a discrete random variable X is the square root of the sum of (squared deviation from the mean * probability)."
            },
            {
              "id": "VAR-5.D.1",
              "summary": "Parameters for a discrete random variable should be interpreted in context with appropriate units."
            }
          ]
        },
        {
          "topic_number": "4.9",
          "topic_title": "Combining Random Variables",
          "ced_topic_title": "Combining Random Variables",
          "topic_overview": "What happens to the mean and standard deviation if we add or subtract random variables? This topic explores the rules for combining random variables. You will learn how to find the mean and standard deviation of the sum or difference of two random variables. A key concept here is the independence of the variables. The rule for variances always involves addition, even when we are subtracting the random variables themselves. These rules are powerful tools that allow us to model more complex situations, such as the total profit from two different business ventures.",
          "prepgo_plan": {
            "total_estimated_minutes": 25,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 11,
            "target_study_guide_words": 1000,
            "target_flashcards_count": 15,
            "target_mcq_count": 7
          },
          "learning_objectives": [
            {
              "id": "VAR-5.E",
              "summary": "Calculate parameters for linear combinations of random variables."
            },
            {
              "id": "VAR-5.F",
              "summary": "Describe the effects of linear transformations of parameters of random variables."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-5.E.1",
              "summary": "The mean of a linear combination of random variables, aX + bY, is a*mean(X) + b*mean(Y)."
            },
            {
              "id": "VAR-5.E.2",
              "summary": "Two random variables are independent if knowing one does not change the probability distribution of the other."
            },
            {
              "id": "VAR-5.E.3",
              "summary": "For independent random variables, the variance of aX + bY is a^2*var(X) + b^2*var(Y)."
            },
            {
              "id": "VAR-5.F.1",
              "summary": "For Y = a + bX, the shape of the probability distribution is the same. The mean is a + b*mean(X) and the standard deviation is |b|*sd(X)."
            }
          ]
        },
        {
          "topic_number": "4.10",
          "topic_title": "Introduction to the Binomial Distribution",
          "ced_topic_title": "Introduction to the Binomial Distribution",
          "topic_overview": "This topic introduces a very common and important type of discrete random variable: the binomial random variable. You will learn to identify a binomial setting, which has four conditions: a fixed number of trials, each trial is independent, there are only two outcomes (success or failure) for each trial, and the probability of success is the same for each trial. A binomial random variable counts the number of successes in a fixed number of trials. We will learn how to use the binomial probability formula to calculate the probability of getting a specific number of successes.",
          "prepgo_plan": {
            "total_estimated_minutes": 26,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 12,
            "target_study_guide_words": 1100,
            "target_flashcards_count": 15,
            "target_mcq_count": 8
          },
          "learning_objectives": [
            {
              "id": "VAR-1.F",
              "summary": "Identify questions suggested by patterns in data."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-1.F.1",
              "summary": "Patterns in data do not necessarily mean that variation is not random."
            }
          ]
        },
        {
          "topic_number": "4.11",
          "topic_title": "Parameters for a Binomial Distribution",
          "ced_topic_title": "Parameters for a Binomial Distribution",
          "topic_overview": "Now that you can identify a binomial setting and calculate probabilities, this topic focuses on the parameters of a binomial distribution. You will learn the simple formulas for calculating the mean (expected value) and standard deviation of a binomial random variable: μ = np and σ = sqrt(np(1-p)). These formulas provide a much quicker way to find the center and spread of a binomial distribution than the general formulas for random variables. As always, the focus will be on interpreting these parameters in the context of the problem, understanding what they tell us about the long-run outcomes of the binomial experiment.",
          "prepgo_plan": {
            "total_estimated_minutes": 22,
            "learn_minutes": 6,
            "review_minutes": 7,
            "practice_minutes": 9,
            "target_study_guide_words": 900,
            "target_flashcards_count": 14,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "UNC-3.C",
              "summary": "Calculate parameters for a binomial distribution."
            },
            {
              "id": "UNC-3.D",
              "summary": "Interpret probabilities and parameters for a binomial distribution."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-3.C.1",
              "summary": "The mean of a binomial random variable is np, and its standard deviation is sqrt(np(1-p))."
            },
            {
              "id": "UNC-3.D.1",
              "summary": "Probabilities and parameters for a binomial distribution should be interpreted in context."
            }
          ]
        },
        {
          "topic_number": "4.12",
          "topic_title": "The Geometric Distribution",
          "ced_topic_title": "The Geometric Distribution",
          "topic_overview": "This topic introduces another important discrete probability model: the geometric distribution. While a binomial variable counts the number of successes in a fixed number of trials, a geometric random variable counts the number of trials it takes to get the *first* success. You will learn to identify a geometric setting, which has conditions similar to the binomial setting. We will cover how to calculate probabilities for a geometric random variable and learn the formulas for its mean (expected value) and standard deviation. This distribution is useful for modeling situations where we are waiting for an event to happen.",
          "prepgo_plan": {
            "total_estimated_minutes": 22,
            "learn_minutes": 6,
            "review_minutes": 7,
            "practice_minutes": 9,
            "target_study_guide_words": 900,
            "target_flashcards_count": 14,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "UNC-3.E",
              "summary": "Calculate probabilities for geometric random variables."
            },
            {
              "id": "UNC-3.F",
              "summary": "Calculate parameters of a geometric distribution."
            },
            {
              "id": "UNC-3.G",
              "summary": "Interpret probabilities and parameters for a geometric distribution."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-3.E.1",
              "summary": "A geometric random variable gives the trial number on which the first success occurs in a sequence of independent trials."
            },
            {
              "id": "UNC-3.E.2",
              "summary": "The geometric probability function calculates the probability that the first success occurs on trial x."
            },
            {
              "id": "UNC-3.F.1",
              "summary": "The mean of a geometric random variable is 1/p, and its standard deviation is sqrt(1-p)/p."
            },
            {
              "id": "UNC-3.G.1",
              "summary": "Probabilities and parameters for a geometric distribution should be interpreted in context."
            }
          ]
        }
      ]
    },
    {
      "unit_number": 5,
      "unit_title": "Unit 5: Sampling Distributions",
      "ced_class_periods": "~10-12 CLASS PERIODS",
      "exam_weight": "7-12%",
      "unit_overview": {
        "summary": "This unit forms the crucial bridge between probability and statistical inference. Here, you'll discover the concept of a sampling distribution, which is the distribution of a statistic (like a sample proportion or sample mean) in all possible samples of the same size from the same population. You will learn how the mean and standard deviation of a sampling distribution relate to the parameters of the population. The highlight of this unit is the Central Limit Theorem, a remarkable result that says that for large samples, the sampling distribution of the sample mean will be approximately Normal, regardless of the shape of the population distribution. Understanding sampling distributions is the key to understanding how we can use a single sample to make a reliable inference about an entire population.",
        "ced_class_periods": "~10-12 Class Periods",
        "exam_weight": "7-12%",
        "prepgo_estimated_minutes": 198
      },
      "topics": [
        {
          "topic_number": "5.1",
          "topic_title": "Introducing Statistics: Why Is My Sample Not Like Yours?",
          "ced_topic_title": "Introducing Statistics: Why Is My Sample Not Like Yours?",
          "topic_overview": "This topic explores a fundamental concept: sampling variability. If we take multiple random samples from the same population, the statistics we calculate (like the sample proportion or sample mean) will vary from sample to sample. This is natural and expected. The goal of this topic is to understand that this variation is not arbitrary but follows a predictable pattern. The pattern of this variation is what we call the sampling distribution. This introduction sets the stage for our study of how statistics behave in repeated sampling, which is the foundation for all of statistical inference.",
          "prepgo_plan": {
            "total_estimated_minutes": 18,
            "learn_minutes": 5,
            "review_minutes": 5,
            "practice_minutes": 8,
            "target_study_guide_words": 750,
            "target_flashcards_count": 10,
            "target_mcq_count": 5
          },
          "learning_objectives": [
            {
              "id": "VAR-1.G",
              "summary": "Identify questions suggested by variation in statistics for samples from the same population."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-1.G.1",
              "summary": "Variation in statistics for samples from the same population may be random or not."
            }
          ]
        },
        {
          "topic_number": "5.2",
          "topic_title": "The Normal Distribution, Revisited",
          "ced_topic_title": "The Normal Distribution, Revisited",
          "topic_overview": "We revisit our old friend, the Normal distribution, but with a new focus. This topic reviews the key properties of Normal distributions and their importance in statistics. You will practice calculating probabilities and finding values from a Normal distribution using z-scores and technology. This review is essential because the Normal distribution is the shape that describes many sampling distributions, either exactly or approximately. A solid understanding of the Normal model is a prerequisite for the concepts to come in this unit and for the inference procedures you will learn in the rest of the course.",
          "prepgo_plan": {
            "total_estimated_minutes": 22,
            "learn_minutes": 6,
            "review_minutes": 7,
            "practice_minutes": 9,
            "target_study_guide_words": 900,
            "target_flashcards_count": 14,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "VAR-6.A",
              "summary": "Calculate the probability that a particular value lies in a given interval of a normal distribution."
            },
            {
              "id": "VAR-6.B",
              "summary": "Determine the interval associated with a given area in a normal distribution."
            },
            {
              "id": "VAR-6.C",
              "summary": "Determine the appropriateness of using the normal distribution to approximate probabilities for unknown distributions."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-6.A.1",
              "summary": "A continuous random variable can take any value within a specified domain."
            },
            {
              "id": "VAR-6.A.2",
              "summary": "A continuous random variable with a normal distribution is described by a bell-shaped curve."
            },
            {
              "id": "VAR-6.A.3",
              "summary": "The area under a normal curve over an interval represents the probability that a value lies in that interval."
            },
            {
              "id": "VAR-6.B.1",
              "summary": "Interval boundaries for a given area in a normal distribution can be found using z-scores or technology."
            },
            {
              "id": "VAR-6.B.2",
              "summary": "Intervals associated with a given area in a normal distribution can be determined using appropriate inequalities."
            },
            {
              "id": "VAR-6.C.1",
              "summary": "Normal distributions can be used to approximate other distributions with similar symmetrical, bell-shaped characteristics."
            }
          ]
        },
        {
          "topic_number": "5.3",
          "topic_title": "The Central Limit Theorem",
          "ced_topic_title": "The Central Limit Theorem",
          "topic_overview": "This topic introduces one of the most amazing and important theorems in all of statistics: the Central Limit Theorem (CLT). The CLT tells us that for a population with any shape, the sampling distribution of the sample mean (x-bar) will be approximately Normal, as long as the sample size is large enough. This is a powerful result because it allows us to use the Normal distribution to make inferences about a population mean even if we don't know the shape of the population distribution. You will learn the conditions under which the CLT applies and understand its profound implications for statistical practice.",
          "prepgo_plan": {
            "total_estimated_minutes": 28,
            "learn_minutes": 8,
            "review_minutes": 8,
            "practice_minutes": 12,
            "target_study_guide_words": 1200,
            "target_flashcards_count": 16,
            "target_mcq_count": 8
          },
          "learning_objectives": [
            {
              "id": "UNC-3.H",
              "summary": "Estimate sampling distributions using simulation."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-3.H.1",
              "summary": "A sampling distribution of a statistic is the distribution of values for that statistic from all possible samples of a given size."
            },
            {
              "id": "UNC-3.H.2",
              "summary": "The central limit theorem (CLT) states that for a large enough sample size, the sampling distribution of the mean will be approximately normal."
            },
            {
              "id": "UNC-3.H.3",
              "summary": "The CLT requires independent sample values and a sufficiently large sample size (n)."
            },
            {
              "id": "UNC-3.H.4",
              "summary": "A randomization distribution is a collection of statistics generated by simulation assuming known parameter values."
            },
            {
              "id": "UNC-3.H.5",
              "summary": "The sampling distribution of a statistic can be simulated by generating repeated random samples from a population."
            }
          ]
        },
        {
          "topic_number": "5.4",
          "topic_title": "Biased and Unbiased Point Estimates",
          "ced_topic_title": "Biased and Unbiased Point Estimates",
          "topic_overview": "When we use a statistic to estimate a population parameter, we want our estimate to be accurate. This topic introduces the concepts of bias and variability for estimators. An estimator is unbiased if the mean of its sampling distribution is equal to the true value of the parameter being estimated. We also want our estimator to have low variability, meaning the values of the statistic don't spread out too much. You will learn that sample proportions and sample means are unbiased estimators of their corresponding population parameters. Understanding these properties helps us choose the best statistic for making an estimate.",
          "prepgo_plan": {
            "total_estimated_minutes": 20,
            "learn_minutes": 5,
            "review_minutes": 6,
            "practice_minutes": 9,
            "target_study_guide_words": 800,
            "target_flashcards_count": 12,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "UNC-3.I",
              "summary": "Explain why an estimator is or is not unbiased."
            },
            {
              "id": "UNC-3.J",
              "summary": "Calculate estimates for a population parameter."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-3.I.1",
              "summary": "An estimator is unbiased if its average value equals the population parameter."
            },
            {
              "id": "UNC-3.J.1",
              "summary": "An estimator exhibits variability that can be modeled using probability."
            },
            {
              "id": "UNC-3.J.2",
              "summary": "A sample statistic serves as a point estimator for the corresponding population parameter."
            }
          ]
        },
        {
          "topic_number": "5.5",
          "topic_title": "Sampling Distributions for Sample Proportions",
          "ced_topic_title": "Sampling Distributions for Sample Proportions",
          "topic_overview": "This topic focuses specifically on the sampling distribution of a sample proportion (p-hat). You will learn the formulas for the mean and standard deviation of the sampling distribution of p-hat. We will also cover the conditions under which this sampling distribution can be approximated by a Normal distribution (the Large Counts Condition). This allows us to calculate the probability of getting a certain sample proportion, given a known population proportion. This is a critical building block for confidence intervals and significance tests for proportions, which you will learn in the next unit.",
          "prepgo_plan": {
            "total_estimated_minutes": 28,
            "learn_minutes": 8,
            "review_minutes": 8,
            "practice_minutes": 12,
            "target_study_guide_words": 1200,
            "target_flashcards_count": 16,
            "target_mcq_count": 8
          },
          "learning_objectives": [
            {
              "id": "UNC-3.K",
              "summary": "Determine parameters of a sampling distribution for sample proportions."
            },
            {
              "id": "UNC-3.L",
              "summary": "Determine whether a sampling distribution for a sample proportion can be described as approximately normal."
            },
            {
              "id": "UNC-3.M",
              "summary": "Interpret probabilities and parameters for a sampling distribution for a sample proportion."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-3.K.1",
              "summary": "The sampling distribution of a sample proportion p-hat has a mean equal to p and a standard deviation of sqrt(p(1-p)/n)."
            },
            {
              "id": "UNC-3.K.2",
              "summary": "If sampling without replacement and the sample size is less than 10% of the population, the standard deviation formula is approximately correct."
            },
            {
              "id": "UNC-3.L.1",
              "summary": "The sampling distribution of p-hat is approximately normal if np >= 10 and n(1-p) >= 10 (Large Counts Condition)."
            },
            {
              "id": "UNC-3.M.1",
              "summary": "Probabilities and parameters for the sampling distribution of a sample proportion should be interpreted in context."
            }
          ]
        },
        {
          "topic_number": "5.6",
          "topic_title": "Sampling Distributions for Differences in Sample Proportions",
          "ced_topic_title": "Sampling Distributions for Differences in Sample Proportions",
          "topic_overview": "Often, we are interested in comparing two populations. This topic extends our knowledge to the sampling distribution of the difference between two sample proportions (p-hat1 - p-hat2). You will learn the formulas for the mean and standard deviation of this sampling distribution. Just like with a single proportion, we will explore the conditions under which the sampling distribution of the difference can be approximated by a Normal distribution. This knowledge is essential for performing inference to compare two population proportions, a common task in statistical studies.",
          "prepgo_plan": {
            "total_estimated_minutes": 26,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 12,
            "target_study_guide_words": 1100,
            "target_flashcards_count": 15,
            "target_mcq_count": 8
          },
          "learning_objectives": [
            {
              "id": "UNC-3.N",
              "summary": "Determine parameters of a sampling distribution for a difference in sample proportions."
            },
            {
              "id": "UNC-3.O",
              "summary": "Determine whether a sampling distribution for a difference of sample proportions can be described as approximately normal."
            },
            {
              "id": "UNC-3.P",
              "summary": "Interpret probabilities and parameters for a sampling distribution for a difference in proportions."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-3.N.1",
              "summary": "The sampling distribution of the difference in sample proportions has a mean of p1 - p2 and a specific standard deviation formula."
            },
            {
              "id": "UNC-3.N.2",
              "summary": "If sampling without replacement and sample sizes are less than 10% of their populations, the standard deviation formula is approximately correct."
            },
            {
              "id": "UNC-3.O.1",
              "summary": "The sampling distribution of the difference in sample proportions is approximately normal if the Large Counts Condition is met for both samples."
            },
            {
              "id": "UNC-3.P.1",
              "summary": "Parameters for a sampling distribution for a difference of proportions should be interpreted in context."
            }
          ]
        },
        {
          "topic_number": "5.7",
          "topic_title": "Sampling Distributions for Sample Means",
          "ced_topic_title": "Sampling Distributions for Sample Means",
          "topic_overview": "This topic focuses on the sampling distribution of a sample mean (x-bar). You will learn the formulas for the mean and standard deviation of the sampling distribution of x-bar. We'll see that the mean of the sampling distribution is the same as the population mean, and its standard deviation is smaller than the population standard deviation. We'll bring in the Central Limit Theorem to establish the conditions under which this sampling distribution is approximately Normal. This allows us to calculate the probability of observing a particular sample mean, which is a key step in inference about a population mean.",
          "prepgo_plan": {
            "total_estimated_minutes": 28,
            "learn_minutes": 8,
            "review_minutes": 8,
            "practice_minutes": 12,
            "target_study_guide_words": 1200,
            "target_flashcards_count": 16,
            "target_mcq_count": 8
          },
          "learning_objectives": [
            {
              "id": "UNC-3.Q",
              "summary": "Determine parameters for a sampling distribution for sample means."
            },
            {
              "id": "UNC-3.R",
              "summary": "Determine whether a sampling distribution of a sample mean can be described as approximately normal."
            },
            {
              "id": "UNC-3.S",
              "summary": "Interpret probabilities and parameters for a sampling distribution for a sample mean."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-3.Q.1",
              "summary": "The sampling distribution of the sample mean x-bar has a mean equal to mu and a standard deviation of sigma/sqrt(n)."
            },
            {
              "id": "UNC-3.Q.2",
              "summary": "If sampling without replacement and the sample size is less than 10% of the population, the standard deviation formula is approximately correct."
            },
            {
              "id": "UNC-3.R.1",
              "summary": "If the population distribution is normal, the sampling distribution of the sample mean is also normal."
            },
            {
              "id": "UNC-3.R.2",
              "summary": "If the population distribution is not normal, the sampling distribution of the sample mean is approximately normal if the sample size is large enough (e.g., n >= 30)."
            },
            {
              "id": "UNC-3.S.1",
              "summary": "Probabilities and parameters for a sampling distribution for a sample mean should be interpreted in context."
            }
          ]
        },
        {
          "topic_number": "5.8",
          "topic_title": "Sampling Distributions for Differences in Sample Means",
          "ced_topic_title": "Sampling Distributions for Differences in Sample Means",
          "topic_overview": "Finally, we consider the sampling distribution of the difference between two sample means (x-bar1 - x-bar2). This is the tool we need to compare the means of two different populations. You will learn the formulas for the mean and standard deviation of this sampling distribution. We will also cover the conditions for this distribution to be approximately Normal, which depends on the shapes of the two population distributions and the two sample sizes. This topic completes your toolkit of sampling distributions and prepares you for the inference procedures for comparing two means in a later unit.",
          "prepgo_plan": {
            "total_estimated_minutes": 28,
            "learn_minutes": 8,
            "review_minutes": 8,
            "practice_minutes": 12,
            "target_study_guide_words": 1200,
            "target_flashcards_count": 16,
            "target_mcq_count": 8
          },
          "learning_objectives": [
            {
              "id": "UNC-3.T",
              "summary": "Determine parameters of a sampling distribution for a difference in sample means."
            },
            {
              "id": "UNC-3.U",
              "summary": "Determine whether a sampling distribution of a difference in sample means can be described as approximately normal."
            },
            {
              "id": "UNC-3.V",
              "summary": "Interpret probabilities and parameters for a sampling distribution for a difference in sample means."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-3.T.1",
              "summary": "The sampling distribution of the difference in sample means has a mean of mu1 - mu2 and a specific standard deviation formula."
            },
            {
              "id": "UNC-3.T.2",
              "summary": "If sampling without replacement and sample sizes are less than 10% of their populations, the standard deviation formula is approximately correct."
            },
            {
              "id": "UNC-3.U.1",
              "summary": "The sampling distribution of the difference in means is normal if both population distributions are normal."
            },
            {
              "id": "UNC-3.U.2",
              "summary": "If population distributions are not normal, the sampling distribution of the difference in means is approximately normal if both sample sizes are large enough (e.g., >= 30)."
            },
            {
              "id": "UNC-3.V.1",
              "summary": "Probabilities and parameters for a sampling distribution for a difference of sample means should be interpreted in context."
            }
          ]
        }
      ]
    },
    {
      "unit_number": 6,
      "unit_title": "Unit 6: Inference for Categorical Data: Proportions",
      "ced_class_periods": "~16-18 CLASS PERIODS",
      "exam_weight": "12-15%",
      "unit_overview": {
        "summary": "This is where it all comes together! In this unit, you will begin the formal process of statistical inference, using your knowledge of sampling distributions to draw conclusions about populations. We will focus entirely on categorical data, learning how to make inferences about population proportions. You'll learn the two primary methods of inference: confidence intervals, which are used to estimate a population parameter, and significance tests, which are used to assess the evidence for a claim about a parameter. You will learn the full, four-step process for both procedures, first for a single population proportion and then for the difference between two population proportions. You'll also learn about the types of errors you can make in a significance test. This unit is a major step in your statistical journey.",
        "ced_class_periods": "~16-18 Class Periods",
        "exam_weight": "12-15%",
        "prepgo_estimated_minutes": 255
      },
      "topics": [
        {
          "topic_number": "6.1",
          "topic_title": "Introducing Statistics: Why Be Normal?",
          "ced_topic_title": "Introducing Statistics: Why Be Normal?",
          "topic_overview": "This topic serves as an introduction to statistical inference, the art and science of drawing conclusions about a population from sample data. We will revisit the idea of sampling distributions and the central role that the Normal distribution plays. You'll understand why the properties of the sampling distribution—its center, spread, and shape—are so important. They allow us to quantify how much a sample statistic is likely to vary from the population parameter just by chance. This understanding is the logical foundation upon which all the confidence intervals and significance tests we will learn are built.",
          "prepgo_plan": {
            "total_estimated_minutes": 18,
            "learn_minutes": 5,
            "review_minutes": 5,
            "practice_minutes": 8,
            "target_study_guide_words": 750,
            "target_flashcards_count": 10,
            "target_mcq_count": 5
          },
          "learning_objectives": [
            {
              "id": "VAR-1.H",
              "summary": "Identify questions suggested by variation in the shapes of distributions of samples from the same population."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-1.H.1",
              "summary": "Variation in the shapes of data distributions may be random or not."
            }
          ]
        },
        {
          "topic_number": "6.2",
          "topic_title": "Constructing a Confidence Interval for a Population Proportion",
          "ced_topic_title": "Constructing a Confidence Interval for a Population Proportion",
          "topic_overview": "How can we estimate an unknown population proportion? This topic introduces the confidence interval. You will learn the full four-step process for constructing a confidence interval: State the parameter you want to estimate and the confidence level; Plan by identifying the appropriate inference method and checking conditions; Do the calculations to find the interval; and Conclude by interpreting the interval in context. We will focus on the one-sample z-interval for a population proportion. You'll learn the formula for the interval, which is based on the sample statistic and a margin of error that accounts for sampling variability.",
          "prepgo_plan": {
            "total_estimated_minutes": 26,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 12,
            "target_study_guide_words": 1100,
            "target_flashcards_count": 15,
            "target_mcq_count": 8
          },
          "learning_objectives": [
            {
              "id": "UNC-4.A",
              "summary": "Identify an appropriate confidence interval procedure for a population proportion."
            },
            {
              "id": "UNC-4.B",
              "summary": "Verify the conditions for calculating confidence intervals for a population proportion."
            },
            {
              "id": "UNC-4.C",
              "summary": "Determine the margin of error for a given sample size and an estimate for the sample size for a given margin of error."
            },
            {
              "id": "UNC-4.D",
              "summary": "Calculate an appropriate confidence interval for a population proportion."
            },
            {
              "id": "UNC-4.E",
              "summary": "Calculate an interval estimate based on a confidence interval for a population proportion."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-4.A.1",
              "summary": "The appropriate procedure for a one-sample proportion is a one-sample z-interval for a proportion."
            },
            {
              "id": "UNC-4.B.2",
              "summary": "To calculate a confidence interval for a population proportion, check for independence and approximate normality of the sampling distribution."
            },
            {
              "id": "UNC-4.C.1",
              "summary": "The standard error of a statistic is an estimate of its standard deviation."
            },
            {
              "id": "UNC-4.C.2",
              "summary": "A margin of error indicates how much a sample statistic is likely to vary from the population parameter."
            },
            {
              "id": "UNC-4.C.3",
              "summary": "For categorical variables, the margin of error is critical value (z*) times the standard error (SE)."
            },
            {
              "id": "UNC-4.C.4",
              "summary": "The margin of error formula can be solved for n to find the minimum sample size for a given margin of error."
            },
            {
              "id": "UNC-4.D.1",
              "summary": "An interval estimate is constructed as point estimate ± margin of error."
            },
            {
              "id": "UNC-4.D.2",
              "summary": "Critical values (z*) are the boundaries for the middle C% of the standard normal distribution."
            },
            {
              "id": "UNC-4.E.1",
              "summary": "Confidence intervals for population proportions can be used to calculate interval estimates with specified units."
            }
          ]
        },
        {
          "topic_number": "6.3",
          "topic_title": "Justifying a Claim Based on a Confidence Interval for a Population Proportion",
          "ced_topic_title": "Justifying a Claim Based on a Confidence Interval for a Population Proportion",
          "topic_overview": "Once we have an interval, what does it really mean? This topic focuses on the proper interpretation of a confidence interval and the confidence level. You'll learn to state your conclusion carefully, expressing your level of confidence that the interval captures the true population parameter. We will also explore how to use a confidence interval to evaluate a claim about a population proportion. If the claimed value falls outside our interval, we have evidence against the claim. You'll also learn how the margin of error is affected by the confidence level and the sample size.",
          "prepgo_plan": {
            "total_estimated_minutes": 22,
            "learn_minutes": 6,
            "review_minutes": 7,
            "practice_minutes": 9,
            "target_study_guide_words": 900,
            "target_flashcards_count": 14,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "UNC-4.F",
              "summary": "Interpret a confidence interval for a population proportion."
            },
            {
              "id": "UNC-4.G",
              "summary": "Justify a claim based on a confidence interval for a population proportion."
            },
            {
              "id": "UNC-4.H",
              "summary": "Identify relationships between sample size, confidence interval width, confidence level, and margin of error."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-4.F.1",
              "summary": "A confidence interval either contains the population proportion or it does not."
            },
            {
              "id": "UNC-4.F.2",
              "summary": "We are C% confident that the confidence interval captures the population proportion."
            },
            {
              "id": "UNC-4.F.3",
              "summary": "In repeated sampling, approximately C% of confidence intervals created will capture the population proportion."
            },
            {
              "id": "UNC-4.F.4",
              "summary": "Interpreting a confidence interval should include reference to the sample and the population it represents."
            },
            {
              "id": "UNC-4.G.1",
              "summary": "A confidence interval provides an interval of plausible values that may support a claim."
            },
            {
              "id": "UNC-4.H.1",
              "summary": "The width of a confidence interval tends to decrease as sample size increases."
            },
            {
              "id": "UNC-4.H.2",
              "summary": "For a given sample, the width of the confidence interval increases as the confidence level increases."
            },
            {
              "id": "UNC-4.H.3",
              "summary": "The width of a confidence interval is exactly twice the margin of error."
            }
          ]
        },
        {
          "topic_number": "6.4",
          "topic_title": "Setting Up a Test for a Population Proportion",
          "ced_topic_title": "Setting Up a Test for a Population Proportion",
          "topic_overview": "This topic introduces the second major type of inference: the significance test. A significance test assesses the evidence provided by data against a null hypothesis in favor of an alternative hypothesis. You will learn how to write the null and alternative hypotheses for a test about a population proportion. We will also cover how to identify the correct inference procedure (the one-sample z-test for a population proportion) and how to check the necessary conditions (Random, 10%, and Large Counts) to ensure the test is valid. Setting up the test correctly is a critical first step.",
          "prepgo_plan": {
            "total_estimated_minutes": 25,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 11,
            "target_study_guide_words": 1000,
            "target_flashcards_count": 15,
            "target_mcq_count": 7
          },
          "learning_objectives": [
            {
              "id": "VAR-6.D",
              "summary": "Identify the null and alternative hypotheses for a population proportion."
            },
            {
              "id": "VAR-6.E",
              "summary": "Identify an appropriate testing method for a population proportion."
            },
            {
              "id": "VAR-6.F",
              "summary": "Verify the conditions for making statistical inferences when testing a population proportion."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-6.D.1",
              "summary": "The null hypothesis is assumed to be correct unless evidence suggests otherwise; the alternative is what is being tested for."
            },
            {
              "id": "VAR-6.D.2",
              "summary": "The null hypothesis contains an equality (=, >=, <=), while the alternative contains a strict inequality (<, >, !=)."
            },
            {
              "id": "VAR-6.D.3",
              "summary": "The null hypothesis for a population proportion is H0: p = p0."
            },
            {
              "id": "VAR-6.D.4",
              "summary": "Alternative hypotheses for a proportion can be one-sided (p < p0 or p > p0) or two-sided (p != p0)."
            },
            {
              "id": "VAR-6.D.5",
              "summary": "For a one-sample z-test for a proportion, the null hypothesis specifies a value for the population proportion."
            },
            {
              "id": "VAR-6.E.1",
              "summary": "The appropriate test for a single categorical variable's population proportion is a one-sample z-test."
            },
            {
              "id": "VAR-6.F.1",
              "summary": "To test a population proportion, check for independence and that the sampling distribution is approximately normal, assuming H0 is true."
            }
          ]
        },
        {
          "topic_number": "6.5",
          "topic_title": "Interpreting p-Values",
          "ced_topic_title": "Interpreting p-Values",
          "topic_overview": "The core of a significance test is the p-value. This topic focuses on understanding and interpreting this crucial quantity. The p-value is the probability of getting a sample result as extreme or more extreme than the one we actually observed, assuming the null hypothesis is true. You will learn how to calculate the test statistic (a z-score for our sample proportion) and use it to find the p-value. A small p-value means our observed result is unlikely to happen by chance alone, providing evidence against the null hypothesis. A correct interpretation of the p-value is a key statistical skill.",
          "prepgo_plan": {
            "total_estimated_minutes": 25,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 11,
            "target_study_guide_words": 1050,
            "target_flashcards_count": 14,
            "target_mcq_count": 7
          },
          "learning_objectives": [
            {
              "id": "VAR-6.G",
              "summary": "Calculate an appropriate test statistic and p-value for a population proportion."
            },
            {
              "id": "DAT-3.A",
              "summary": "Interpret the p-value of a significance test for a population proportion."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-6.G.1",
              "summary": "The null distribution of the test statistic is a randomization or theoretical (e.g., z) distribution."
            },
            {
              "id": "VAR-6.G.2",
              "summary": "The standardized test statistic is (sample statistic - null value) / standard deviation of the statistic."
            },
            {
              "id": "VAR-6.G.3",
              "summary": "The test statistic for a population proportion is a specific z-statistic formula."
            },
            {
              "id": "VAR-6.G.4",
              "summary": "A p-value is the probability of obtaining a test statistic as or more extreme than the observed one, assuming the null hypothesis is true."
            },
            {
              "id": "DAT-3.A.1",
              "summary": "The p-value is the proportion of the null distribution that is as or more extreme than the observed test statistic."
            },
            {
              "id": "DAT-3.A.2",
              "summary": "Interpreting a p-value for a one-sample proportion test assumes the null hypothesis is true."
            }
          ]
        },
        {
          "topic_number": "6.6",
          "topic_title": "Concluding a Test for a Population Proportion",
          "ced_topic_title": "Concluding a Test for a Population Proportion",
          "topic_overview": "How do we use the p-value to make a conclusion? This topic covers the final step of a significance test. You will learn to compare the p-value to a pre-determined significance level (alpha). If the p-value is less than or equal to alpha, we reject the null hypothesis and conclude there is convincing evidence for the alternative hypothesis. If the p-value is greater than alpha, we fail to reject the null hypothesis. You will practice writing conclusions in the context of the problem, being careful to use the correct language and to base your conclusion on the statistical evidence.",
          "prepgo_plan": {
            "total_estimated_minutes": 22,
            "learn_minutes": 6,
            "review_minutes": 7,
            "practice_minutes": 9,
            "target_study_guide_words": 900,
            "target_flashcards_count": 14,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "DAT-3.B",
              "summary": "Justify a claim about the population based on the results of a significance test for a population proportion."
            }
          ],
          "essential_knowledge": [
            {
              "id": "DAT-3.B.1",
              "summary": "The significance level, alpha, is the predetermined probability of a Type I error."
            },
            {
              "id": "DAT-3.B.2",
              "summary": "A formal decision compares the p-value to alpha: if p-value <= alpha, reject H0; if p-value > alpha, fail to reject H0."
            },
            {
              "id": "DAT-3.B.3",
              "summary": "Rejecting H0 means there is sufficient evidence for Ha; failing to reject H0 means there is insufficient evidence for Ha."
            },
            {
              "id": "DAT-3.B.4",
              "summary": "The conclusion about the alternative hypothesis must be stated in context."
            },
            {
              "id": "DAT-3.B.5",
              "summary": "A significance test can never prove the null hypothesis is true."
            },
            {
              "id": "DAT-3.B.6",
              "summary": "Small p-values provide evidence for the alternative hypothesis."
            },
            {
              "id": "DAT-3.B.7",
              "summary": "Large p-values do not provide convincing evidence for the alternative, nor do they prove the null is true."
            },
            {
              "id": "DAT-3.B.9",
              "summary": "The results of a significance test provide statistical reasoning to support an answer to a research question."
            }
          ]
        },
        {
          "topic_number": "6.7",
          "topic_title": "Potential Errors When Performing Tests",
          "ced_topic_title": "Potential Errors When Performing Tests",
          "topic_overview": "Our conclusions in a significance test are not guaranteed to be correct. This topic introduces the two types of errors we can make. A Type I error occurs if we reject the null hypothesis when it is actually true. A Type II error occurs if we fail to reject the null hypothesis when it is actually false. You will learn to describe these errors in the context of a real-world problem and understand their potential consequences. We will also discuss the probability of a Type I error (which is the significance level, alpha) and the concept of the power of a test.",
          "prepgo_plan": {
            "total_estimated_minutes": 25,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 11,
            "target_study_guide_words": 1000,
            "target_flashcards_count": 15,
            "target_mcq_count": 7
          },
          "learning_objectives": [
            {
              "id": "UNC-5.A",
              "summary": "Identify Type I and Type II errors."
            },
            {
              "id": "UNC-5.B",
              "summary": "Calculate the probability of a Type I and Type II errors."
            },
            {
              "id": "UNC-5.C",
              "summary": "Identify factors that affect the probability of errors in significance testing."
            },
            {
              "id": "UNC-5.D",
              "summary": "Interpret Type I and Type II errors."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-5.A.1",
              "summary": "A Type I error occurs when a true null hypothesis is rejected (false positive)."
            },
            {
              "id": "UNC-5.A.2",
              "summary": "A Type II error occurs when a false null hypothesis is not rejected (false negative)."
            },
            {
              "id": "UNC-5.B.1",
              "summary": "The significance level, alpha, is the probability of making a Type I error if the null hypothesis is true."
            },
            {
              "id": "UNC-5.B.2",
              "summary": "The power of a test is the probability of correctly rejecting a false null hypothesis."
            },
            {
              "id": "UNC-5.B.3",
              "summary": "The probability of a Type II error is 1 - power."
            },
            {
              "id": "UNC-5.C.1",
              "summary": "The probability of a Type II error decreases as sample size, significance level, or effect size increases, or as standard error decreases."
            },
            {
              "id": "UNC-5.D.1",
              "summary": "The consequences of Type I and Type II errors depend on the situation."
            },
            {
              "id": "UNC-5.D.2",
              "summary": "The choice of significance level (alpha) is influenced by the consequences of a Type I error."
            }
          ]
        },
        {
          "topic_number": "6.8",
          "topic_title": "Confidence Intervals for the Difference of Two Proportions",
          "ced_topic_title": "Confidence Intervals for the Difference of Two Proportions",
          "topic_overview": "Now we extend our inference methods to comparing two populations. This topic teaches you how to construct and interpret a confidence interval for the difference between two population proportions (p1 - p2). You will learn the four-step process for a two-sample z-interval for a difference between proportions. This includes checking the conditions for two independent random samples and calculating the interval using the appropriate formula. This procedure is widely used to estimate the size of the difference between two groups, such as the difference in the effectiveness of two treatments.",
          "prepgo_plan": {
            "total_estimated_minutes": 25,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 11,
            "target_study_guide_words": 1050,
            "target_flashcards_count": 14,
            "target_mcq_count": 7
          },
          "learning_objectives": [
            {
              "id": "UNC-4.I",
              "summary": "Identify an appropriate confidence interval procedure for a comparison of population proportions."
            },
            {
              "id": "UNC-4.J",
              "summary": "Verify the conditions for calculating confidence intervals for a difference between population proportions."
            },
            {
              "id": "UNC-4.K",
              "summary": "Calculate an appropriate confidence interval for a comparison of population proportions."
            },
            {
              "id": "UNC-4.L",
              "summary": "Calculate an interval estimate based on a confidence interval for a difference of proportions."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-4.I.1",
              "summary": "The appropriate procedure for a two-sample comparison of proportions is a two-sample z-interval."
            },
            {
              "id": "UNC-4.J.1",
              "summary": "To calculate a confidence interval for a difference between proportions, check for independence and approximate normality."
            },
            {
              "id": "UNC-4.K.1",
              "summary": "The interval estimate for a comparison of proportions is (p1-hat - p2-hat) ± z* * SE."
            },
            {
              "id": "UNC-4.L.1",
              "summary": "Confidence intervals for a difference in proportions can be used to calculate interval estimates with specified units."
            }
          ]
        },
        {
          "topic_number": "6.9",
          "topic_title": "Justifying a Claim Based on a Confidence Interval for a Difference of Population Proportions",
          "ced_topic_title": "Justifying a Claim Based on a Confidence Interval for a Difference of Population Proportions",
          "topic_overview": "This topic focuses on interpreting the confidence interval for the difference between two proportions. The key is to look at whether the interval contains the value 0. If the interval is entirely positive or entirely negative, it suggests a real difference between the two population proportions. If the interval contains 0, then it is plausible that there is no difference between the proportions. You will practice writing clear, contextual interpretations of these intervals and using them to make decisions about claims comparing two groups.",
          "prepgo_plan": {
            "total_estimated_minutes": 20,
            "learn_minutes": 5,
            "review_minutes": 6,
            "practice_minutes": 9,
            "target_study_guide_words": 800,
            "target_flashcards_count": 12,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "UNC-4.M",
              "summary": "Interpret a confidence interval for a difference of proportions."
            },
            {
              "id": "UNC-4.N",
              "summary": "Justify a claim based on a confidence interval for a difference of proportions."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-4.M.1",
              "summary": "In repeated sampling, approximately C% of confidence intervals will capture the true difference in population proportions."
            },
            {
              "id": "UNC-4.M.2",
              "summary": "Interpreting a confidence interval for a difference in proportions should reference the samples and populations."
            },
            {
              "id": "UNC-4.N.1",
              "summary": "A confidence interval for a difference in proportions provides an interval of plausible values to support a claim."
            }
          ]
        },
        {
          "topic_number": "6.10",
          "topic_title": "Setting Up a Test for the Difference of Two Population Proportions",
          "ced_topic_title": "Setting Up a Test for the Difference of Two Population Proportions",
          "topic_overview": "This topic introduces the significance test for comparing two population proportions. You will learn how to write the null and alternative hypotheses for a two-sample z-test for a difference between proportions. The null hypothesis is typically that there is no difference (p1 - p2 = 0). You will also learn the conditions for this test, which are similar to those for the confidence interval but include a special way of calculating the standard error by 'pooling' or combining the two samples, based on the assumption that the null hypothesis is true.",
          "prepgo_plan": {
            "total_estimated_minutes": 22,
            "learn_minutes": 6,
            "review_minutes": 7,
            "practice_minutes": 9,
            "target_study_guide_words": 900,
            "target_flashcards_count": 14,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "VAR-1.H",
              "summary": "Identify questions suggested by variation in the shapes of distributions of samples from the same population."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-1.H.1",
              "summary": "Variation in the shapes of data distributions may be random or not."
            }
          ]
        },
        {
          "topic_number": "6.11",
          "topic_title": "Carrying Out a Test for the Difference of Two Population Proportions",
          "ced_topic_title": "Carrying Out a Test for the Difference of Two Population Proportions",
          "topic_overview": "This topic completes the four-step process for the two-sample z-test for a difference between proportions. You will learn how to calculate the pooled sample proportion, the test statistic, and the p-value. You will then practice making a conclusion by comparing the p-value to the significance level. The overall process is the same as for a one-sample test, but the formulas and conditions are specific to the two-sample case. Mastering this procedure will allow you to formally assess the evidence for a difference between two groups based on sample data.",
          "prepgo_plan": {
            "total_estimated_minutes": 25,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 11,
            "target_study_guide_words": 1000,
            "target_flashcards_count": 15,
            "target_mcq_count": 7
          },
          "learning_objectives": [
            {
              "id": "VAR-6.K",
              "summary": "Calculate an appropriate test statistic for the difference of two population proportions."
            },
            {
              "id": "DAT-3.C",
              "summary": "Interpret the p-value of a significance test for a difference of population proportions."
            },
            {
              "id": "DAT-3.D",
              "summary": "Justify a claim about the population based on the results of a significance test for a difference of population proportions."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-6.K.1",
              "summary": "The test statistic for a difference in proportions is a z-statistic calculated using the combined (pooled) proportion."
            },
            {
              "id": "DAT-3.C.1",
              "summary": "Interpreting the p-value for a difference of proportions test assumes the null hypothesis (that the proportions are equal) is true."
            },
            {
              "id": "DAT-3.D.1",
              "summary": "A formal decision compares the p-value to alpha to reject or fail to reject the null hypothesis."
            },
            {
              "id": "DAT-3.D.2",
              "summary": "The results of a significance test for a difference of proportions provide statistical reasoning for a research question."
            }
          ]
        }
      ]
    },
    {
      "unit_number": 7,
      "unit_title": "Unit 7: Inference for Quantitative Data: Means",
      "ced_class_periods": "~14-16 CLASS PERIODS",
      "exam_weight": "10-18%",
      "unit_overview": {
        "summary": "In this unit, we extend the principles of statistical inference to quantitative data, focusing on population means. You'll learn the procedures for constructing confidence intervals and performing significance tests for a single population mean and for the difference between two population means. A key new element in this unit is the t-distribution, which we use when the population standard deviation is unknown. You'll learn how t-distributions differ from the Normal distribution and how to use them to perform inference. We'll also cover inference for matched pairs data, which is a special type of one-sample procedure. By the end of this unit, you'll have a complete set of tools for inference on the most common parameters: proportions and means.",
        "ced_class_periods": "~14-16 Class Periods",
        "exam_weight": "10-18%",
        "prepgo_estimated_minutes": 234
      },
      "topics": [
        {
          "topic_number": "7.1",
          "topic_title": "Introducing Statistics: Should I Worry About Error?",
          "ced_topic_title": "Introducing Statistics: Should I Worry About Error?",
          "topic_overview": "This topic introduces inference for means by revisiting the core ideas of sampling variability and error. Just as sample proportions vary, sample means will also vary from sample to sample. Statistical inference provides a way to account for this random variation and make decisions in the face of uncertainty. We will explore how the principles of confidence intervals and significance tests that you learned for proportions can be adapted to work with quantitative data and population means. This topic sets the conceptual stage for the specific formulas and conditions you will learn in this unit.",
          "prepgo_plan": {
            "total_estimated_minutes": 18,
            "learn_minutes": 5,
            "review_minutes": 5,
            "practice_minutes": 8,
            "target_study_guide_words": 750,
            "target_flashcards_count": 10,
            "target_mcq_count": 5
          },
          "learning_objectives": [
            {
              "id": "VAR-1.I",
              "summary": "Identify questions suggested by probabilities of errors in statistical inference."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-1.I.1",
              "summary": "Random variation may result in errors in statistical inference."
            }
          ]
        },
        {
          "topic_number": "7.2",
          "topic_title": "Constructing a Confidence Interval for a Population Mean",
          "ced_topic_title": "Constructing a Confidence Interval for a Population Mean",
          "topic_overview": "How do we estimate an unknown population mean? This topic introduces the one-sample t-interval for a population mean. You will learn why we use a t-distribution instead of a Normal distribution when we have to estimate the population standard deviation from the sample data. We will cover the properties of the t-distribution, including its dependence on degrees of freedom. You will then learn the full four-step process for constructing and interpreting a confidence interval for a mean, including how to check the necessary conditions for inference on quantitative data.",
          "prepgo_plan": {
            "total_estimated_minutes": 26,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 12,
            "target_study_guide_words": 1100,
            "target_flashcards_count": 15,
            "target_mcq_count": 8
          },
          "learning_objectives": [
            {
              "id": "VAR-7.A",
              "summary": "Describe t-distributions."
            },
            {
              "id": "UNC-4.O",
              "summary": "Identify an appropriate confidence interval procedure for a population mean, including for matched pairs."
            },
            {
              "id": "UNC-4.P",
              "summary": "Verify the conditions for calculating confidence intervals for a population mean, including for matched pairs."
            },
            {
              "id": "UNC-4.Q",
              "summary": "Determine the margin of error for a given sample size for a one-sample t-interval."
            },
            {
              "id": "UNC-4.R",
              "summary": "Calculate an appropriate confidence interval for a population mean, including for matched pairs."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-7.A.1",
              "summary": "When s is used instead of sigma, the resulting t-distribution has more area in the tails than a normal distribution."
            },
            {
              "id": "VAR-7.A.2",
              "summary": "As degrees of freedom increase, the tails of a t-distribution get smaller, approaching a normal distribution."
            },
            {
              "id": "UNC-4.O.1",
              "summary": "When sigma is unknown, the appropriate procedure is a one-sample t-interval for a mean."
            },
            {
              "id": "UNC-4.O.2",
              "summary": "For a normally distributed variable, the statistic (x-bar - mu)/(s/sqrt(n)) follows a t-distribution with n-1 degrees of freedom."
            },
            {
              "id": "UNC-4.O.3",
              "summary": "Matched pairs data can be analyzed as a single sample of differences."
            },
            {
              "id": "UNC-4.P.1",
              "summary": "To estimate a population mean, check for independence and that the sampling distribution is approximately normal."
            },
            {
              "id": "UNC-4.Q.1",
              "summary": "The critical value t* can be found using a table or technology."
            },
            {
              "id": "UNC-4.Q.2",
              "summary": "The standard error for a sample mean is s/sqrt(n)."
            },
            {
              "id": "UNC-4.Q.3",
              "summary": "The margin of error for a one-sample t-interval is t* times the standard error."
            },
            {
              "id": "UNC-4.R.1",
              "summary": "The point estimate for a population mean is the sample mean, x-bar."
            },
            {
              "id": "UNC-4.R.2",
              "summary": "The confidence interval for a population mean is x-bar ± t*(s/sqrt(n))."
            }
          ]
        },
        {
          "topic_number": "7.3",
          "topic_title": "Justifying a Claim About a Population Mean Based on a Confidence Interval",
          "ced_topic_title": "Justifying a Claim About a Population Mean Based on a Confidence Interval",
          "topic_overview": "This topic focuses on the interpretation of the one-sample t-interval. As with proportions, you will practice interpreting the confidence interval and the confidence level in context. You will also learn how to use the interval to make a decision about a claim. If a hypothesized value for the population mean falls outside the confidence interval, we have evidence that the hypothesized value is incorrect. This provides a link between the two main methods of inference and gives you another tool for assessing claims.",
          "prepgo_plan": {
            "total_estimated_minutes": 22,
            "learn_minutes": 6,
            "review_minutes": 7,
            "practice_minutes": 9,
            "target_study_guide_words": 900,
            "target_flashcards_count": 14,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "UNC-4.S",
              "summary": "Interpret a confidence interval for a population mean, including for matched pairs."
            },
            {
              "id": "UNC-4.T",
              "summary": "Justify a claim based on a confidence interval for a population mean, including for matched pairs."
            },
            {
              "id": "UNC-4.U",
              "summary": "Identify the relationships between sample size, confidence interval width, confidence level, and margin of error for a population mean."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-4.S.1",
              "summary": "A confidence interval for a population mean either contains the mean or it does not."
            },
            {
              "id": "UNC-4.S.2",
              "summary": "We are C% confident that the interval captures the true population mean."
            },
            {
              "id": "UNC-4.S.3",
              "summary": "An interpretation of a confidence interval for a mean should reference the sample and the population."
            },
            {
              "id": "UNC-4.T.1",
              "summary": "A confidence interval for a population mean provides plausible values that can support a claim."
            },
            {
              "id": "UNC-4.U.1",
              "summary": "The width of a confidence interval for a mean tends to decrease as sample size increases."
            },
            {
              "id": "UNC-4.U.2",
              "summary": "The width of the interval for a single mean is proportional to 1/sqrt(n)."
            },
            {
              "id": "UNC-4.U.3",
              "summary": "For a given sample, the width of the confidence interval for a mean increases as the confidence level increases."
            }
          ]
        },
        {
          "topic_number": "7.4",
          "topic_title": "Setting Up a Test for a Population Mean",
          "ced_topic_title": "Setting Up a Test for a Population Mean",
          "topic_overview": "This topic introduces the significance test for a population mean, the one-sample t-test. You will learn how to write the null and alternative hypotheses for a test about a population mean (μ). We will cover the conditions for this test, which are essentially the same as for the confidence interval: the data must come from a random sample, the 10% condition should be checked if sampling without replacement, and the population must be Normal or the sample size must be large (Central Limit Theorem). A key skill is checking the 'Normal/Large Sample' condition by examining the sample data.",
          "prepgo_plan": {
            "total_estimated_minutes": 25,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 11,
            "target_study_guide_words": 1000,
            "target_flashcards_count": 15,
            "target_mcq_count": 7
          },
          "learning_objectives": [
            {
              "id": "VAR-7.B",
              "summary": "Identify an appropriate testing method for a population mean with unknown sigma, including for matched pairs."
            },
            {
              "id": "VAR-7.C",
              "summary": "Identify the null and alternative hypotheses for a population mean with unknown sigma, including for matched pairs."
            },
            {
              "id": "VAR-7.D",
              "summary": "Verify the conditions for the test for a population mean, including for matched pairs."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-7.B.1",
              "summary": "The appropriate test for a population mean with unknown sigma is a one-sample t-test."
            },
            {
              "id": "VAR-7.B.2",
              "summary": "Matched pairs data can be analyzed with a one-sample t-test on the differences."
            },
            {
              "id": "VAR-7.C.1",
              "summary": "The null hypothesis for a one-sample t-test is H0: mu = mu0."
            },
            {
              "id": "VAR-7.C.2",
              "summary": "When using matched pairs, it is important to define the order of subtraction for the mean difference."
            },
            {
              "id": "VAR-7.D.1",
              "summary": "To test a population mean, check for independence and that the sampling distribution is approximately normal."
            }
          ]
        },
        {
          "topic_number": "7.5",
          "topic_title": "Carrying Out a Test for a Population Mean",
          "ced_topic_title": "Carrying Out a Test for a Population Mean",
          "topic_overview": "This topic covers the 'Do' and 'Conclude' steps of the one-sample t-test. You will learn to calculate the t-test statistic and to find the p-value using the t-distribution with the appropriate degrees of freedom. You will then make a conclusion by comparing the p-value to the significance level. The overall logic is identical to the z-test for a proportion, but the mechanics involve the t-distribution. This topic also includes inference for the mean of differences from matched pairs data, which cleverly reduces a two-sample problem to a one-sample t-test.",
          "prepgo_plan": {
            "total_estimated_minutes": 26,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 12,
            "target_study_guide_words": 1100,
            "target_flashcards_count": 15,
            "target_mcq_count": 8
          },
          "learning_objectives": [
            {
              "id": "VAR-7.E",
              "summary": "Calculate an appropriate test statistic for a population mean, including for matched pairs."
            },
            {
              "id": "DAT-3.E",
              "summary": "Interpret the p-value of a significance test for a population mean, including for matched pairs."
            },
            {
              "id": "DAT-3.F",
              "summary": "Justify a claim about the population based on the results of a significance test for a population mean."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-7.E.1",
              "summary": "The sampling distribution of the t-statistic for a mean has a t-distribution with n-1 degrees of freedom."
            },
            {
              "id": "DAT-3.E.1",
              "summary": "Interpreting the p-value for a test for a population mean assumes the null hypothesis is true."
            },
            {
              "id": "DAT-3.F.1",
              "summary": "A formal decision compares the p-value to alpha to reject or fail to reject the null hypothesis."
            },
            {
              "id": "DAT-3.F.2",
              "summary": "The results of a significance test for a mean provide statistical reasoning for a research question."
            }
          ]
        },
        {
          "topic_number": "7.6",
          "topic_title": "Confidence Intervals for the Difference of Two Means",
          "ced_topic_title": "Confidence Intervals for the Difference of Two Means",
          "topic_overview": "Now we turn to comparing the means of two independent groups. This topic introduces the two-sample t-interval for the difference between two population means (μ1 - μ2). You will learn the four-step process for this procedure, including the conditions for two independent random samples. The formula for the interval and the calculation of the degrees of freedom for the t-distribution are more complex here, and we will often rely on technology. The goal is to estimate the true difference between the means of the two populations.",
          "prepgo_plan": {
            "total_estimated_minutes": 26,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 12,
            "target_study_guide_words": 1100,
            "target_flashcards_count": 15,
            "target_mcq_count": 8
          },
          "learning_objectives": [
            {
              "id": "UNC-4.V",
              "summary": "Identify an appropriate confidence interval procedure for a difference of two population means."
            },
            {
              "id": "UNC-4.W",
              "summary": "Verify the conditions to calculate confidence intervals for the difference of two population means."
            },
            {
              "id": "UNC-4.X",
              "summary": "Determine the margin of error for the difference of two population means."
            },
            {
              "id": "UNC-4.Y",
              "summary": "Calculate an appropriate confidence interval for a difference of two population means."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-4.V.2",
              "summary": "The appropriate procedure for two independent samples is a two-sample t-interval for a difference between means."
            },
            {
              "id": "UNC-4.W.1",
              "summary": "To estimate a difference of means, check for independence of groups and that the sampling distribution is approximately normal."
            },
            {
              "id": "UNC-4.X.1",
              "summary": "The margin of error for the difference of two means is t* times the standard error of the difference."
            },
            {
              "id": "UNC-4.X.2",
              "summary": "The standard error for the difference in two sample means has a specific formula involving the sample standard deviations."
            },
            {
              "id": "UNC-4.Y.1",
              "summary": "The point estimate for the difference of two population means is x1-bar - x2-bar."
            },
            {
              "id": "UNC-4.Y.2",
              "summary": "The confidence interval for a difference of means is (x1-bar - x2-bar) ± t* * SE, with degrees of freedom found using technology."
            }
          ]
        },
        {
          "topic_number": "7.7",
          "topic_title": "Justifying a Claim About the Difference of Two Means Based on a Confidence Interval",
          "ced_topic_title": "Justifying a Claim About the Difference of Two Means Based on a Confidence Interval",
          "topic_overview": "This topic focuses on interpreting the two-sample t-interval. As with proportions, the key is to determine if the interval contains 0. If the interval is entirely positive or entirely negative, it provides evidence of a difference between the two population means. If the interval contains 0, then it is plausible that the means are the same. You will practice writing clear, contextual conclusions based on the interval. This method is a very common way to compare two groups in scientific research.",
          "prepgo_plan": {
            "total_estimated_minutes": 22,
            "learn_minutes": 6,
            "review_minutes": 7,
            "practice_minutes": 9,
            "target_study_guide_words": 900,
            "target_flashcards_count": 14,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "UNC-4.Z",
              "summary": "Interpret a confidence interval for a difference of population means."
            },
            {
              "id": "UNC-4.AA",
              "summary": "Justify a claim based on a confidence interval for a difference of population means."
            },
            {
              "id": "UNC-4.AB",
              "summary": "Identify the effects of sample size on the width of a confidence interval for the difference of two means."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-4.Z.1",
              "summary": "In repeated sampling, approximately C% of confidence intervals will capture the true difference of population means."
            },
            {
              "id": "UNC-4.Z.2",
              "summary": "An interpretation for a confidence interval for the difference of two means should reference the samples and populations."
            },
            {
              "id": "UNC-4.AA.1",
              "summary": "A confidence interval for a difference of means provides plausible values that can support a claim."
            },
            {
              "id": "UNC-4.AB.1",
              "summary": "The width of the confidence interval for the difference of two means tends to decrease as sample sizes increase."
            }
          ]
        },
        {
          "topic_number": "7.8",
          "topic_title": "Setting Up a Test for the Difference of Two Population Means",
          "ced_topic_title": "Setting Up a Test for the Difference of Two Population Means",
          "topic_overview": "This topic introduces the two-sample t-test for the difference between two population means. You will learn to write the null and alternative hypotheses, where the null hypothesis is typically that there is no difference between the means (μ1 - μ2 = 0). We will review the conditions for this test, which are the same as for the two-sample t-interval. This procedure allows us to formally test a claim about the difference between two groups, such as whether a new drug is more effective than a placebo at reducing blood pressure.",
          "prepgo_plan": {
            "total_estimated_minutes": 25,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 11,
            "target_study_guide_words": 1050,
            "target_flashcards_count": 14,
            "target_mcq_count": 7
          },
          "learning_objectives": [
            {
              "id": "VAR-7.F",
              "summary": "Identify an appropriate selection of a testing method for a difference of two population means."
            },
            {
              "id": "VAR-7.G",
              "summary": "Identify the null and alternative hypotheses for a difference of two population means."
            },
            {
              "id": "VAR-7.H",
              "summary": "Verify the conditions for the significance test for the difference of two population means."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-7.F.1",
              "summary": "The appropriate test for a difference of two population means is a two-sample t-test."
            },
            {
              "id": "VAR-7.G.1",
              "summary": "The null hypothesis for a two-sample t-test for a difference of means is H0: mu1 - mu2 = 0, or H0: mu1 = mu2."
            },
            {
              "id": "VAR-7.H.1",
              "summary": "To test a difference between means, check for independence and that the sampling distribution is approximately normal."
            }
          ]
        },
        {
          "topic_number": "7.9",
          "topic_title": "Carrying Out a Test for the Difference of Two Population Means",
          "ced_topic_title": "Carrying Out a Test for the Difference of Two Population Means",
          "topic_overview": "This topic completes the four-step process for the two-sample t-test. You will learn to calculate the test statistic and use technology to find the p-value from the appropriate t-distribution. You will then practice making a conclusion by comparing the p-value to the significance level. By the end of this topic, you will be proficient in carrying out a full significance test to compare the means of two independent groups, a very common and important statistical procedure.",
          "prepgo_plan": {
            "total_estimated_minutes": 25,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 11,
            "target_study_guide_words": 1050,
            "target_flashcards_count": 14,
            "target_mcq_count": 7
          },
          "learning_objectives": [
            {
              "id": "VAR-7.I",
              "summary": "Calculate an appropriate test statistic for a difference of two means."
            },
            {
              "id": "DAT-3.G",
              "summary": "Interpret the p-value of a significance test for a difference of population means."
            },
            {
              "id": "DAT-3.H",
              "summary": "Justify a claim about the population based on the results of a significance test for a difference of two population means in context."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-7.I.1",
              "summary": "The sampling distribution of the t-statistic for a difference of two means is an approximate t-distribution, with degrees of freedom found by technology."
            },
            {
              "id": "DAT-3.G.1",
              "summary": "Interpreting the p-value for a test for a difference of means assumes the null hypothesis is true."
            },
            {
              "id": "DAT-3.H.1",
              "summary": "A formal decision compares the p-value to alpha to reject or fail to reject the null hypothesis."
            },
            {
              "id": "DAT-3.H.2",
              "summary": "The results of a significance test for a difference of means provide statistical reasoning for a research question."
            }
          ]
        },
        {
          "topic_number": "7.10",
          "topic_title": "Skills Focus: Selecting, Implementing, and Communicating Inference Procedures",
          "ced_topic_title": "Skills Focus: Selecting, Implementing, and Communicating Inference Procedures",
          "topic_overview": "This topic is a capstone for inference on means and proportions. You have now learned a variety of inference procedures. The goal here is to practice selecting the *correct* procedure for a given problem. You will learn to ask the key questions: Is this a problem about means or proportions? Is it one sample, two samples, or matched pairs? Are we estimating with a confidence interval or testing a claim with a significance test? This topic provides crucial practice in integrating your knowledge and making the right choices, which is a key skill for success in AP Statistics.",
          "prepgo_plan": {
            "total_estimated_minutes": 19,
            "learn_minutes": 5,
            "review_minutes": 5,
            "practice_minutes": 9,
            "target_study_guide_words": 750,
            "target_flashcards_count": 11,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "VAR-1.I",
              "summary": "Identify questions suggested by probabilities of errors in statistical inference."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-1.I.1",
              "summary": "Random variation may result in errors in statistical inference."
            }
          ]
        }
      ]
    },
    {
      "unit_number": 8,
      "unit_title": "Unit 8: Inference for Categorical Data: Chi-Square",
      "ced_class_periods": "~10-11 CLASS PERIODS",
      "exam_weight": "2-5%",
      "unit_overview": {
        "summary": "This unit expands your inference toolkit for categorical data. While previous units focused on proportions with only two categories (success/failure), the chi-square procedures you'll learn here allow you to analyze categorical variables with multiple categories. You will learn three different chi-square tests. The first is the chi-square test for goodness-of-fit, which tests whether the distribution of a single categorical variable matches a hypothesized distribution. The other two tests, the chi-square test for homogeneity and the chi-square test for independence, are used to analyze the relationship between two categorical variables. This unit will empower you to tackle a much wider range of questions involving categorical data.",
        "ced_class_periods": "~10-11 Class Periods",
        "exam_weight": "2-5%",
        "prepgo_estimated_minutes": 154
      },
      "topics": [
        {
          "topic_number": "8.1",
          "topic_title": "Introducing Statistics: Are My Results Unexpected?",
          "ced_topic_title": "Introducing Statistics: Are My Results Unexpected?",
          "topic_overview": "This topic introduces the main idea behind the chi-square tests. We will explore situations where we want to compare observed counts from a sample to the counts we would expect to see if a certain theory or hypothesis were true. The core question is whether the differences between the observed and expected counts are large enough to be considered statistically significant, or if they could have happened just by chance. This sets the stage for the chi-square statistic, which is a measure of how far the observed counts are from the expected counts.",
          "prepgo_plan": {
            "total_estimated_minutes": 18,
            "learn_minutes": 5,
            "review_minutes": 5,
            "practice_minutes": 8,
            "target_study_guide_words": 750,
            "target_flashcards_count": 10,
            "target_mcq_count": 5
          },
          "learning_objectives": [
            {
              "id": "VAR-1.J",
              "summary": "Identify questions suggested by variation between observed and expected counts in categorical data."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-1.J.1",
              "summary": "Variation between observed and expected counts may be random or not."
            }
          ]
        },
        {
          "topic_number": "8.2",
          "topic_title": "Setting Up a Chi-Square Goodness of Fit Test",
          "ced_topic_title": "Setting Up a Chi-Square Goodness of Fit Test",
          "topic_overview": "This topic introduces the first of our three chi-square tests: the goodness-of-fit test. This test is used to determine if a hypothesized distribution for a single categorical variable is plausible. You will learn how to write the null and alternative hypotheses for this test. The null hypothesis states the specific proportions for each category, while the alternative is that at least one of the proportions is different. We will also cover the conditions for this test, which include random sampling and a new 'Large Counts' condition that requires all expected counts to be sufficiently large.",
          "prepgo_plan": {
            "total_estimated_minutes": 22,
            "learn_minutes": 6,
            "review_minutes": 7,
            "practice_minutes": 9,
            "target_study_guide_words": 900,
            "target_flashcards_count": 14,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "VAR-8.A",
              "summary": "Describe chi-square distributions."
            },
            {
              "id": "VAR-8.B",
              "summary": "Identify the null and alternative hypotheses in a test for a distribution of proportions."
            },
            {
              "id": "VAR-8.C",
              "summary": "Identify an appropriate testing method for a distribution of proportions in categorical data."
            },
            {
              "id": "VAR-8.D",
              "summary": "Calculate expected counts for the chi-square test for goodness of fit."
            },
            {
              "id": "VAR-8.E",
              "summary": "Verify the conditions for making statistical inferences for a chi-square goodness-of-fit test."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-8.A.1",
              "summary": "Expected counts are counts consistent with the null hypothesis, calculated as sample size times a probability."
            },
            {
              "id": "VAR-8.A.2",
              "summary": "The chi-square statistic measures the distance between observed and expected counts relative to expected counts."
            },
            {
              "id": "VAR-8.A.3",
              "summary": "Chi-square distributions are positive and skewed right; skew lessens as degrees of freedom increase."
            },
            {
              "id": "VAR-8.B.1",
              "summary": "For a goodness-of-fit test, H0 specifies proportions for each category, and Ha states at least one proportion is different."
            },
            {
              "id": "VAR-8.C.1",
              "summary": "For one categorical variable's distribution of proportions, the appropriate test is the chi-square test for goodness of fit."
            },
            {
              "id": "VAR-8.D.1",
              "summary": "Expected counts for a goodness-of-fit test are (sample size) * (null proportion)."
            },
            {
              "id": "VAR-8.E.1",
              "summary": "For a chi-square goodness-of-fit test, check for independence and large counts (all expected counts >= 5)."
            }
          ]
        },
        {
          "topic_number": "8.3",
          "topic_title": "Carrying Out a Chi-Square Test for Goodness of Fit",
          "ced_topic_title": "Carrying Out a Chi-Square Test for Goodness of Fit",
          "topic_overview": "This topic covers the 'Do' and 'Conclude' steps of the goodness-of-fit test. You will learn to calculate the expected counts for each category and then compute the chi-square test statistic. We'll explore the chi-square distribution, which is a new family of skewed distributions whose shape depends on the degrees of freedom. You will learn to use this distribution to find the p-value and then make a conclusion by comparing the p-value to a significance level. This procedure is useful for questions like, 'Does the distribution of colors of M&Ms match the company's claim?'",
          "prepgo_plan": {
            "total_estimated_minutes": 26,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 12,
            "target_study_guide_words": 1100,
            "target_flashcards_count": 15,
            "target_mcq_count": 8
          },
          "learning_objectives": [
            {
              "id": "VAR-8.F",
              "summary": "Calculate the appropriate statistic for the chi-square test for goodness of fit."
            },
            {
              "id": "VAR-8.G",
              "summary": "Determine the p-value for a chi-square test for goodness of fit."
            },
            {
              "id": "DAT-3.I",
              "summary": "Interpret the p-value for the chi-square test for goodness of fit."
            },
            {
              "id": "DAT-3.J",
              "summary": "Justify a claim about the population based on the results of a chi-square test for goodness of fit."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-8.F.1",
              "summary": "The chi-square test statistic is the sum of (Observed - Expected)^2 / Expected, with df = number of categories - 1."
            },
            {
              "id": "VAR-8.F.2",
              "summary": "The null distribution for the chi-square statistic can be a randomization or theoretical chi-square distribution."
            },
            {
              "id": "VAR-8.G.1",
              "summary": "The p-value for a chi-square test is found using a table or technology."
            },
            {
              "id": "DAT-3.I.1",
              "summary": "The p-value is the probability of obtaining a test statistic as or more extreme than the observed value, assuming H0 is true."
            },
            {
              "id": "DAT-3.J.1",
              "summary": "The decision to reject or fail to reject H0 is based on comparing the p-value to alpha."
            },
            {
              "id": "DAT-3.J.2",
              "summary": "The results of a chi-square test for goodness of fit provide statistical reasoning for a research question."
            }
          ]
        },
        {
          "topic_number": "8.4",
          "topic_title": "Expected Counts in Two-Way Tables",
          "ced_topic_title": "Expected Counts in Two-Way Tables",
          "topic_overview": "Before we can perform chi-square tests on two-way tables, we need to know how to calculate the expected counts. This topic provides the necessary foundation. You will learn the formula for finding the expected count for any cell in a two-way table, which is based on the row and column totals. The logic is based on what we would expect to see if there were no association between the two variables. Mastering this calculation is a prerequisite for performing the next two types of chi-square tests.",
          "prepgo_plan": {
            "total_estimated_minutes": 19,
            "learn_minutes": 5,
            "review_minutes": 5,
            "practice_minutes": 9,
            "target_study_guide_words": 750,
            "target_flashcards_count": 11,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "VAR-8.H",
              "summary": "Calculate expected counts for two-way tables of categorical data."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-8.H.1",
              "summary": "The expected count in a cell of a two-way table is (row total * column total) / table total."
            }
          ]
        },
        {
          "topic_number": "8.5",
          "topic_title": "Setting Up a Chi-Square Test for Homogeneity or Independence",
          "ced_topic_title": "Setting Up a Chi-Square Test for Homogeneity or Independence",
          "topic_overview": "This topic introduces the two chi-square tests that use two-way tables: the test for homogeneity and the test for independence. Though the calculations are identical, their purpose and the way the data are collected are different. The test for homogeneity compares the distribution of a categorical variable across two or more different populations or treatment groups. The test for independence assesses whether there is an association between two categorical variables within a single population. You will learn how to write the hypotheses and check the conditions for both of these important tests.",
          "prepgo_plan": {
            "total_estimated_minutes": 25,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 11,
            "target_study_guide_words": 1050,
            "target_flashcards_count": 14,
            "target_mcq_count": 7
          },
          "learning_objectives": [
            {
              "id": "VAR-8.I",
              "summary": "Identify the null and alternative hypotheses for a chi-square test for homogeneity or independence."
            },
            {
              "id": "VAR-8.J",
              "summary": "Identify an appropriate testing method for comparing distributions in two-way tables of categorical data."
            },
            {
              "id": "VAR-8.K",
              "summary": "Verify the conditions for making statistical inferences for a chi-square test for independence or homogeneity."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-8.I.1",
              "summary": "For a chi-square test for homogeneity, H0 states there is no difference in distributions across populations/treatments."
            },
            {
              "id": "VAR-8.I.2",
              "summary": "For a chi-square test for independence, H0 states there is no association between two categorical variables."
            },
            {
              "id": "VAR-8.J.1",
              "summary": "The chi-square test for homogeneity compares distributions of a categorical variable from different populations."
            },
            {
              "id": "VAR-8.J.2",
              "summary": "The chi-square test for independence assesses whether two categorical variables are associated in a population."
            },
            {
              "id": "VAR-8.K.1",
              "summary": "For chi-square tests on two-way tables, check for independence and large counts (all expected counts >= 5)."
            }
          ]
        },
        {
          "topic_number": "8.6",
          "topic_title": "Carrying Out a Chi-Square Test for Homogeneity or Independence",
          "ced_topic_title": "Carrying Out a Chi-Square Test for Homogeneity or Independence",
          "topic_overview": "This topic completes the four-step process for the chi-square tests for homogeneity and independence. You will learn to calculate the chi-square statistic and the degrees of freedom for a two-way table. You will then use the chi-square distribution to find the p-value and make a conclusion. A significant result in a test for homogeneity means the distributions are different, while a significant result in a test for independence means there is an association between the variables. We'll also explore follow-up analysis to see which components contribute most to the chi-square statistic.",
          "prepgo_plan": {
            "total_estimated_minutes": 25,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 11,
            "target_study_guide_words": 1050,
            "target_flashcards_count": 14,
            "target_mcq_count": 7
          },
          "learning_objectives": [
            {
              "id": "VAR-8.L",
              "summary": "Calculate the appropriate statistic for a chi-square test for homogeneity or independence."
            },
            {
              "id": "VAR-8.M",
              "summary": "Determine the p-value for a chi-square test for independence or homogeneity."
            },
            {
              "id": "DAT-3.K",
              "summary": "Interpret the p-value for the chi-square test for homogeneity or independence."
            },
            {
              "id": "DAT-3.L",
              "summary": "Justify a claim about the population based on the results of a chi-square test for homogeneity or independence."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-8.L.1",
              "summary": "The chi-square test statistic is the sum of (Observed - Expected)^2 / Expected, with df = (rows - 1)(cols - 1)."
            },
            {
              "id": "VAR-8.M.1",
              "summary": "The p-value for a chi-square test for independence or homogeneity is found using a table or technology."
            },
            {
              "id": "VAR-8.M.2",
              "summary": "For a two-way table test, the p-value is the proportion of the chi-square distribution equal to or larger than the test statistic."
            },
            {
              "id": "DAT-3.K.1",
              "summary": "The p-value is the probability of obtaining a test statistic as or more extreme than the observed value, assuming H0 is true."
            },
            {
              "id": "DAT-3.L.1",
              "summary": "A decision to reject or fail to reject H0 is based on comparing the p-value to alpha."
            }
          ]
        },
        {
          "topic_number": "8.7",
          "topic_title": "Skills Focus: Selecting an Appropriate Inference Procedure for Categorical Data",
          "ced_topic_title": "Skills Focus: Selecting an Appropriate Inference Procedure for Categorical Data",
          "topic_overview": "This topic provides a crucial opportunity to synthesize your knowledge of inference for categorical data. You've learned about z-tests for one and two proportions, and now three different chi-square tests. The key skill here is to be able to read a problem and determine which of these five procedures is the correct one to use. We will practice distinguishing between these different scenarios. This skill of selecting the right tool for the job is one of the most important you will develop in this course.",
          "prepgo_plan": {
            "total_estimated_minutes": 19,
            "learn_minutes": 5,
            "review_minutes": 5,
            "practice_minutes": 9,
            "target_study_guide_words": 750,
            "target_flashcards_count": 11,
            "target_mcq_count": 6
          },
          "learning_objectives": [],
          "essential_knowledge": []
        }
      ]
    },
    {
      "unit_number": 9,
      "unit_title": "Unit 9: Inference for Quantitative Data: Slopes",
      "ced_class_periods": "~7-8 CLASS PERIODS",
      "exam_weight": "2-5%",
      "unit_overview": {
        "summary": "In our final unit, we return to the topic of linear regression and add the power of statistical inference. You've learned to describe the relationship between two quantitative variables and fit a regression line to sample data. Now, you will learn how to make inferences about the true relationship in the population. This unit focuses on inference for the slope of a population regression line. You will learn to construct a confidence interval for the true slope and to perform a significance test to determine if there is a genuine linear relationship between the variables. This unit completes your comprehensive introduction to the fundamental concepts and methods of AP Statistics, preparing you for the exam and for future studies in any data-driven field.",
        "ced_class_periods": "~7-8 Class Periods",
        "exam_weight": "2-5%",
        "prepgo_estimated_minutes": 126
      },
      "topics": [
        {
          "topic_number": "9.1",
          "topic_title": "Introducing Statistics: Do Those Points Align?",
          "ced_topic_title": "Introducing Statistics: Do Those Points Align?",
          "topic_overview": "This topic introduces the concept of inference for regression. When we see a linear pattern in a scatterplot of sample data, how do we know if this reflects a true linear relationship in the population, or if it could have just happened by chance? You will learn to think of the observed slope of the sample regression line as just one possible slope from a sampling distribution of all possible slopes. This sets the stage for using confidence intervals and significance tests to make conclusions about the true population slope.",
          "prepgo_plan": {
            "total_estimated_minutes": 18,
            "learn_minutes": 5,
            "review_minutes": 5,
            "practice_minutes": 8,
            "target_study_guide_words": 750,
            "target_flashcards_count": 10,
            "target_mcq_count": 5
          },
          "learning_objectives": [
            {
              "id": "VAR-1.K",
              "summary": "Identify questions suggested by variation in scatter plots."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-1.K.1",
              "summary": "Variation in points' positions relative to a theoretical line may be random or non-random."
            }
          ]
        },
        {
          "topic_number": "9.2",
          "topic_title": "Confidence Intervals for the Slope of a Regression Model",
          "ced_topic_title": "Confidence Intervals for the Slope of a Regression Model",
          "topic_overview": "How can we estimate the true slope of the population regression line? This topic introduces the t-interval for the slope. You will learn the four-step process for constructing this interval. A key part of this is understanding the conditions for inference for regression, which include checking for a linear relationship, independent observations, Normal residuals, and equal variance of residuals. We will often use computer output to find the necessary values, so a key skill will be to read and interpret this output to find the sample slope and its standard error.",
          "prepgo_plan": {
            "total_estimated_minutes": 22,
            "learn_minutes": 6,
            "review_minutes": 7,
            "practice_minutes": 9,
            "target_study_guide_words": 900,
            "target_flashcards_count": 14,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "UNC-4.AC",
              "summary": "Identify an appropriate confidence interval procedure for a slope of a regression model."
            },
            {
              "id": "UNC-4.AD",
              "summary": "Verify the conditions to calculate confidence intervals for the slope of a regression model."
            },
            {
              "id": "UNC-4.AE",
              "summary": "Determine the given margin of error for the slope of a regression model."
            },
            {
              "id": "UNC-4.AF",
              "summary": "Calculate an appropriate confidence interval for the slope of a regression model."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-4.AC.3",
              "summary": "The appropriate confidence interval for the slope of a regression model is a t-interval for the slope."
            },
            {
              "id": "UNC-4.AD.1",
              "summary": "To calculate a confidence interval for slope, check that the relationship is linear, standard deviation of y does not vary with x, data are independent, and responses are approximately normal for each x."
            },
            {
              "id": "UNC-4.AE.1",
              "summary": "The margin of error for the slope is t* times the standard error of the slope."
            },
            {
              "id": "UNC-4.AE.2",
              "summary": "The standard error for the slope has a specific formula involving the standard deviation of residuals and the standard deviation of x values."
            },
            {
              "id": "UNC-4.AF.1",
              "summary": "The point estimate for the slope of a regression model is the slope of the line of best fit, b."
            },
            {
              "id": "UNC-4.AF.2",
              "summary": "The interval estimate for the slope is b ± t*(SE of b)."
            }
          ]
        },
        {
          "topic_number": "9.3",
          "topic_title": "Justifying a Claim About the Slope of a Regression Model Based on a Confidence Interval",
          "ced_topic_title": "Justifying a Claim About the Slope of a Regression Model Based on a Confidence Interval",
          "topic_overview": "This topic focuses on interpreting the confidence interval for the slope. As with other parameters, you will practice writing a clear, contextual interpretation of the interval and the confidence level. A key use of this interval is to determine if there is a relationship between the variables. If the interval for the slope contains 0, it is plausible that the true slope is 0, meaning there is no linear relationship. If the interval does not contain 0, we have evidence of a genuine linear association.",
          "prepgo_plan": {
            "total_estimated_minutes": 20,
            "learn_minutes": 5,
            "review_minutes": 6,
            "practice_minutes": 9,
            "target_study_guide_words": 800,
            "target_flashcards_count": 12,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "UNC-4.AG",
              "summary": "Interpret a confidence interval for the slope of a regression model."
            },
            {
              "id": "UNC-4.AH",
              "summary": "Justify a claim based on a confidence interval for the slope of a regression model."
            },
            {
              "id": "UNC-4.AI",
              "summary": "Identify the effects of sample size on the width of a confidence interval for the slope."
            }
          ],
          "essential_knowledge": [
            {
              "id": "UNC-4.AG.1",
              "summary": "In repeated sampling, approximately C% of confidence intervals will capture the true population regression slope."
            },
            {
              "id": "UNC-4.AG.2",
              "summary": "An interpretation of a confidence interval for slope should reference the sample and population."
            },
            {
              "id": "UNC-4.AH.1",
              "summary": "A confidence interval for slope provides plausible values that can support a claim."
            },
            {
              "id": "UNC-4.AI.1",
              "summary": "The width of the confidence interval for the slope tends to decrease as sample size increases."
            }
          ]
        },
        {
          "topic_number": "9.4",
          "topic_title": "Setting Up a Test for the Slope of a Regression Model",
          "ced_topic_title": "Setting Up a Test for the Slope of a Regression Model",
          "topic_overview": "This topic introduces the significance test for the slope of a regression line, known as the t-test for the slope. You will learn how to write the null and alternative hypotheses. The null hypothesis is almost always that the true population slope is 0, meaning there is no linear relationship between the variables. The alternative can be one-sided or two-sided. We will also review the conditions for this test, which are the same as for the confidence interval.",
          "prepgo_plan": {
            "total_estimated_minutes": 20,
            "learn_minutes": 5,
            "review_minutes": 6,
            "practice_minutes": 9,
            "target_study_guide_words": 800,
            "target_flashcards_count": 12,
            "target_mcq_count": 6
          },
          "learning_objectives": [
            {
              "id": "VAR-7.J",
              "summary": "Identify the appropriate selection of a testing method for a slope of a regression model."
            },
            {
              "id": "VAR-7.K",
              "summary": "Identify appropriate null and alternative hypotheses for a slope of a regression model."
            },
            {
              "id": "VAR-7.L",
              "summary": "Verify the conditions for the significance test for the slope of a regression model."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-7.J.1",
              "summary": "The appropriate test for the slope of a regression model is a t-test for a slope."
            },
            {
              "id": "VAR-7.K.1",
              "summary": "The null hypothesis for a t-test for a slope is H0: beta = beta0, with one- or two-sided alternatives."
            },
            {
              "id": "VAR-7.L.1",
              "summary": "To test a regression slope, check that the relationship is linear, standard deviation of y is constant, data are independent, and responses are normal for each x."
            }
          ]
        },
        {
          "topic_number": "9.5",
          "topic_title": "Carrying Out a Test for the Slope of a Regression Model",
          "ced_topic_title": "Carrying Out a Test for the Slope of a Regression Model",
          "topic_overview": "This topic completes the four-step process for the t-test for the slope. You will learn to find the t-test statistic and the p-value from computer output. You will then make a conclusion by comparing the p-value to the significance level. A small p-value provides evidence against the null hypothesis and suggests that there is a genuine linear relationship between the variables in the population. This test is the formal way to confirm that a pattern we see in a scatterplot is statistically significant.",
          "prepgo_plan": {
            "total_estimated_minutes": 25,
            "learn_minutes": 7,
            "review_minutes": 7,
            "practice_minutes": 11,
            "target_study_guide_words": 1050,
            "target_flashcards_count": 14,
            "target_mcq_count": 7
          },
          "learning_objectives": [
            {
              "id": "VAR-7.M",
              "summary": "Calculate an appropriate test statistic for the slope of a regression model."
            },
            {
              "id": "DAT-3.M",
              "summary": "Interpret the p-value of a significance test for the slope of a regression model."
            },
            {
              "id": "DAT-3.N",
              "summary": "Justify a claim about the population based on the results of a significance test for the slope of a regression model."
            }
          ],
          "essential_knowledge": [
            {
              "id": "VAR-7.M.1",
              "summary": "The null distribution for the slope of a regression model is a t-distribution."
            },
            {
              "id": "VAR-7.M.2",
              "summary": "The sampling distribution of t = (b - beta) / SEb has a t-distribution with df = n-2."
            },
            {
              "id": "DAT-3.M.1",
              "summary": "Interpreting the p-value for a test for slope assumes the null hypothesis is true."
            },
            {
              "id": "DAT-3.N.1",
              "summary": "A formal decision compares the p-value to alpha to reject or fail to reject the null hypothesis."
            },
            {
              "id": "DAT-3.N.2",
              "summary": "The results of a significance test for slope provide statistical reasoning for a research question."
            }
          ]
        },
        {
          "topic_number": "9.6",
          "topic_title": "Skills Focus: Selecting an Appropriate Inference Procedure",
          "ced_topic_title": "Skills Focus: Selecting an Appropriate Inference Procedure",
          "topic_overview": "Congratulations, you have reached the end of the new material for AP Statistics! This final topic is a comprehensive review of all the inference procedures you have learned throughout the course. You will practice distinguishing between problems involving proportions, means, and slopes, and between one-sample, two-sample, matched pairs, and chi-square scenarios. Mastering the ability to select, implement, and communicate the results of the correct inference procedure is the ultimate goal of this course and will prepare you well for the AP exam.",
          "prepgo_plan": {
            "total_estimated_minutes": 21,
            "learn_minutes": 6,
            "review_minutes": 6,
            "practice_minutes": 9,
            "target_study_guide_words": 850,
            "target_flashcards_count": 12,
            "target_mcq_count": 6
          },
          "learning_objectives": [],
          "essential_knowledge": []
        }
      ]
    }
  ]
}