{
  "course_name": "AP U.S. History",
  "units": [
    {
      "unit_number": 1,
      "unit_title": "Period 1: 1491-1607",
      "ced_class_periods": "~8 Class Periods",
      "exam_weight": "4-6%",
      "topics": [
        {
          "topic_number": "1.1",
          "topic_title": "Contextualizing Period 1",
          "learning_objectives": [
            {
              "id": "Unit 1: Learning Objective A",
              "summary": "Explain the context for European encounters in the Americas from 1491 to 1607."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-1.1",
              "summary": "As native populations migrated and settled across North America, they developed distinct and complex societies by adapting to and transforming their diverse environments."
            },
            {
              "id": "KC-1.1.1",
              "summary": "Different native societies adapted to and transformed their environments through innovations in agriculture, resource use, and social structure."
            },
            {
              "id": "KC-1.2",
              "summary": "Contact among Europeans, Native Americans, and Africans led to the Columbian Exchange and significant social, cultural, and political changes on both sides of the Atlantic."
            },
            {
              "id": "KC-1.2.1",
              "summary": "European expansion into the Western Hemisphere generated intense social, religious, political, and economic competition and changes within European societies."
            },
            {
              "id": "KC-1.2.II",
              "summary": "The Columbian Exchange and the development of the Spanish Empire in the Western Hemisphere resulted in extensive demographic, economic, and social changes."
            },
            {
              "id": "KC-1.2.III",
              "summary": "In their interactions, Europeans and Native Americans asserted divergent worldviews regarding issues such as religion, gender roles, family, land use, and power."
            }
          ]
        },
        {
          "topic_number": "1.2",
          "topic_title": "Native American Societies Before European Contact",
          "learning_objectives": [
            {
              "id": "Unit 1: Learning Objective B",
              "summary": "Explain how and why various native populations in the period before European contact interacted with the natural environment in North America."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-1.1.I.A",
              "summary": "The spread of maize cultivation from Mexico northward supported economic development, settlement, advanced irrigation, and social diversification among societies."
            },
            {
              "id": "KC-1.1.I.B",
              "summary": "Societies in the arid Great Basin and the grasslands of the western Great Plains responded by developing largely mobile lifestyles."
            },
            {
              "id": "KC-1.1.I.C",
              "summary": "In the Northeast, the Mississippi River Valley, and along the Atlantic seaboard, some societies developed mixed agricultural and hunter-gatherer economies, which favored the development of permanent villages."
            },
            {
              "id": "KC-1.1.I.D",
              "summary": "Societies in the Northwest and present-day California supported themselves by hunting and gathering, and in some areas developed settled communities supported by the vast resources of the ocean."
            }
          ]
        },
        {
          "topic_number": "1.3",
          "topic_title": "European Exploration in the Americas",
          "learning_objectives": [
            {
              "id": "Unit 1: Learning Objective C",
              "summary": "Explain the causes of exploration and conquest of the New World by various European nations."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-1.2.I.A",
              "summary": "European nations' efforts to explore and conquer the New World stemmed from a search for new sources of wealth, economic and military competition, and a desire to spread Christianity."
            }
          ]
        },
        {
          "topic_number": "1.4",
          "topic_title": "Columbian Exchange, Spanish Exploration, and Conquest",
          "learning_objectives": [
            {
              "id": "Unit 1: Learning Objective D",
              "summary": "Explain the causes of the Columbian Exchange and its effect on Europe and the Americas during the period after 1492."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-1.2.I.B",
              "summary": "The Columbian Exchange brought new crops to Europe from the Americas, stimulating European population growth, and new sources of mineral wealth, which facilitated the European shift from feudalism to capitalism."
            },
            {
              "id": "KC-1.2.I.C",
              "summary": "Improvements in maritime technology and more organized methods for conducting international trade, such as joint-stock companies, helped drive changes to economies in Europe and the Americas."
            },
            {
              "id": "KC-1.2.II.A",
              "summary": "Spanish exploration and conquest of the Americas were accompanied by widespread deadly epidemics that devastated native populations and by the introduction of crops and animals not found in the Americas."
            }
          ]
        },
        {
          "topic_number": "1.5",
          "topic_title": "Labor, Slavery, and Caste in the Spanish Colonial System",
          "learning_objectives": [
            {
              "id": "Unit 1: Learning Objective E",
              "summary": "Explain how the growth of the Spanish Empire in North America shaped the development of social and economic structures over time."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-1.2.II.B",
              "summary": "In the encomienda system, Spanish colonial economies marshaled Native American labor to support plantation-based agriculture and extract precious metals and other resources."
            },
            {
              "id": "KC-1.2.II.C",
              "summary": "European traders partnered with some West African groups to forcibly extract enslaved laborers for the Americas. The Spanish imported enslaved Africans to labor in plantation agriculture and mining."
            },
            {
              "id": "KC-1.2.II.D",
              "summary": "The Spanish developed a caste system that incorporated, and carefully defined the status of, the diverse population of Europeans, Africans, and Native Americans in their empire."
            }
          ]
        },
        {
          "topic_number": "1.6",
          "topic_title": "Cultural Interactions Between Europeans, Native Americans, and Africans",
          "learning_objectives": [
            {
              "id": "Unit 1: Learning Objective F",
              "summary": "Explain how and why European and Native American perspectives of others developed and changed in the period."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-1.2.III",
              "summary": "In their interactions, Europeans and Native Americans asserted divergent worldviews regarding issues such as religion, gender roles, family, land use, and power."
            },
            {
              "id": "KC-1.2.III.A",
              "summary": "Mutual misunderstandings between Europeans and Native Americans often defined the early years of interaction and trade as each group sought to make sense of the other. Over time, they adopted some useful aspects of each other's culture."
            },
            {
              "id": "KC-1.2.III.B",
              "summary": "As European encroachments on Native Americans’ lands and demands on their labor increased, native peoples sought to defend their political sovereignty, economic prosperity, religious beliefs, and concepts of gender relations through diplomatic negotiations and military resistance."
            },
            {
              "id": "KC-1.2.III.C",
              "summary": "Extended contact with Native Americans and Africans fostered a debate among European religious and political leaders about how non-Europeans should be treated, as well as evolving religious, cultural, and racial justifications for their subjugation."
            }
          ]
        },
        {
          "topic_number": "1.7",
          "topic_title": "Causation in Period 1",
          "learning_objectives": [
            {
              "id": "Unit 1: Learning Objective G",
              "summary": "Explain the effects of the development of transatlantic voyages from 1491 to 1607."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-1.1",
              "summary": "As native populations migrated and settled across North America, they developed distinct and complex societies by adapting to and transforming their diverse environments."
            },
            {
              "id": "KC-1.1.1",
              "summary": "Different native societies adapted to and transformed their environments through innovations in agriculture, resource use, and social structure."
            },
            {
              "id": "KC-1.2",
              "summary": "Contact among Europeans, Native Americans, and Africans led to the Columbian Exchange and significant social, cultural, and political changes on both sides of the Atlantic."
            },
            {
              "id": "KC-1.2.1",
              "summary": "European expansion into the Western Hemisphere generated intense social, religious, political, and economic competition and changes within European societies."
            },
            {
              "id": "KC-1.2.II",
              "summary": "The Columbian Exchange and the development of the Spanish Empire in the Western Hemisphere resulted in extensive demographic, economic, and social changes."
            },
            {
              "id": "KC-1.2.III",
              "summary": "In their interactions, Europeans and Native Americans asserted divergent worldviews regarding issues such as religion, gender roles, family, land use, and power."
            }
          ]
        }
      ]
    },
    {
      "unit_number": 2,
      "unit_title": "Period 2: 1607-1754",
      "ced_class_periods": "~14 Class Periods",
      "exam_weight": "6-8%",
      "topics": [
        {
          "topic_number": "2.1",
          "topic_title": "Contextualizing Period 2",
          "learning_objectives": [
            {
              "id": "Unit 2: Learning Objective A",
              "summary": "Explain the context for the colonization of North America from 1607 to 1754."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-2.1",
              "summary": "Europeans developed varied colonization and migration patterns, influenced by different imperial goals, cultures, and North American environments, and competed with each other and American Indians for resources."
            },
            {
              "id": "KC-2.1.I",
              "summary": "Spanish, French, Dutch, and British colonizers had different goals involving land and labor that shaped their colonies' development and relationships with native populations."
            },
            {
              "id": "KC-2.1.II",
              "summary": "In the 17th century, early British colonies developed along the Atlantic coast, with regional differences reflecting various environmental, economic, cultural, and demographic factors."
            },
            {
              "id": "KC-2.1.III",
              "summary": "Competition over resources between European rivals and American Indians encouraged industry and trade and led to conflict in the Americas."
            },
            {
              "id": "KC-2.2",
              "summary": "The British colonies participated in exchanges with Great Britain that encouraged both stronger bonds and resistance to Britain's control."
            },
            {
              "id": "KC-2.2.I",
              "summary": "Transatlantic exchanges led residents of the British colonies to evolve in their political and cultural attitudes as they became increasingly tied to Britain and one another."
            },
            {
              "id": "KC-2.2.II",
              "summary": "Like other European empires in the Americas, the English colonies developed a system of slavery that reflected the specific characteristics of those colonies."
            }
          ]
        },
        {
          "topic_number": "2.2",
          "topic_title": "European Colonization",
          "learning_objectives": [
            {
              "id": "Unit 2: Learning Objective B",
              "summary": "Explain how and why various European colonies developed and expanded from 1607 to 1754."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-2.1.I.A",
              "summary": "Spanish efforts to extract wealth led to institutions based on subjugating native populations, converting them to Christianity, and incorporating them and Africans into colonial society."
            },
            {
              "id": "KC-2.1.I.B",
              "summary": "French and Dutch colonial efforts involved few Europeans and relied on trade alliances and intermarriage with American Indians to acquire furs and other products for export."
            },
            {
              "id": "KC-2.1.I.C",
              "summary": "English colonization attracted a large number of migrants who sought social mobility, economic prosperity, religious freedom, and improved living conditions, focusing on agriculture and living separately from Native Americans."
            }
          ]
        },
        {
          "topic_number": "2.3",
          "topic_title": "The Regions of British Colonies",
          "learning_objectives": [
            {
              "id": "Unit 2: Learning Objective C",
              "summary": "Explain how and why environmental and other factors shaped the development and expansion of various British colonies from 1607 to 1754."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-2.1.II.A",
              "summary": "The Chesapeake and North Carolina colonies grew prosperous exporting tobacco, a labor-intensive product initially cultivated by white indentured servants and later by enslaved Africans."
            },
            {
              "id": "KC-2.1.II.B",
              "summary": "The New England colonies, initially settled by Puritans, developed around small towns with family farms and achieved a thriving mixed economy of agriculture and commerce."
            },
            {
              "id": "KC-2.1.II.C",
              "summary": "The middle colonies supported a flourishing export economy based on cereal crops and attracted a broad range of European migrants, leading to greater cultural, ethnic, and religious diversity and tolerance."
            },
            {
              "id": "KC-2.1.II.D",
              "summary": "The southern Atlantic coast and British West Indies colonies developed plantation economies based on exporting staple crops, depending on the labor of enslaved Africans who often constituted the majority of the population."
            },
            {
              "id": "KC-2.1.II.E",
              "summary": "Distance and Britain's initially lax attention led to the colonies creating self-governing institutions. New England colonies based power in town meetings, while in southern colonies, elite planters dominated elected assemblies."
            }
          ]
        },
        {
          "topic_number": "2.4",
          "topic_title": "Transatlantic Trade",
          "learning_objectives": [
            {
              "id": "Unit 2: Learning Objective D",
              "summary": "Explain the causes and effects of transatlantic trade over time."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-2.1.III.A",
              "summary": "An Atlantic economy developed, exchanging goods, enslaved Africans, and American Indians between Europe, Africa, and the Americas. Colonial economies focused on exporting commodities valued in Europe."
            },
            {
              "id": "KC-2.1.III.B",
              "summary": "Continuing trade with Europeans increased the flow of goods in and out of American Indian communities, stimulating cultural and economic changes and spreading epidemic diseases that caused radical demographic shifts."
            },
            {
              "id": "KC-2.2.I.C",
              "summary": "The British government increasingly tried to incorporate its North American colonies into a coherent imperial structure to pursue mercantilist aims, but conflicts with colonists and American Indians led to erratic enforcement."
            }
          ]
        },
        {
          "topic_number": "2.5",
          "topic_title": "Interactions Between American Indians and Europeans",
          "learning_objectives": [
            {
              "id": "Unit 2: Learning Objective E",
              "summary": "Explain how and why interactions between various European nations and American Indians changed over time."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-2.1.III.C",
              "summary": "Interactions between European rivals and American Indian populations fostered both accommodation and conflict. European colonies allied with and armed American Indian groups, who sought alliances against other American Indian groups."
            },
            {
              "id": "KC-2.1.III.E",
              "summary": "British conflicts with American Indians over land, resources, and political boundaries led to military confrontations, such as Metacom’s War (King Philip’s War) in New England."
            },
            {
              "id": "KC-2.1.III.F",
              "summary": "American Indian resistance to Spanish colonizing efforts, particularly after the Pueblo Revolt, led to Spanish accommodation of some aspects of American Indian culture in the Southwest."
            }
          ]
        },
        {
          "topic_number": "2.6",
          "topic_title": "Slavery in the British Colonies",
          "learning_objectives": [
            {
              "id": "Unit 2: Learning Objective F",
              "summary": "Explain the causes and effects of slavery in the various British colonial regions."
            },
            {
              "id": "Unit 2: Learning Objective G",
              "summary": "Explain how enslaved people responded to slavery."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-2.2.II.A",
              "summary": "All British colonies participated in the Atlantic slave trade due to abundant land, European demand for colonial goods, and a shortage of indentured servants. The Chesapeake and southern colonies had large numbers of enslaved workers."
            },
            {
              "id": "KC-2.2.II.B",
              "summary": "As chattel slavery became dominant in many southern colonies, new laws created a strict racial system that defined the descendants of African American mothers as black and enslaved in perpetuity."
            },
            {
              "id": "KC-2.2.II.C",
              "summary": "Africans developed both overt and covert means to resist the dehumanizing nature of slavery and maintain their family systems, culture, and religion."
            }
          ]
        },
        {
          "topic_number": "2.7",
          "topic_title": "Colonial Society and Culture",
          "learning_objectives": [
            {
              "id": "Unit 2: Learning Objective H",
              "summary": "Explain how and why the movement of people and ideas across the Atlantic contributed to the development of American culture over time."
            },
            {
              "id": "Unit 2: Learning Objective I",
              "summary": "Explain how and why the different goals of European leaders and colonists affected how they viewed themselves and their relationship with Britain."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-2.2.I.A",
              "summary": "The presence of different European religious and ethnic groups contributed to pluralism and intellectual exchange, later enhanced by the first Great Awakening and the spread of European Enlightenment ideas."
            },
            {
              "id": "KC-2.2.I.B",
              "summary": "The British colonies experienced a gradual Anglicization, developing autonomous political communities based on English models, influenced by intercolonial commercial ties, a transatlantic print culture, and Protestant evangelicalism."
            },
            {
              "id": "KC-2.1.III.D",
              "summary": "The diverging goals of European leaders and colonists led to a growing mistrust. Colonists expressed dissatisfaction over issues including territorial settlements, frontier defense, self-rule, and trade."
            },
            {
              "id": "KC-2.2.I.D",
              "summary": "Colonists' resistance to imperial control drew on experiences of self-government, evolving ideas of liberty, Enlightenment political thought, greater religious independence, and an ideology critical of imperial corruption."
            }
          ]
        },
        {
          "topic_number": "2.8",
          "topic_title": "Comparison in Period 2",
          "learning_objectives": [
            {
              "id": "Unit 2: Learning Objective J",
              "summary": "Compare the effects of the development of colonial society in the various regions of North America."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-2.1",
              "summary": "Europeans developed varied colonization and migration patterns, influenced by different imperial goals, cultures, and North American environments, and competed with each other and American Indians for resources."
            },
            {
              "id": "KC-2.1.I",
              "summary": "Spanish, French, Dutch, and British colonizers had different goals involving land and labor that shaped their colonies' development and relationships with native populations."
            },
            {
              "id": "KC-2.1.II",
              "summary": "In the 17th century, early British colonies developed along the Atlantic coast, with regional differences reflecting various environmental, economic, cultural, and demographic factors."
            },
            {
              "id": "KC-2.1.III",
              "summary": "Competition over resources between European rivals and American Indians encouraged industry and trade and led to conflict in the Americas."
            },
            {
              "id": "KC-2.2",
              "summary": "The British colonies participated in exchanges with Great Britain that encouraged both stronger bonds and resistance to Britain's control."
            },
            {
              "id": "KC-2.2.I",
              "summary": "Transatlantic exchanges led residents of the British colonies to evolve in their political and cultural attitudes as they became increasingly tied to Britain and one another."
            },
            {
              "id": "KC-2.2.II",
              "summary": "Like other European empires in the Americas, the English colonies developed a system of slavery that reflected the specific characteristics of those colonies."
            }
          ]
        }
      ]
    },
    {
      "unit_number": 3,
      "unit_title": "Period 3: 1754-1800",
      "ced_class_periods": "~17 Class Periods",
      "exam_weight": "10-17%",
      "topics": [
        {
          "topic_number": "3.1",
          "topic_title": "Contextualizing Period 3",
          "learning_objectives": [
            {
              "id": "Unit 3: Learning Objective A",
              "summary": "Explain the context in which America gained independence and developed a sense of national identity."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-3.1",
              "summary": "British attempts to assert tighter control over its North American colonies and the colonial resolve to pursue self-government led to a colonial independence movement and the Revolutionary War."
            },
            {
              "id": "KC-3.1.I",
              "summary": "Competition among the British, French, and American Indians for economic and political advantage in North America culminated in the Seven Years’ War, in which Britain defeated France and allied American Indians."
            },
            {
              "id": "KC-3.1.II",
              "summary": "The desire of many colonists to assert ideals of self-government in the face of renewed British imperial efforts led to a colonial independence movement and war with Britain."
            },
            {
              "id": "KC-3.2",
              "summary": "The American Revolution’s democratic and republican ideals inspired new experiments with different forms of government."
            },
            {
              "id": "KC-3.2.I",
              "summary": "The ideals that inspired the revolutionary cause reflected new beliefs about politics, religion, and society that had been developing over the course of the 18th century."
            },
            {
              "id": "KC-3.2.II",
              "summary": "After declaring independence, American political leaders created new constitutions and declarations of rights that articulated the role of state and federal governments while protecting individual liberties."
            },
            {
              "id": "KC-3.2.III.i",
              "summary": "New forms of national culture and political institutions developed in the United States alongside continued regional variations and differences over economic, political, social, and foreign policy issues."
            },
            {
              "id": "KC-3.3",
              "summary": "Migration within North America and competition over resources, boundaries, and trade intensified conflicts among peoples and nations."
            },
            {
              "id": "KC-3.3.I",
              "summary": "In the decades after American independence, interactions among different groups resulted in competition for resources, shifting alliances, and cultural blending."
            },
            {
              "id": "KC-3.3.II",
              "summary": "The continued presence of European powers in North America challenged the United States to find ways to safeguard its borders, maintain neutral trading rights, and promote its economic interests."
            }
          ]
        },
        {
          "topic_number": "3.2",
          "topic_title": "The Seven Years’ War (The French and Indian War)",
          "learning_objectives": [
            {
              "id": "Unit 3: Learning Objective B",
              "summary": "Explain the causes and effects of the Seven Years’ War (the French and Indian War)."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-3.1.I.A",
              "summary": "Colonial rivalry intensified between Britain and France as the growing population of the British colonies expanded into the interior of North America, threatening French–Indian trade networks and American Indian autonomy."
            },
            {
              "id": "KC-3.1.I.B",
              "summary": "Britain achieved a major expansion of its territorial holdings by defeating the French, but at tremendous expense, setting the stage for imperial efforts to raise revenue and consolidate control over the colonies."
            },
            {
              "id": "KC-3.1.I.C",
              "summary": "After the British victory, imperial officials’ attempts to prevent colonists from moving westward generated colonial opposition, while native groups sought to continue trading with Europeans and resist the encroachments of colonists."
            }
          ]
        },
        {
          "topic_number": "3.3",
          "topic_title": "Taxation Without Representation",
          "learning_objectives": [
            {
              "id": "Unit 3: Learning Objective C",
              "summary": "Explain how British colonial policies regarding North America led to the Revolutionary War."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-3.1.II.A",
              "summary": "Imperial struggles, new British taxes without colonial representation, and asserting imperial authority began to unite colonists against constraints on their economic activities and political rights."
            },
            {
              "id": "KC-3.1.II.B",
              "summary": "Colonial leaders based their calls for resistance on arguments about the rights of British subjects, individual rights, local traditions of self-rule, and the ideas of the Enlightenment."
            },
            {
              "id": "KC-3.1.II.C",
              "summary": "The effort for American independence was energized by colonial leaders like Benjamin Franklin, as well as by popular movements that included the political activism of laborers, artisans, and women."
            },
            {
              "id": "KC-3.1.II.D",
              "summary": "In the face of economic shortages and British military occupation, men and women mobilized in large numbers to provide financial and material support to the Patriot movement."
            }
          ]
        },
        {
          "topic_number": "3.4",
          "topic_title": "Philosophical Foundations of the American Revolution",
          "learning_objectives": [
            {
              "id": "Unit 3: Learning Objective D",
              "summary": "Explain how and why colonial attitudes about government and the individual changed in the years leading up to the American Revolution."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-3.2.I.A",
              "summary": "Enlightenment ideas and philosophy inspired many American political thinkers to emphasize individual talent over hereditary privilege, while religion strengthened Americans’ view of themselves as a people blessed with liberty."
            },
            {
              "id": "KC-3.2.I.B",
              "summary": "The belief in republican forms of government based on natural rights found expression in Thomas Paine’s Common Sense and the Declaration of Independence, shaping Americans' understanding of the nation's founding ideals."
            }
          ]
        },
        {
          "topic_number": "3.5",
          "topic_title": "The American Revolution",
          "learning_objectives": [
            {
              "id": "Unit 3: Learning Objective E",
              "summary": "Explain how various factors contributed to the American victory in the Revolution."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-3.1.II.E",
              "summary": "Despite loyalist opposition and Great Britain’s advantages, the Patriot cause succeeded because of colonial militias, the Continental Army, Washington’s leadership, ideological commitment, and assistance from European allies."
            }
          ]
        },
        {
          "topic_number": "3.6",
          "topic_title": "The Influence of Revolutionary Ideals",
          "learning_objectives": [
            {
              "id": "Unit 3: Learning Objective F",
              "summary": "Explain the various ways the American Revolution affected society."
            },
            {
              "id": "Unit 3: Learning Objective G",
              "summary": "Describe the global impact of the American Revolution."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-3.2.I.C",
              "summary": "During and after the American Revolution, an increased awareness of societal inequalities motivated some individuals and groups to call for the abolition of slavery and greater political democracy."
            },
            {
              "id": "KC-3.2.I.D",
              "summary": "In response to women’s participation in the Revolution and their appeals for expanded roles, an ideal of “republican motherhood” gained popularity, giving women a new importance in American political culture."
            },
            {
              "id": "KC-3.2.I.E",
              "summary": "The American Revolution and the ideals set forth in the Declaration of Independence reverberated in France, Haiti, and Latin America, inspiring future independence movements."
            }
          ]
        },
        {
          "topic_number": "3.7",
          "topic_title": "The Articles of Confederation",
          "learning_objectives": [
            {
              "id": "Unit 3: Learning Objective H",
              "summary": "Explain how different forms of government developed and changed as a result of the Revolutionary Period."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-3.2.II.A",
              "summary": "Many new state constitutions placed power in the hands of the legislative branch and maintained property qualifications for voting and citizenship."
            },
            {
              "id": "KC-3.2.II.B",
              "summary": "The Articles of Confederation unified the newly independent states, creating a central government with limited power. Post-Revolution difficulties led to calls for a stronger central government."
            },
            {
              "id": "KC-3.3.I.C",
              "summary": "As settlers moved westward in the 1780s, Congress enacted the Northwest Ordinance for admitting new states, which promoted public education, private property protection, and a ban on slavery in the Northwest Territory."
            }
          ]
        },
        {
          "topic_number": "3.8",
          "topic_title": "The Constitutional Convention and Debates over Ratification",
          "learning_objectives": [
            {
              "id": "Unit 3: Learning Objective I",
              "summary": "Explain the differing ideological positions on the structure and function of the federal government."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-3.2.II.C.i",
              "summary": "Delegates from the states participated in the Constitutional Convention and through negotiation, collaboration, and compromise proposed a constitution."
            },
            {
              "id": "KC-3.2.II.D",
              "summary": "The Constitutional Convention compromised over the representation of slave states in Congress and the role of the federal government in regulating slavery and the slave trade, allowing the prohibition of the international slave trade after 1808."
            },
            {
              "id": "KC-3.2.II.E",
              "summary": "In the debate over ratifying the Constitution, Anti-Federalists battled with Federalists. Federalists ensured ratification by promising a Bill of Rights that enumerated individual rights and restricted federal powers."
            }
          ]
        },
        {
          "topic_number": "3.9",
          "topic_title": "The Constitution",
          "learning_objectives": [
            {
              "id": "Unit 3: Learning Objective J",
              "summary": "Explain the continuities and changes in the structure and functions of the government with the ratification of the Constitution."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-3.2.II.C.ii",
              "summary": "Delegates from the states participated in the Constitutional Convention that created a limited but dynamic central government embodying federalism and providing for a separation of powers between its three branches."
            }
          ]
        },
        {
          "topic_number": "3.10",
          "topic_title": "Shaping a New Republic",
          "learning_objectives": [
            {
              "id": "Unit 3: Learning Objective K",
              "summary": "Explain how and why competition intensified conflicts among peoples and nations from 1754 to 1800."
            },
            {
              "id": "Unit 3: Learning Objective L",
              "summary": "Explain how and why political ideas, institutions, and party systems developed and changed in the new republic."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-3.3.II.A",
              "summary": "The U.S. government forged diplomatic initiatives to deal with the continued British and Spanish presence in North America as U.S. settlers migrated beyond the Appalachians and sought free navigation of the Mississippi River."
            },
            {
              "id": "KC-3.3.II.B",
              "summary": "War between France and Britain resulting from the French Revolution presented challenges to the United States over free trade and foreign policy and fostered political disagreement."
            },
            {
              "id": "KC-3.3.I.E",
              "summary": "The Spanish, supported by the bonded labor of local American Indians, expanded their mission settlements into California, providing opportunities for social mobility among soldiers and leading to new cultural blending."
            },
            {
              "id": "KC-3.3.I.D",
              "summary": "An ambiguous relationship between the federal government and American Indian tribes contributed to problems regarding treaties and legal claims relating to the seizure of their lands."
            },
            {
              "id": "KC-3.2.III.A",
              "summary": "During the administrations of George Washington and John Adams, political leaders created institutions and precedents that put the principles of the Constitution into practice."
            },
            {
              "id": "KC-3.2.III.B",
              "summary": "Political leaders in the 1790s took various positions on issues like the national government versus states' rights, economic policy, and foreign policy, leading to the formation of the Federalist and Democratic-Republican parties."
            },
            {
              "id": "KC-3.3.II.C",
              "summary": "George Washington’s Farewell Address encouraged national unity, as he cautioned against political factions and warned about the danger of permanent foreign alliances."
            }
          ]
        },
        {
          "topic_number": "3.11",
          "topic_title": "Developing an American Identity",
          "learning_objectives": [
            {
              "id": "Unit 3: Learning Objective M",
              "summary": "Explain the continuities and changes in American culture from 1754 to 1800."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-3.2.III.ii",
              "summary": "New forms of national culture developed in the United States alongside continued regional variations."
            },
            {
              "id": "KC-3.2.III.D",
              "summary": "Ideas about national identity increasingly found expression in works of art, literature, and architecture."
            }
          ]
        },
        {
          "topic_number": "3.12",
          "topic_title": "Movement in the Early Republic",
          "learning_objectives": [
            {
              "id": "Unit 3: Learning Objective N",
              "summary": "Explain how and why migration and immigration to and within North America caused competition and conflict over time."
            },
            {
              "id": "Unit 3: Learning Objective O",
              "summary": "Explain the continuities and changes in regional attitudes about slavery as it expanded from 1754 to 1800."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-3.3.I.A",
              "summary": "Various American Indian groups repeatedly adjusted their alliances with Europeans, other tribes, and the U.S. to limit white settler migration and maintain control of their lands and resources. British alliances with American Indians contributed to U.S.-Britain tensions."
            },
            {
              "id": "KC-3.3.I.B",
              "summary": "As increasing numbers of migrants moved westward, frontier cultures continued to grow, fueling social, political, and ethnic tensions."
            },
            {
              "id": "KC-3.2.III.C",
              "summary": "The expansion of slavery in the deep South and adjacent western lands and rising antislavery sentiment began to create distinctive regional attitudes toward slavery."
            }
          ]
        },
        {
          "topic_number": "3.13",
          "topic_title": "Continuity and Change in Period 3",
          "learning_objectives": [
            {
              "id": "Unit 3: Learning Objective P",
              "summary": "Explain how the American independence movement affected society from 1754 to 1800."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-3.1",
              "summary": "British attempts to assert tighter control over its North American colonies and the colonial resolve to pursue self-government led to a colonial independence movement and the Revolutionary War."
            },
            {
              "id": "KC-3.1.I",
              "summary": "Competition among the British, French, and American Indians for economic and political advantage in North America culminated in the Seven Years’ War, in which Britain defeated France and allied American Indians."
            },
            {
              "id": "KC-3.1.II",
              "summary": "The desire of many colonists to assert ideals of self-government in the face of renewed British imperial efforts led to a colonial independence movement and war with Britain."
            },
            {
              "id": "KC-3.2",
              "summary": "The American Revolution’s democratic and republican ideals inspired new experiments with different forms of government."
            },
            {
              "id": "KC-3.2.I",
              "summary": "The ideals that inspired the revolutionary cause reflected new beliefs about politics, religion, and society that had been developing over the course of the 18th century."
            },
            {
              "id": "KC-3.2.II",
              "summary": "After declaring independence, American political leaders created new constitutions and declarations of rights that articulated the role of state and federal governments while protecting individual liberties."
            },
            {
              "id": "KC-3.2.III.i",
              "summary": "New forms of national culture and political institutions developed in the United States alongside continued regional variations and differences over economic, political, social, and foreign policy issues."
            },
            {
              "id": "KC-3.3",
              "summary": "Migration within North America and competition over resources, boundaries, and trade intensified conflicts among peoples and nations."
            },
            {
              "id": "KC-3.3.I",
              "summary": "In the decades after American independence, interactions among different groups resulted in competition for resources, shifting alliances, and cultural blending."
            },
            {
              "id": "KC-3.3.II",
              "summary": "The continued presence of European powers in North America challenged the United States to find ways to safeguard its borders, maintain neutral trading rights, and promote its economic interests."
            }
          ]
        }
      ]
    },
    {
      "unit_number": 4,
      "unit_title": "Period 4: 1800-1848",
      "ced_class_periods": "~17 Class Periods",
      "exam_weight": "10-17%",
      "topics": [
        {
          "topic_number": "4.1",
          "topic_title": "Contextualizing Period 4",
          "learning_objectives": [
            {
              "id": "Unit 4: Learning Objective A",
              "summary": "Explain the context in which the republic developed from 1800 to 1848."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-4.1",
              "summary": "The United States began to develop a modern democracy and celebrated a new national culture, while Americans sought to define the nation’s democratic ideals and change their society and institutions to match them."
            },
            {
              "id": "KC-4.1.I",
              "summary": "The nation’s transition to a more participatory democracy was achieved by expanding suffrage from property-based to all adult white men, accompanied by the growth of political parties."
            },
            {
              "id": "KC-4.1.II",
              "summary": "While Americans embraced a new national culture, various groups developed distinctive cultures of their own."
            },
            {
              "id": "KC-4.1.III",
              "summary": "Increasing numbers of Americans, inspired by new religious and intellectual movements, worked primarily outside of government institutions to advance their ideals."
            },
            {
              "id": "KC-4.2",
              "summary": "Innovations in technology, agriculture, and commerce powerfully accelerated the American economy, precipitating profound changes to U.S. society and to national and regional identities."
            },
            {
              "id": "KC-4.2.I",
              "summary": "New transportation systems and technologies dramatically expanded manufacturing and agricultural production."
            },
            {
              "id": "KC-4.2.II",
              "summary": "The changes caused by the market revolution had significant effects on U.S. society, workers’ lives, and gender and family relations."
            },
            {
              "id": "KC-4.2.III",
              "summary": "Economic development shaped settlement and trade patterns, helping to unify the nation while also encouraging the growth of different regions."
            },
            {
              "id": "KC-4.3",
              "summary": "The U.S. interest in increasing foreign trade and expanding its national borders shaped the nation’s foreign policy and spurred government and private initiatives."
            },
            {
              "id": "KC-4.3.I",
              "summary": "Struggling to create an independent global presence, the United States sought to claim territory throughout the North American continent and promote foreign trade."
            },
            {
              "id": "KC-4.3.II",
              "summary": "The United States’ acquisition of lands in the West gave rise to contests over the extension of slavery into new territories."
            }
          ]
        },
        {
          "topic_number": "4.2",
          "topic_title": "The Rise of Political Parties and the Era of Jefferson",
          "learning_objectives": [
            {
              "id": "Unit 4: Learning Objective B",
              "summary": "Explain the causes and effects of policy debates in the early republic."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-4.1.I.A",
              "summary": "In the early 1800s, national political parties continued to debate issues such as the tariff, powers of the federal government, and relations with European powers."
            },
            {
              "id": "KC-4.1.I.B",
              "summary": "Supreme Court decisions established the primacy of the judiciary in determining the meaning of the Constitution and asserted that federal laws took precedence over state laws."
            },
            {
              "id": "KC-4.3.I.A.i",
              "summary": "Following the Louisiana Purchase, the U.S. government sought influence and control over North America through exploration and diplomatic efforts."
            }
          ]
        },
        {
          "topic_number": "4.3",
          "topic_title": "Politics and Regional Interests",
          "learning_objectives": [
            {
              "id": "Unit 4: Learning Objective C",
              "summary": "Explain how different regional interests affected debates about the role of the federal government in the early republic."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-4.1.I.D",
              "summary": "Regional interests often trumped national concerns as the basis for many political leaders’ positions on slavery and economic policy."
            },
            {
              "id": "KC-4.2.III.D",
              "summary": "Plans to unify the U.S. economy, such as the American System, generated debates over whether such policies would benefit agriculture or industry, potentially favoring different sections of the country."
            },
            {
              "id": "KC-4.3.II.C",
              "summary": "Congressional attempts at political compromise, such as the Missouri Compromise, only temporarily stemmed growing tensions between opponents and defenders of slavery."
            }
          ]
        },
        {
          "topic_number": "4.4",
          "topic_title": "America on the World Stage",
          "learning_objectives": [
            {
              "id": "Unit 4: Learning Objective D",
              "summary": "Explain how and why American foreign policy developed and expanded over time."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-4.3.I",
              "summary": "Struggling to create an independent global presence, the United States sought to claim territory throughout the North American continent and promote foreign trade."
            },
            {
              "id": "KC-4.3.I.A.ii",
              "summary": "The U.S. government sought influence and control over the Western Hemisphere through military actions, American Indian removal, and diplomatic efforts such as the Monroe Doctrine."
            }
          ]
        },
        {
          "topic_number": "4.5",
          "topic_title": "Market Revolution: Industrialization",
          "learning_objectives": [
            {
              "id": "Unit 4: Learning Objective E",
              "summary": "Explain the causes and effects of the innovations in technology, agriculture, and commerce over time."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-4.2.I.A",
              "summary": "Entrepreneurs helped create a market revolution in production and commerce, where market relationships between producers and consumers prevailed as manufacturing became more organized."
            },
            {
              "id": "KC-4.2.I.B",
              "summary": "Innovations including textile machinery, steam engines, interchangeable parts, the telegraph, and agricultural inventions increased the efficiency of production methods."
            },
            {
              "id": "KC-4.2.I.C",
              "summary": "Legislation and judicial systems supported the development of roads, canals, and railroads, which extended markets and helped foster regional interdependence, linking the North and Midwest more closely than the South."
            },
            {
              "id": "KC-4.2.III.B",
              "summary": "Increasing Southern cotton production and the related growth of Northern manufacturing, banking, and shipping industries promoted the development of national and international commercial ties."
            }
          ]
        },
        {
          "topic_number": "4.6",
          "topic_title": "Market Revolution: Society and Culture",
          "learning_objectives": [
            {
              "id": "Unit 4: Learning Objective F",
              "summary": "Explain how and why innovation in technology, agriculture, and commerce affected various segments of American society over time."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-4.2.III.A",
              "summary": "Large numbers of international migrants moved to industrializing Northern cities, while many Americans moved west of the Appalachians, developing thriving new communities along the Ohio and Mississippi rivers."
            },
            {
              "id": "KC-4.2.II.B",
              "summary": "The growth of manufacturing drove a significant increase in prosperity for some, leading to the emergence of a larger middle class and a small wealthy business elite, but also a large and growing population of laboring poor."
            },
            {
              "id": "KC-4.2.II.A",
              "summary": "Increasing numbers of Americans, especially women and men working in factories, supported themselves by producing goods for distant markets rather than semi-subsistence agriculture."
            },
            {
              "id": "KC-4.2.II.C",
              "summary": "Gender and family roles changed in response to the market revolution, particularly with the growth of domestic ideals that emphasized the separation of public and private spheres."
            }
          ]
        },
        {
          "topic_number": "4.7",
          "topic_title": "Expanding Democracy",
          "learning_objectives": [
            {
              "id": "Unit 4: Learning Objective G",
              "summary": "Explain the causes and effects of the expansion of participatory democracy from 1800 to 1848."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-4.1.I",
              "summary": "The nation’s transition to a more participatory democracy was achieved by expanding suffrage from property-based to all adult white men, accompanied by the growth of political parties."
            }
          ]
        },
        {
          "topic_number": "4.8",
          "topic_title": "Jackson and Federal Power",
          "learning_objectives": [
            {
              "id": "Unit 4: Learning Objective H",
              "summary": "Explain the causes and effects of continuing policy debates about the role of the federal government from 1800 to 1848."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-4.1.I.C",
              "summary": "By the 1820s and 1830s, new political parties arose—the Democrats, led by Andrew Jackson, and the Whigs, led by Henry Clay—that disagreed about the role and powers of the federal government."
            },
            {
              "id": "KC-4.3.I.B",
              "summary": "Frontier settlers tended to champion expansion efforts, while American Indian resistance led to a sequence of wars and federal efforts to control and relocate American Indian populations."
            }
          ]
        },
        {
          "topic_number": "4.9",
          "topic_title": "The Development of an American Culture",
          "learning_objectives": [
            {
              "id": "Unit 4: Learning Objective I",
              "summary": "Explain how and why a new national culture developed from 1800 to 1848."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-4.1.II.B",
              "summary": "A new national culture emerged that combined American elements, European influences, and regional cultural sensibilities."
            },
            {
              "id": "KC-4.1.II.C",
              "summary": "Liberal social ideas from abroad and Romantic beliefs in human perfectibility influenced literature, art, philosophy, and architecture."
            }
          ]
        },
        {
          "topic_number": "4.10",
          "topic_title": "The Second Great Awakening",
          "learning_objectives": [
            {
              "id": "Unit 4: Learning Objective J",
              "summary": "Explain the causes of the Second Great Awakening."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-4.1.II.A.i",
              "summary": "The rise of democratic and individualistic beliefs, a response to rationalism, and changes caused by the market revolution, along with greater social mobility, contributed to a Second Great Awakening among Protestants."
            }
          ]
        },
        {
          "topic_number": "4.11",
          "topic_title": "An Age of Reform",
          "learning_objectives": [
            {
              "id": "Unit 4: Learning Objective K",
              "summary": "Explain how and why various reform movements developed and expanded from 1800 to 1848."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-4.1.II.A.ii",
              "summary": "The Second Great Awakening influenced moral and social reforms and inspired utopian and other religious movements."
            },
            {
              "id": "KC-4.1.III.A",
              "summary": "Americans formed new voluntary organizations that aimed to change individual behaviors and improve society through temperance and other reform efforts."
            },
            {
              "id": "KC-4.1.III.B.i",
              "summary": "Abolitionist and antislavery movements gradually achieved emancipation in the North, contributing to the growth of the free African American population, even as many states restricted African Americans’ rights."
            },
            {
              "id": "KC-4.3.II.B.i",
              "summary": "Antislavery movements increased in the North."
            },
            {
              "id": "KC-4.1.III.C",
              "summary": "A women’s rights movement sought greater equality and opportunities, expressing its ideals at the Seneca Falls Convention. Arguments emerged over whether to narrow the goals to white women."
            }
          ]
        },
        {
          "topic_number": "4.12",
          "topic_title": "African Americans in the Early Republic",
          "learning_objectives": [
            {
              "id": "Unit 4: Learning Objective L",
              "summary": "Explain the continuities and changes in the experience of African Americans from 1800 to 1848."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-4.1.III.B.ii",
              "summary": "Antislavery efforts in the South were largely limited to unsuccessful rebellions by enslaved people."
            },
            {
              "id": "KC-4.1.II.D",
              "summary": "Enslaved blacks and free African Americans created communities and strategies to protect their dignity and family structures, and they joined political efforts aimed at changing their status."
            }
          ]
        },
        {
          "topic_number": "4.13",
          "topic_title": "The Society of the South in the Early Republic",
          "learning_objectives": [
            {
              "id": "Unit 4: Learning Objective M",
              "summary": "Explain how geographic and environmental factors shaped the development of the South from 1800 to 1848."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-4.3.II.B.ii",
              "summary": "In the South, although the majority of Southerners owned no enslaved persons, most leaders argued that slavery was part of the Southern way of life."
            },
            {
              "id": "KC-4.2.III.C",
              "summary": "Southern business leaders continued to rely on the production and export of traditional agricultural staples, contributing to the growth of a distinctive Southern regional identity."
            },
            {
              "id": "KC-4.3.II.A",
              "summary": "As overcultivation depleted arable land in the Southeast, slaveholders began relocating their plantations to more fertile lands west of the Appalachians, where slavery continued to grow."
            }
          ]
        },
        {
          "topic_number": "4.14",
          "topic_title": "Causation in Period 4",
          "learning_objectives": [
            {
              "id": "Unit 4: Learning Objective N",
              "summary": "Explain the extent to which politics, economics, and foreign policy promoted the development of American identity from 1800 to 1848."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-4.1",
              "summary": "The United States began to develop a modern democracy and celebrated a new national culture, while Americans sought to define the nation’s democratic ideals and change their society and institutions to match them."
            },
            {
              "id": "KC-4.1.I",
              "summary": "The nation’s transition to a more participatory democracy was achieved by expanding suffrage from property-based to all adult white men, accompanied by the growth of political parties."
            },
            {
              "id": "KC-4.1.II",
              "summary": "While Americans embraced a new national culture, various groups developed distinctive cultures of their own."
            },
            {
              "id": "KC-4.1.III",
              "summary": "Increasing numbers of Americans, inspired by new religious and intellectual movements, worked primarily outside of government institutions to advance their ideals."
            },
            {
              "id": "KC-4.2",
              "summary": "Innovations in technology, agriculture, and commerce powerfully accelerated the American economy, precipitating profound changes to U.S. society and to national and regional identities."
            },
            {
              "id": "KC-4.2.I",
              "summary": "New transportation systems and technologies dramatically expanded manufacturing and agricultural production."
            },
            {
              "id": "KC-4.2.II",
              "summary": "The changes caused by the market revolution had significant effects on U.S. society, workers’ lives, and gender and family relations."
            },
            {
              "id": "KC-4.2.III",
              "summary": "Economic development shaped settlement and trade patterns, helping to unify the nation while also encouraging the growth of different regions."
            },
            {
              "id": "KC-4.3",
              "summary": "The U.S. interest in increasing foreign trade and expanding its national borders shaped the nation’s foreign policy and spurred government and private initiatives."
            },
            {
              "id": "KC-4.3.I",
              "summary": "Struggling to create an independent global presence, the United States sought to claim territory throughout the North American continent and promote foreign trade."
            },
            {
              "id": "KC-4.3.II",
              "summary": "The United States’ acquisition of lands in the West gave rise to contests over the extension of slavery into new territories."
            }
          ]
        }
      ]
    },
    {
      "unit_number": 5,
      "unit_title": "Period 5: 1844-1877",
      "ced_class_periods": "~17 Class Periods",
      "exam_weight": "10-17%",
      "topics": [
        {
          "topic_number": "5.1",
          "topic_title": "Contextualizing Period 5",
          "learning_objectives": [
            {
              "id": "Unit 5: Learning Objective A",
              "summary": "Explain the context in which sectional conflict emerged from 1844 to 1877."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-5.1",
              "summary": "The United States became more connected with the world, pursued an expansionist foreign policy in the Western Hemisphere, and emerged as the destination for many migrants from other countries."
            },
            {
              "id": "KC-5.1.I",
              "summary": "Popular enthusiasm for U.S. expansion, bolstered by economic and security interests, resulted in the acquisition of new territories, substantial migration westward, and new overseas initiatives."
            },
            {
              "id": "KC-5.1.II",
              "summary": "In the 1840s and 1850s, Americans continued to debate questions about rights and citizenship for various groups of U.S. inhabitants."
            },
            {
              "id": "KC-5.2",
              "summary": "Intensified by expansion and deepening regional divisions, debates over slavery and other economic, cultural, and political issues led the nation into civil war."
            },
            {
              "id": "KC-5.2.I",
              "summary": "Ideological and economic differences over slavery produced an array of diverging responses from Americans in the North and the South."
            },
            {
              "id": "KC-5.2.II",
              "summary": "Debates over slavery came to dominate political discussion in the 1850s, culminating in the bitter election of 1860 and the secession of Southern states."
            },
            {
              "id": "KC-5.3",
              "summary": "The Union victory in the Civil War and the contested reconstruction of the South settled the issues of slavery and secession, but left unresolved many questions about the power of the federal government and citizenship rights."
            },
            {
              "id": "KC-5.3.I",
              "summary": "The North’s greater manpower and industrial resources, the leadership of Abraham Lincoln, and the decision to emancipate enslaved people eventually led to the Union military victory over the Confederacy."
            },
            {
              "id": "KC-5.3.II.i",
              "summary": "Reconstruction and the Civil War ended slavery, altered relationships between the states and the federal government, and led to debates over new definitions of citizenship, particularly regarding the rights of African Americans, women, and other minorities."
            }
          ]
        },
        {
          "topic_number": "5.2",
          "topic_title": "Manifest Destiny",
          "learning_objectives": [
            {
              "id": "Unit 5: Learning Objective B",
              "summary": "Explain the causes and effects of westward expansion from 1844 to 1877."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-5.1.I.A",
              "summary": "The desire for access to natural and mineral resources and the hope for economic opportunities or religious refuge led to an increased migration to and settlement in the West."
            },
            {
              "id": "KC-5.1.I.B",
              "summary": "Advocates argued that Manifest Destiny and the superiority of American institutions compelled the United States to expand its borders westward to the Pacific Ocean, frequently provoking competition and violent conflict."
            },
            {
              "id": "KC-5.1.I.D",
              "summary": "Westward migration was boosted during and after the Civil War by new legislation promoting western transportation and economic development."
            },
            {
              "id": "KC-5.1.I.E",
              "summary": "U.S. interest in expanding trade led to economic, diplomatic, and cultural initiatives to create more ties with Asia."
            }
          ]
        },
        {
          "topic_number": "5.3",
          "topic_title": "The Mexican-American War",
          "learning_objectives": [
            {
              "id": "Unit 5: Learning Objective C",
              "summary": "Explain the causes and effects of the Mexican-American War."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-5.1.I.C",
              "summary": "The United States added large territories in the West through victory in the Mexican-American War and diplomatic negotiations, raising questions about the status of slavery, American Indians, and Mexicans in the newly acquired lands."
            },
            {
              "id": "KC-5.1.II.C",
              "summary": "U.S. government interaction and conflict with Mexican Americans and American Indians increased in regions newly taken from them, altering these groups’ economic self-sufficiency and cultures."
            }
          ]
        },
        {
          "topic_number": "5.4",
          "topic_title": "The Compromise of 1850",
          "learning_objectives": [
            {
              "id": "Unit 5: Learning Objective D",
              "summary": "Explain the similarities and differences in how regional attitudes affected federal policy in the period after the Mexican-American War."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-5.2.II.A",
              "summary": "The Mexican Cession led to heated controversies over whether to allow slavery in the newly acquired territories."
            },
            {
              "id": "KC-5.2.II.B.i",
              "summary": "The courts and national leaders made a variety of attempts to resolve the issue of slavery in the territories, including the Compromise of 1850."
            }
          ]
        },
        {
          "topic_number": "5.5",
          "topic_title": "Sectional Conflict: Regional Differences",
          "learning_objectives": [
            {
              "id": "Unit 5: Learning Objective E",
              "summary": "Explain the effects of immigration from various parts of the world on American culture from 1844 to 1877."
            },
            {
              "id": "Unit 5: Learning Objective F",
              "summary": "Explain how regional differences related to slavery caused tension in the years leading up to the Civil War."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-5.1.II.A",
              "summary": "Substantial numbers of international migrants continued to arrive from Europe and Asia, mainly from Ireland and Germany, often settling in ethnic communities where they could preserve elements of their languages and customs."
            },
            {
              "id": "KC-5.1.II.B",
              "summary": "A strongly anti-Catholic nativist movement arose that was aimed at limiting new immigrants’ political power and cultural influence."
            },
            {
              "id": "KC-5.2.I.A",
              "summary": "The North’s expanding manufacturing economy relied on free labor, in contrast to the Southern economy’s dependence on enslaved labor. A free-soil movement arose that portrayed the expansion of slavery as incompatible with free labor."
            },
            {
              "id": "KC-5.2.I.B",
              "summary": "African American and white abolitionists mounted a highly visible campaign against slavery, presenting moral arguments, assisting escapes, and sometimes expressing a willingness to use violence."
            },
            {
              "id": "KC-5.2.I.C",
              "summary": "Defenders of slavery based their arguments on racial doctrines, the view that slavery was a positive social good, and the belief that slavery and states’ rights were protected by the Constitution."
            }
          ]
        },
        {
          "topic_number": "5.6",
          "topic_title": "Failure of Compromise",
          "learning_objectives": [
            {
              "id": "Unit 5: Learning Objective G",
              "summary": "Explain the political causes of the Civil War."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-5.2.II.B.ii",
              "summary": "Attempts to resolve the issue of slavery in the territories, including the Kansas-Nebraska Act and the Dred Scott decision, ultimately failed to reduce conflict."
            },
            {
              "id": "KC-5.2.II.C",
              "summary": "The Second Party System ended when issues of slavery and anti-immigrant nativism weakened loyalties and fostered the emergence of sectional parties, most notably the Republican Party in the North."
            }
          ]
        },
        {
          "topic_number": "5.7",
          "topic_title": "Election of 1860 and Secession",
          "learning_objectives": [
            {
              "id": "Unit 5: Learning Objective H",
              "summary": "Describe the effects of Lincoln’s election."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-5.2.II.D",
              "summary": "Abraham Lincoln’s victory on the Republicans’ free-soil platform in 1860, without any Southern electoral votes, led most slave states to secede from the Union, precipitating the Civil War."
            }
          ]
        },
        {
          "topic_number": "5.8",
          "topic_title": "Military Conflict in the Civil War",
          "learning_objectives": [
            {
              "id": "Unit 5: Learning Objective I",
              "summary": "Explain the various factors that contributed to the Union victory in the Civil War."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-5.3.I.A",
              "summary": "Both the Union and the Confederacy mobilized their economies and societies to wage the war even while facing considerable home front opposition."
            },
            {
              "id": "KC-5.3.I.D",
              "summary": "Although the Confederacy showed military initiative early in the war, the Union ultimately succeeded due to improvements in leadership and strategy, key victories, greater resources, and the wartime destruction of the South’s infrastructure."
            }
          ]
        },
        {
          "topic_number": "5.9",
          "topic_title": "Government Policies During the Civil War",
          "learning_objectives": [
            {
              "id": "Unit 5: Learning Objective J",
              "summary": "Explain how Lincoln’s leadership during the Civil War impacted American ideals over the course of the war."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-5.3.I.B",
              "summary": "Lincoln began the war to preserve the Union, but the Emancipation Proclamation reframed the purpose of the war and helped prevent Confederate diplomatic support from Europe. Many African Americans fled plantations and enlisted in the Union Army."
            },
            {
              "id": "KC-5.3.I.C",
              "summary": "Lincoln sought to reunify the country and used speeches like the Gettysburg Address to portray the struggle against slavery as the fulfillment of America’s founding democratic ideals."
            }
          ]
        },
        {
          "topic_number": "5.10",
          "topic_title": "Reconstruction",
          "learning_objectives": [
            {
              "id": "Unit 5: Learning Objective K",
              "summary": "Explain the effects of government policy during Reconstruction on society from 1865 to 1877."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-5.3.II.ii",
              "summary": "Reconstruction altered relationships between the states and the federal government and led to debates over new definitions of citizenship, particularly regarding the rights of African Americans, women, and other minorities."
            },
            {
              "id": "KC-5.3.II.A",
              "summary": "The 13th Amendment abolished slavery, while the 14th and 15th amendments granted African Americans citizenship, equal protection under the laws, and voting rights."
            },
            {
              "id": "KC-5.3.II.B",
              "summary": "The women’s rights movement was both emboldened and divided over the 14th and 15th amendments to the Constitution."
            },
            {
              "id": "KC-5.3.II.C",
              "summary": "Republican efforts to change the balance of power and reorder race relations in the South yielded short-term successes but ultimately failed, due both to determined Southern resistance and the North’s waning resolve."
            }
          ]
        },
        {
          "topic_number": "5.11",
          "topic_title": "Failure of Reconstruction",
          "learning_objectives": [
            {
              "id": "Unit 5: Learning Objective L",
              "summary": "Explain how and why Reconstruction resulted in continuity and change in regional and national understandings of what it meant to be American."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-5.3.II.D",
              "summary": "Southern plantation owners continued to own the majority of the region’s land. Formerly enslaved persons sought land ownership but an exploitative sharecropping system limited their and poor whites' access to land."
            },
            {
              "id": "KC-5.3.II.E",
              "summary": "Segregation, violence, Supreme Court decisions, and local political tactics progressively stripped away African American rights, but the 14th and 15th amendments eventually became the basis for court decisions upholding civil rights in the 20th century."
            }
          ]
        },
        {
          "topic_number": "5.12",
          "topic_title": "Comparison in Period 5",
          "learning_objectives": [
            {
              "id": "Unit 5: Learning Objective M",
              "summary": "Compare the relative significance of the effects of the Civil War on American values."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-5.1",
              "summary": "The United States became more connected with the world, pursued an expansionist foreign policy in the Western Hemisphere, and emerged as the destination for many migrants from other countries."
            },
            {
              "id": "KC-5.1.I",
              "summary": "Popular enthusiasm for U.S. expansion, bolstered by economic and security interests, resulted in the acquisition of new territories, substantial migration westward, and new overseas initiatives."
            },
            {
              "id": "KC-5.1.II",
              "summary": "In the 1840s and 1850s, Americans continued to debate questions about rights and citizenship for various groups of U.S. inhabitants."
            },
            {
              "id": "KC-5.2",
              "summary": "Intensified by expansion and deepening regional divisions, debates over slavery and other economic, cultural, and political issues led the nation into civil war."
            },
            {
              "id": "KC-5.2.I",
              "summary": "Ideological and economic differences over slavery produced an array of diverging responses from Americans in the North and the South."
            },
            {
              "id": "KC-5.2.II",
              "summary": "Debates over slavery came to dominate political discussion in the 1850s, culminating in the bitter election of 1860 and the secession of Southern states."
            },
            {
              "id": "KC-5.3",
              "summary": "The Union victory in the Civil War and the contested reconstruction of the South settled the issues of slavery and secession, but left unresolved many questions about the power of the federal government and citizenship rights."
            },
            {
              "id": "KC-5.3.I",
              "summary": "The North’s greater manpower and industrial resources, the leadership of Abraham Lincoln, and the decision to emancipate enslaved people eventually led to the Union military victory over the Confederacy."
            },
            {
              "id": "KC-5.3.II.i",
              "summary": "Reconstruction and the Civil War ended slavery, altered relationships between the states and the federal government, and led to debates over new definitions of citizenship, particularly regarding the rights of African Americans, women, and other minorities."
            }
          ]
        }
      ]
    },
    {
      "unit_number": 6,
      "unit_title": "Period 6: 1865-1898",
      "ced_class_periods": "~18 Class Periods",
      "exam_weight": "10-17%",
      "topics": [
        {
          "topic_number": "6.1",
          "topic_title": "Contextualizing Period 6",
          "learning_objectives": [
            {
              "id": "Unit 6: Learning Objective A",
              "summary": "Explain the historical context for the rise of industrial capitalism in the United States."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-6.1",
              "summary": "Technological advances, large-scale production methods, and the opening of new markets encouraged the rise of industrial capitalism in the United States."
            },
            {
              "id": "KC-6.1.I",
              "summary": "Large-scale industrial production—accompanied by massive technological change, expanding international communication networks, and pro-growth government policies—generated rapid economic development and business consolidation."
            },
            {
              "id": "KC-6.1.II",
              "summary": "A variety of perspectives on the economy and labor developed during a time of financial panics and downturns."
            },
            {
              "id": "KC-6.1.III",
              "summary": "New systems of production and transportation enabled consolidation within agriculture, which, along with periods of instability, spurred a variety of responses from farmers."
            },
            {
              "id": "KC-6.2",
              "summary": "The migrations that accompanied industrialization transformed both urban and rural areas of the United States and caused dramatic social and cultural change."
            },
            {
              "id": "KC-6.2.I",
              "summary": "International and internal migration increased urban populations and fostered the growth of a new urban culture."
            },
            {
              "id": "KC-6.2.II",
              "summary": "Larger numbers of migrants moved to the West in search of land and economic opportunity, frequently provoking competition and violent conflict."
            },
            {
              "id": "KC-6.3",
              "summary": "The Gilded Age produced new cultural and intellectual movements, public reform efforts, and political debates over economic and social policies."
            },
            {
              "id": "KC-6.3.I",
              "summary": "New cultural and intellectual movements both buttressed and challenged the social order of the Gilded Age."
            },
            {
              "id": "KC-6.3.II",
              "summary": "Dramatic social changes in the period inspired political debates over citizenship, corruption, and the proper relationship between business and government."
            }
          ]
        },
        {
          "topic_number": "6.2",
          "topic_title": "Westward Expansion: Economic Development",
          "learning_objectives": [
            {
              "id": "Unit 6: Learning Objective B",
              "summary": "Explain the causes and effects of the settlement of the West from 1877 to 1898."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-6.1.III.A",
              "summary": "Improvements in mechanization helped agricultural production increase substantially and contributed to declines in food prices."
            },
            {
              "id": "KC-6.1.III.B",
              "summary": "Many farmers responded to increasing consolidation in agricultural markets and their dependence on the railroad system by creating local and regional cooperative organizations."
            },
            {
              "id": "KC-6.1.I.A",
              "summary": "Following the Civil War, government subsidies for transportation and communication systems helped open new markets in North America."
            },
            {
              "id": "KC-6.2.II.A",
              "summary": "The building of transcontinental railroads, the discovery of mineral resources, and government policies promoted economic growth and created new communities and centers of commercial activity."
            }
          ]
        },
        {
          "topic_number": "6.3",
          "topic_title": "Westward Expansion: Social and Cultural Development",
          "learning_objectives": [
            {
              "id": "Unit 6: Learning Objective B",
              "summary": "Explain the causes and effects of the settlement of the West from 1877 to 1898."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-6.2.II.B",
              "summary": "In hopes of achieving self-sufficiency and independence, migrants moved to rural and boomtown areas of the West for opportunities, such as building railroads, mining, farming, and ranching."
            },
            {
              "id": "KC-6.2.II.C",
              "summary": "As migrant populations increased and the American bison population was decimated, competition for land and resources in the West among white settlers, American Indians, and Mexican Americans led to an increase in violent conflict."
            },
            {
              "id": "KC-6.2.II.D",
              "summary": "The U.S. government violated treaties with American Indians and responded to resistance with military force, eventually confining them to reservations and denying tribal sovereignty."
            },
            {
              "id": "KC-6.2.II.E",
              "summary": "Many American Indians preserved their cultures and tribal identities despite government policies promoting assimilation, and they attempted to develop self-sustaining economic practices."
            }
          ]
        },
        {
          "topic_number": "6.4",
          "topic_title": "The “New South”",
          "learning_objectives": [
            {
              "id": "Unit 6: Learning Objective C",
              "summary": "Explain how various factors contributed to continuity and change in the “New South” from 1877 to 1898."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-6.1.II.D",
              "summary": "Despite the industrialization of some segments of the Southern economy—a change promoted by leaders who called for a “New South”—agriculture based on sharecropping and tenant farming continued to be the primary economic activity."
            },
            {
              "id": "KC-6.3.II.C",
              "summary": "The Supreme Court decision in Plessy v. Ferguson that upheld racial segregation helped to mark the end of most political gains African Americans made during Reconstruction. Facing increased violence, discrimination, and scientific racism, African American reformers continued to fight for political and social equality."
            }
          ]
        },
        {
          "topic_number": "6.5",
          "topic_title": "Technological Innovation",
          "learning_objectives": [
            {
              "id": "Unit 6: Learning Objective D",
              "summary": "Explain the effects of technological advances in the development of the United States over time."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-6.1.I.B.i",
              "summary": "Businesses made use of technological innovations and greater access to natural resources to dramatically increase the production of goods."
            }
          ]
        },
        {
          "topic_number": "6.6",
          "topic_title": "The Rise of Industrial Capitalism",
          "learning_objectives": [
            {
              "id": "Unit 6: Learning Objective E",
              "summary": "Explain the socioeconomic continuities and changes associated with the growth of industrial capitalism from 1865 to 1898."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-6.1.I",
              "summary": "Large-scale industrial production, accompanied by massive technological change, expanding communication networks, and pro-growth government policies, generated rapid economic development and business consolidation."
            },
            {
              "id": "KC-6.1.I.B.ii",
              "summary": "Businesses used redesigned financial and management structures, marketing advances, and a growing labor force to dramatically increase production."
            },
            {
              "id": "KC-6.1.I.D",
              "summary": "Many business leaders sought increased profits by consolidating corporations into large trusts and holding companies, which further concentrated wealth."
            },
            {
              "id": "KC-6.1.I.E.i",
              "summary": "Businesses increasingly looked outside U.S. borders to gain greater influence and control over markets and natural resources in the Pacific Rim, Asia, and Latin America."
            }
          ]
        },
        {
          "topic_number": "6.7",
          "topic_title": "Labor in the Gilded Age",
          "learning_objectives": [
            {
              "id": "Unit 6: Learning Objective E",
              "summary": "Explain the socioeconomic continuities and changes associated with the growth of industrial capitalism from 1865 to 1898."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-6.1.I.C",
              "summary": "As the price of many goods decreased, workers’ real wages increased, providing new access to goods and services; many Americans’ standards of living improved, while the gap between rich and poor grew."
            },
            {
              "id": "KC-6.1.II.C",
              "summary": "Labor and management battled over wages and working conditions, with workers organizing local and national unions and/or directly confronting business leaders."
            },
            {
              "id": "KC-6.1.II.B.i",
              "summary": "The industrial workforce expanded and child labor increased."
            }
          ]
        },
        {
          "topic_number": "6.8",
          "topic_title": "Immigration and Migration in the Gilded Age",
          "learning_objectives": [
            {
              "id": "Unit 6: Learning Objective F",
              "summary": "Explain how cultural and economic factors affected migration patterns over time."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-6.1.II.B.ii",
              "summary": "The industrial workforce expanded and became more diverse through internal and international migration."
            },
            {
              "id": "KC-6.2.I.A",
              "summary": "As cities became areas of economic growth, they attracted immigrants from Asia and southern and eastern Europe, as well as African American migrants, all seeking to escape poverty, religious persecution, and limited social mobility."
            },
            {
              "id": "KC-6.2.I.B",
              "summary": "Urban neighborhoods based on particular ethnicities, races, and classes provided new cultural opportunities for city dwellers."
            }
          ]
        },
        {
          "topic_number": "6.9",
          "topic_title": "Responses to Immigration in the Gilded Age",
          "learning_objectives": [
            {
              "id": "Unit 6: Learning Objective G",
              "summary": "Explain the various responses to immigration in the period over time."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-6.2.I.C",
              "summary": "Increasing public debates over assimilation and Americanization accompanied the growth of international migration. Many immigrants negotiated compromises between their original cultures and the culture of the United States."
            },
            {
              "id": "KC-6.3.I.A",
              "summary": "Social commentators advocated theories later described as Social Darwinism to justify the success of those at the top of the socioeconomic structure as both appropriate and inevitable."
            },
            {
              "id": "KC-6.3.II.B.i",
              "summary": "Many women, like Jane Addams, worked in settlement houses to help immigrants adapt to U.S. language and customs."
            }
          ]
        },
        {
          "topic_number": "6.10",
          "topic_title": "Development of the Middle Class",
          "learning_objectives": [
            {
              "id": "Unit 6: Learning Objective H",
              "summary": "Explain the causes of increased economic opportunity and its effects on society."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-6.2.I.E",
              "summary": "Corporations’ need for managers and clerical workers, as well as increased access to educational institutions, fostered the growth of a distinctive middle class. A growing amount of leisure time also helped expand consumer culture."
            },
            {
              "id": "KC-6.3.I.B",
              "summary": "Some business leaders argued that the wealthy had a moral obligation to help the less fortunate and improve society, as articulated in the idea known as the Gospel of Wealth, and made philanthropic contributions."
            }
          ]
        },
        {
          "topic_number": "6.11",
          "topic_title": "Reform in the Gilded Age",
          "learning_objectives": [
            {
              "id": "Unit 6: Learning Objective I",
              "summary": "Explain how different reform movements responded to the rise of industrial capitalism in the Gilded Age."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-6.3.I.C",
              "summary": "A number of artists and critics, including agrarians, utopians, socialists, and advocates of the Social Gospel, championed alternative visions for the economy and U.S. society."
            },
            {
              "id": "KC-6.3.II.B.ii",
              "summary": "Many women sought greater equality with men, often joining voluntary organizations, going to college, and promoting social and political reform."
            }
          ]
        },
        {
          "topic_number": "6.12",
          "topic_title": "Controversies over the Role of Government in the Gilded Age",
          "learning_objectives": [
            {
              "id": "Unit 6: Learning Objective J",
              "summary": "Explain continuities and changes in the role of the government in the U.S. economy."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-6.1.II.A",
              "summary": "Some argued that laissez-faire policies and competition promoted economic growth in the long run, and they opposed government intervention during economic downturns."
            },
            {
              "id": "KC-6.1.I.E.ii",
              "summary": "Foreign policymakers increasingly looked outside U.S. borders to gain greater influence and control over markets and natural resources in the Pacific Rim, Asia, and Latin America."
            }
          ]
        },
        {
          "topic_number": "6.13",
          "topic_title": "Politics in the Gilded Age",
          "learning_objectives": [
            {
              "id": "Unit 6: Learning Objective K",
              "summary": "Explain the similarities and differences between the political parties during the Gilded Age."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-6.1.III.C",
              "summary": "Economic instability inspired agrarian activists to create the People’s (Populist) Party, which called for a stronger governmental role in regulating the American economic system."
            },
            {
              "id": "KC-6.3.II.A",
              "summary": "The major political parties appealed to lingering Civil War divisions and contended over tariffs and currency issues, even as reformers argued that economic greed and self-interest had corrupted all levels of government."
            },
            {
              "id": "KC-6.2.I.D",
              "summary": "In an urban atmosphere where access to power was unequally distributed, political machines thrived, in part by providing immigrants and the poor with social services."
            }
          ]
        },
        {
          "topic_number": "6.14",
          "topic_title": "Continuity and Change in Period 6",
          "learning_objectives": [
            {
              "id": "Unit 6: Learning Objective L",
              "summary": "Explain the extent to which industrialization brought change from 1865 to 1898."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-6.1",
              "summary": "Technological advances, large-scale production methods, and the opening of new markets encouraged the rise of industrial capitalism in the United States."
            },
            {
              "id": "KC-6.1.I",
              "summary": "Large-scale industrial production—accompanied by massive technological change, expanding international communication networks, and pro-growth government policies—generated rapid economic development and business consolidation."
            },
            {
              "id": "KC-6.1.II",
              "summary": "A variety of perspectives on the economy and labor developed during a time of financial panics and downturns."
            },
            {
              "id": "KC-6.1.III",
              "summary": "New systems of production and transportation enabled consolidation within agriculture, which, along with periods of instability, spurred a variety of responses from farmers."
            },
            {
              "id": "KC-6.2",
              "summary": "The migrations that accompanied industrialization transformed both urban and rural areas of the United States and caused dramatic social and cultural change."
            },
            {
              "id": "KC-6.2.I",
              "summary": "International and internal migration increased urban populations and fostered the growth of a new urban culture."
            },
            {
              "id": "KC-6.2.II",
              "summary": "Larger numbers of migrants moved to the West in search of land and economic opportunity, frequently provoking competition and violent conflict."
            },
            {
              "id": "KC-6.3",
              "summary": "The Gilded Age produced new cultural and intellectual movements, public reform efforts, and political debates over economic and social policies."
            },
            {
              "id": "KC-6.3.I",
              "summary": "New cultural and intellectual movements both buttressed and challenged the social order of the Gilded Age."
            },
            {
              "id": "KC-6.3.II",
              "summary": "Dramatic social changes in the period inspired political debates over citizenship, corruption, and the proper relationship between business and government."
            }
          ]
        }
      ]
    },
    {
      "unit_number": 7,
      "unit_title": "Period 7: 1890-1945",
      "ced_class_periods": "~21 Class Periods",
      "exam_weight": "10-17%",
      "topics": [
        {
          "topic_number": "7.1",
          "topic_title": "Contextualizing Period 7",
          "learning_objectives": [
            {
              "id": "Unit 7: Learning Objective A",
              "summary": "Explain the context in which America grew into its role as a world power."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-7.1",
              "summary": "Growth expanded opportunity, while economic instability led to new efforts to reform U.S. society and its economic system."
            },
            {
              "id": "KC-7.1.I",
              "summary": "The United States continued its transition from a rural, agricultural economy to an urban, industrial economy led by large companies."
            },
            {
              "id": "KC-7.1.II",
              "summary": "In the Progressive Era, Progressives responded to political corruption, economic instability, and social concerns by calling for greater government action and other political and social measures."
            },
            {
              "id": "KC-7.1.III",
              "summary": "During the 1930s, policymakers responded to the Great Depression by transforming the U.S. into a limited welfare state, redefining the goals and ideas of modern American liberalism."
            },
            {
              "id": "KC-7.2",
              "summary": "Innovations in communications and technology contributed to the growth of mass culture, while significant changes occurred in internal and international migration patterns."
            },
            {
              "id": "KC-7.2.I",
              "summary": "Popular culture grew in influence, even as debates increased over the effects of culture on public values, morals, and American national identity."
            },
            {
              "id": "KC-7.2.II",
              "summary": "Economic pressures, global events, and political developments caused sharp variations in the numbers, sources, and experiences of both international and internal migrants."
            },
            {
              "id": "KC-7.3",
              "summary": "Participation in a series of global conflicts propelled the United States into a position of international power while renewing domestic debates over the nation’s proper role in the world."
            },
            {
              "id": "KC-7.3.I",
              "summary": "New U.S. territorial ambitions and acquisitions in the Western Hemisphere and the Pacific accompanied heightened public debates over America’s role in the world."
            },
            {
              "id": "KC-7.3.II",
              "summary": "World War I and its aftermath intensified ongoing debates about the nation’s role in the world and how best to achieve national security and pursue American interests."
            },
            {
              "id": "KC-7.3.III",
              "summary": "U.S. participation in World War II transformed American society, while the Allied victory vaulted the U.S. into a position of global, political, and military leadership."
            }
          ]
        },
        {
          "topic_number": "7.2",
          "topic_title": "Imperialism: Debates",
          "learning_objectives": [
            {
              "id": "Unit 7: Learning Objective B",
              "summary": "Explain the similarities and differences in attitudes about the nation’s proper role in the world."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-7.3.I.A",
              "summary": "Imperialists cited economic opportunities, racial theories, competition with European empires, and the perception of a “closed” western frontier to argue for American expansion."
            },
            {
              "id": "KC-7.3.I.B",
              "summary": "Anti-imperialists cited principles of self-determination, racial theories, and the U.S. foreign policy tradition of isolationism to argue against extending U.S. territory overseas."
            }
          ]
        },
        {
          "topic_number": "7.3",
          "topic_title": "The Spanish-American War",
          "learning_objectives": [
            {
              "id": "Unit 7: Learning Objective C",
              "summary": "Explain the effects of the Spanish-American War."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-7.3.I.C",
              "summary": "The American victory in the Spanish-American War led to the U.S. acquisition of island territories in the Caribbean and the Pacific, an increase in involvement in Asia, and the suppression of a nationalist movement in the Philippines."
            }
          ]
        },
        {
          "topic_number": "7.4",
          "topic_title": "The Progressives",
          "learning_objectives": [
            {
              "id": "Unit 7: Learning Objective D",
              "summary": "Compare the goals and effects of the Progressive reform movement."
            },
            {
              "id": "Unit 7: Learning Objective E",
              "summary": "Compare attitudes toward the use of natural resources from 1890 to 1945."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-7.1.II.A",
              "summary": "Progressive Era journalists attacked political corruption, social injustice, and economic inequality, while reformers, often from the middle and upper classes, worked to effect social changes in cities."
            },
            {
              "id": "KC-7.1.II.D",
              "summary": "The Progressives were divided over many issues, including Southern segregation, popular participation in government versus reliance on experts, and immigration restriction."
            },
            {
              "id": "KC-7.1.II.B",
              "summary": "On the national level, Progressives sought federal legislation to regulate the economy, expand democracy, and generate moral reform, including amendments for prohibition and women’s suffrage."
            },
            {
              "id": "KC-7.1.II.C",
              "summary": "Preservationists and conservationists both supported the establishment of national parks while advocating different government responses to the overuse of natural resources."
            }
          ]
        },
        {
          "topic_number": "7.5",
          "topic_title": "World War I: Military and Diplomacy",
          "learning_objectives": [
            {
              "id": "Unit 7: Learning Objective F",
              "summary": "Explain the causes and consequences of U.S. involvement in World War I."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-7.3.II.A",
              "summary": "After initial neutrality, the nation entered World War I in response to Woodrow Wilson’s call for the defense of humanitarian and democratic principles, departing from the tradition of noninvolvement in European affairs."
            },
            {
              "id": "KC-7.3.II.B",
              "summary": "Although the American Expeditionary Forces played a relatively limited role in combat, the United States’ entry helped to tip the balance of the conflict in favor of the Allies."
            },
            {
              "id": "KC-7.3.II.C",
              "summary": "Despite Wilson’s deep involvement in postwar negotiations, the U.S. Senate refused to ratify the Treaty of Versailles or join the League of Nations."
            }
          ]
        },
        {
          "topic_number": "7.6",
          "topic_title": "World War I: Home Front",
          "learning_objectives": [
            {
              "id": "Unit 7: Learning Objective G",
              "summary": "Explain the causes and effects of international and internal migration patterns over time."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-7.2.I.C",
              "summary": "Official restrictions on freedom of speech grew during World War I, as increased anxiety about radicalism led to a Red Scare and attacks on labor activism and immigrant culture."
            },
            {
              "id": "KC-7.2.II.A.i",
              "summary": "During World War I, nativist campaigns led to the passage of quotas that restricted immigration, particularly from southern and eastern Europe, and increased barriers to Asian immigration."
            },
            {
              "id": "KC-7.2.II.B.i",
              "summary": "The increased demand for war production and labor during World War I led many Americans to migrate to urban centers in search of economic opportunities."
            },
            {
              "id": "KC-7.2.II.C",
              "summary": "In the Great Migration, African Americans escaping segregation, racial violence, and limited economic opportunity in the South moved to the North and West, where they found new opportunities but still encountered discrimination."
            }
          ]
        },
        {
          "topic_number": "7.7",
          "topic_title": "1920s: Innovations in Communication and Technology",
          "learning_objectives": [
            {
              "id": "Unit 7: Learning Objective H",
              "summary": "Explain the causes and effects of the innovations in communication and technology in the United States over time."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-7.1.I.A",
              "summary": "New technologies and manufacturing techniques helped focus the U.S. economy on the production of consumer goods, contributing to improved standards of living, greater personal mobility, and better communications systems."
            },
            {
              "id": "KC-7.2.I.A",
              "summary": "New forms of mass media, such as radio and cinema, contributed to the spread of national culture as well as greater awareness of regional cultures."
            }
          ]
        },
        {
          "topic_number": "7.8",
          "topic_title": "1920s: Cultural and Political Controversies",
          "learning_objectives": [
            {
              "id": "Unit 7: Learning Objective G",
              "summary": "Explain the causes and effects of international and internal migration patterns over time."
            },
            {
              "id": "Unit 7: Learning Objective I",
              "summary": "Explain the causes and effects of developments in popular culture in the United States over time."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-7.1.I.B",
              "summary": "By 1920, a majority of the U.S. population lived in urban centers, which offered new economic opportunities for women, international migrants, and internal migrants."
            },
            {
              "id": "KC-7.2.II.A.ii",
              "summary": "After World War I, nativist campaigns led to the passage of quotas that restricted immigration, particularly from southern and eastern Europe, and increased barriers to Asian immigration."
            },
            {
              "id": "KC-7.2.I.B",
              "summary": "Migration gave rise to new forms of art and literature that expressed ethnic and regional identities, such as the Harlem Renaissance movement."
            },
            {
              "id": "KC-7.2.I.D",
              "summary": "In the 1920s, cultural and political controversies emerged as Americans debated gender roles, modernism, science, religion, and issues related to race and immigration."
            }
          ]
        },
        {
          "topic_number": "7.9",
          "topic_title": "The Great Depression",
          "learning_objectives": [
            {
              "id": "Unit 7: Learning Objective J",
              "summary": "Explain the causes of the Great Depression and its effects on the economy."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-7.1.I",
              "summary": "The United States continued its transition from a rural, agricultural economy to an urban, industrial economy led by large companies."
            },
            {
              "id": "KC-7.1.I.C",
              "summary": "Episodes of credit and market instability, in particular the Great Depression, led to calls for a stronger financial regulatory system."
            },
            {
              "id": "KC-7.1.III",
              "summary": "During the 1930s, policymakers responded to the Great Depression by transforming the U.S. into a limited welfare state, redefining the goals and ideas of modern American liberalism."
            }
          ]
        },
        {
          "topic_number": "7.10",
          "topic_title": "The New Deal",
          "learning_objectives": [
            {
              "id": "Unit 7: Learning Objective K",
              "summary": "Explain how the Great Depression and the New Deal impacted American political, social, and economic life over time."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-7.1.III.A",
              "summary": "Franklin Roosevelt’s New Deal attempted to end the Great Depression by using government power to provide relief to the poor, stimulate recovery, and reform the American economy."
            },
            {
              "id": "KC-7.1.III.B",
              "summary": "Radical, union, and populist movements pushed Roosevelt toward more extensive efforts to change the American economic system, while conservatives in Congress and the Supreme Court sought to limit the New Deal’s scope."
            },
            {
              "id": "KC-7.1.III.C",
              "summary": "Although the New Deal did not end the Depression, it left a legacy of reforms and regulatory agencies and fostered a long-term political realignment in which many ethnic groups, African Americans, and working-class communities identified with the Democratic Party."
            },
            {
              "id": "KC-7.2.II.B.ii",
              "summary": "The increased demand for war production and labor during World War II and the economic difficulties of the 1930s led many Americans to migrate to urban centers in search of economic opportunities."
            }
          ]
        },
        {
          "topic_number": "7.11",
          "topic_title": "Interwar Foreign Policy",
          "learning_objectives": [
            {
              "id": "Unit 7: Learning Objective B",
              "summary": "Explain the similarities and differences in attitudes about the nation’s proper role in the world."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-7.3.II.D",
              "summary": "In the years following World War I, the United States pursued a unilateral foreign policy that used international investment, peace treaties, and select military intervention to promote an international order, even while maintaining U.S. isolationism."
            },
            {
              "id": "KC-7.3.II.E",
              "summary": "In the 1930s, most Americans opposed taking military action against the aggression of Nazi Germany and Japan until the Japanese attack on Pearl Harbor drew the United States into World War II."
            }
          ]
        },
        {
          "topic_number": "7.12",
          "topic_title": "World War II: Mobilization",
          "learning_objectives": [
            {
              "id": "Unit 7: Learning Objective L",
              "summary": "Explain how and why U.S. participation in World War II transformed American society."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-7.3.III.B",
              "summary": "The mass mobilization of American society helped end the Great Depression, and the country’s strong industrial base played a pivotal role in winning the war by equipping and provisioning allies and millions of U.S. troops."
            },
            {
              "id": "KC-7.3.III.C.i",
              "summary": "Mobilization provided opportunities for women and minorities to improve their socioeconomic positions for the war’s duration, while also leading to debates over racial segregation and challenges to civil liberties, such as the internment of Japanese Americans."
            },
            {
              "id": "KC-7.2.II.D",
              "summary": "Migration to the United States from Mexico and elsewhere in the Western Hemisphere increased, in spite of contradictory government policies toward Mexican immigration."
            }
          ]
        },
        {
          "topic_number": "7.13",
          "topic_title": "World War II: Military",
          "learning_objectives": [
            {
              "id": "Unit 7: Learning Objective M",
              "summary": "Explain the causes and effects of the victory of the United States and its allies over the Axis powers."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-7.3.III.A",
              "summary": "Americans viewed the war as a fight for the survival of freedom and democracy against fascist and militarist ideologies, a perspective later reinforced by revelations about Japanese wartime atrocities, Nazi concentration camps, and the Holocaust."
            },
            {
              "id": "KC-7.3.III.C.ii",
              "summary": "Military service provided opportunities for women and minorities to improve their socioeconomic positions for the war’s duration, while also leading to debates over racial segregation."
            },
            {
              "id": "KC-7.3.III.D",
              "summary": "The U.S. and its allies achieved military victory through cooperation, technological advances, contributions of service members, and campaigns like island-hopping and D-Day. The use of atomic bombs hastened the end of the war and sparked moral debates."
            }
          ]
        },
        {
          "topic_number": "7.14",
          "topic_title": "Postwar Diplomacy",
          "learning_objectives": [
            {
              "id": "Unit 7: Learning Objective N",
              "summary": "Explain the consequences of U.S. involvement in World War II."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-7.3.III.E",
              "summary": "The war-ravaged condition of Asia and Europe, and the dominant U.S. role in the Allied victory and postwar peace settlements, allowed the United States to emerge from the war as the most powerful nation on Earth."
            }
          ]
        },
        {
          "topic_number": "7.15",
          "topic_title": "Comparison in Period 7",
          "learning_objectives": [
            {
              "id": "Unit 7: Learning Objective O",
              "summary": "Compare the relative significance of the major events of the first half of the 20th century in shaping American identity."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-7.1",
              "summary": "Growth expanded opportunity, while economic instability led to new efforts to reform U.S. society and its economic system."
            },
            {
              "id": "KC-7.1.I",
              "summary": "The United States continued its transition from a rural, agricultural economy to an urban, industrial economy led by large companies."
            },
            {
              "id": "KC-7.1.II",
              "summary": "In the Progressive Era, Progressives responded to political corruption, economic instability, and social concerns by calling for greater government action and other political and social measures."
            },
            {
              "id": "KC-7.1.III",
              "summary": "During the 1930s, policymakers responded to the Great Depression by transforming the U.S. into a limited welfare state, redefining the goals and ideas of modern American liberalism."
            },
            {
              "id": "KC-7.2",
              "summary": "Innovations in communications and technology contributed to the growth of mass culture, while significant changes occurred in internal and international migration patterns."
            },
            {
              "id": "KC-7.2.I",
              "summary": "Popular culture grew in influence, even as debates increased over the effects of culture on public values, morals, and American national identity."
            },
            {
              "id": "KC-7.2.II",
              "summary": "Economic pressures, global events, and political developments caused sharp variations in the numbers, sources, and experiences of both international and internal migrants."
            },
            {
              "id": "KC-7.3",
              "summary": "Participation in a series of global conflicts propelled the United States into a position of international power while renewing domestic debates over the nation’s proper role in the world."
            },
            {
              "id": "KC-7.3.I",
              "summary": "New U.S. territorial ambitions and acquisitions in the Western Hemisphere and the Pacific accompanied heightened public debates over America’s role in the world."
            },
            {
              "id": "KC-7.3.II",
              "summary": "World War I and its aftermath intensified ongoing debates about the nation’s role in the world and how best to achieve national security and pursue American interests."
            },
            {
              "id": "KC-7.3.III",
              "summary": "U.S. participation in World War II transformed American society, while the Allied victory vaulted the U.S. into a position of global, political, and military leadership."
            }
          ]
        }
      ]
    },
    {
      "unit_number": 8,
      "unit_title": "Period 8: 1945-1980",
      "ced_class_periods": "~20 Class Periods",
      "exam_weight": "10-17%",
      "topics": [
        {
          "topic_number": "8.1",
          "topic_title": "Contextualizing Period 8",
          "learning_objectives": [
            {
              "id": "Unit 8: Learning Objective A",
              "summary": "Explain the context for societal change from 1945 to 1980."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-8.1",
              "summary": "The United States responded to an uncertain and unstable postwar world by asserting and working to maintain a position of global leadership, with far-reaching domestic and international consequences."
            },
            {
              "id": "KC-8.1.I",
              "summary": "U.S. policymakers engaged in a cold war with the Soviet Union, seeking to limit the growth of Communist power and influence, create a free-market global economy, and build an international security system."
            },
            {
              "id": "KC-8.1.II",
              "summary": "Cold War policies led to public debates over the power of the federal government and acceptable means for pursuing international and domestic goals while protecting civil liberties."
            },
            {
              "id": "KC-8.2",
              "summary": "New movements for civil rights and liberal efforts to expand the role of government generated a range of political and cultural responses."
            },
            {
              "id": "KC-8.2.I",
              "summary": "Seeking to fulfill Reconstruction-era promises, civil rights activists and political leaders achieved some legal and political successes in ending segregation, although progress toward racial equality was slow."
            },
            {
              "id": "KC-8.2.II",
              "summary": "Responding to social conditions and the African American civil rights movement, a variety of movements emerged that focused on issues of identity, social justice, and the environment."
            },
            {
              "id": "KC-8.2.III",
              "summary": "Liberalism influenced postwar politics and court decisions, but it came under increasing attack from the left as well as from a resurgent conservative movement."
            },
            {
              "id": "KC-8.3",
              "summary": "Postwar economic and demographic changes had far-reaching consequences for American society, politics, and culture."
            },
            {
              "id": "KC-8.3.I",
              "summary": "Rapid economic and social changes in American society fostered a sense of optimism in the postwar years."
            },
            {
              "id": "KC-8.3.II",
              "summary": "New demographic and social developments, along with anxieties over the Cold War, changed U.S. culture and led to significant political and moral debates that sharply divided the nation."
            }
          ]
        },
        {
          "topic_number": "8.2",
          "topic_title": "The Cold War from 1945 to 1980",
          "learning_objectives": [
            {
              "id": "Unit 8: Learning Objective B",
              "summary": "Explain the continuities and changes in Cold War policies from 1945 to 1980."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-8.1.I",
              "summary": "U.S. policymakers engaged in a cold war with the Soviet Union, seeking to limit the growth of Communist power and influence, create a free-market global economy, and build an international security system."
            },
            {
              "id": "KC-8.1.I.A",
              "summary": "As postwar tensions dissolved the wartime alliance, the United States developed a foreign policy based on collective security, international aid, and economic institutions that bolstered non-Communist nations."
            },
            {
              "id": "KC-8.1.I.B.i",
              "summary": "Concerned by expansionist Communist ideology, the United States sought to contain communism through a variety of measures, including major military engagements in Korea."
            },
            {
              "id": "KC-8.1.I.C",
              "summary": "The Cold War fluctuated between periods of direct and indirect military confrontation and periods of mutual coexistence (or détente)."
            }
          ]
        },
        {
          "topic_number": "8.3",
          "topic_title": "The Red Scare",
          "learning_objectives": [
            {
              "id": "Unit 8: Learning Objective C",
              "summary": "Explain the causes and effects of the Red Scare after World War II."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-8.1.II.A",
              "summary": "Americans debated policies and methods designed to expose suspected communists within the United States even as both parties supported the broader strategy of containing communism."
            }
          ]
        },
        {
          "topic_number": "8.4",
          "topic_title": "Economy after 1945",
          "learning_objectives": [
            {
              "id": "Unit 8: Learning Objective D",
              "summary": "Explain the causes of economic growth in the years after World War II."
            },
            {
              "id": "Unit 8: Learning Objective E",
              "summary": "Explain the causes and effects of the migration of various groups of Americans after 1945."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-8.3.I.A",
              "summary": "A burgeoning private sector, federal spending, the baby boom, and technological developments helped spur economic growth."
            },
            {
              "id": "KC-8.3.I.B",
              "summary": "As higher education opportunities and new technologies expanded, increasing social mobility encouraged the migration of the middle class to the suburbs and of many Americans to the South and West (the Sun Belt)."
            }
          ]
        },
        {
          "topic_number": "8.5",
          "topic_title": "Culture after 1945",
          "learning_objectives": [
            {
              "id": "Unit 8: Learning Objective F",
              "summary": "Explain how mass culture has been maintained or challenged over time."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-8.3.II.A",
              "summary": "Mass culture became increasingly homogeneous in the postwar years, inspiring challenges to conformity by artists, intellectuals, and rebellious youth."
            }
          ]
        },
        {
          "topic_number": "8.6",
          "topic_title": "Early Steps in the Civil Rights Movement (1940s and 1950s)",
          "learning_objectives": [
            {
              "id": "Unit 8: Learning Objective G",
              "summary": "Explain how and why the civil rights movements developed and expanded from 1945 to 1960."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-8.2.I",
              "summary": "Seeking to fulfill Reconstruction-era promises, civil rights activists and political leaders achieved some legal and political successes in ending segregation, although progress toward racial equality was slow."
            },
            {
              "id": "KC-8.2.I.B.i",
              "summary": "The three branches of the federal government used measures including desegregation of the armed services and Brown v. Board of Education (1954) to promote greater racial equality."
            }
          ]
        },
        {
          "topic_number": "8.7",
          "topic_title": "America as a World Power",
          "learning_objectives": [
            {
              "id": "Unit 8: Learning Objective H",
              "summary": "Explain the various military and diplomatic responses to international developments over time."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-8.1.I.E",
              "summary": "Cold War competition extended to Latin America, where the United States supported non-Communist regimes that had varying levels of commitment to democracy."
            },
            {
              "id": "KC-8.1.II.C.i",
              "summary": "Americans debated the merits of a large nuclear arsenal and the military-industrial complex."
            },
            {
              "id": "KC-8.1.I.D.i",
              "summary": "Postwar decolonization and the emergence of powerful nationalist movements in Africa and the Middle East led both sides in the Cold War to seek allies among new nations, many of which remained nonaligned."
            }
          ]
        },
        {
          "topic_number": "8.8",
          "topic_title": "The Vietnam War",
          "learning_objectives": [
            {
              "id": "Unit 8: Learning Objective I",
              "summary": "Explain the causes and effects of the Vietnam War."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-8.1.I.B.ii",
              "summary": "Concerned by expansionist Communist ideology, the United States sought to contain communism through a variety of measures, including major military engagements in Vietnam."
            },
            {
              "id": "KC-8.1.I.D.ii",
              "summary": "Postwar decolonization and the emergence of powerful nationalist movements in Asia led both sides in the Cold War to seek allies among new nations, many of which remained nonaligned."
            },
            {
              "id": "KC-8.1.II.C.ii",
              "summary": "Americans debated the appropriate power of the executive branch in conducting foreign and military policy."
            }
          ]
        },
        {
          "topic_number": "8.9",
          "topic_title": "The Great Society",
          "learning_objectives": [
            {
              "id": "Unit 8: Learning Objective J",
              "summary": "Explain the causes and effects of continuing policy debates about the role of the federal government over time."
            },
            {
              "id": "Unit 8: Learning Objective K",
              "summary": "Explain the continuities and changes in immigration patterns over time."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-8.2.II.C",
              "summary": "Despite an overall affluence in postwar America, advocates raised concerns about the prevalence and persistence of poverty as a national problem."
            },
            {
              "id": "KC-8.2.III.A",
              "summary": "Liberalism, based on anti-communism abroad and a belief in government power to achieve social goals at home, reached a high point of political influence by the mid-1960s."
            },
            {
              "id": "KC-8.2.III.B.i",
              "summary": "Liberal ideas found expression in Lyndon Johnson’s Great Society, which attempted to use federal legislation and programs to end racial discrimination, eliminate poverty, and address other social issues."
            },
            {
              "id": "KC-8.3.I.C",
              "summary": "Immigrants from around the world sought access to opportunities in the United States, especially after the passage of new immigration laws in 1965."
            }
          ]
        },
        {
          "topic_number": "8.10",
          "topic_title": "The African American Civil Rights Movement (1960s)",
          "learning_objectives": [
            {
              "id": "Unit 8: Learning Objective L",
              "summary": "Explain how and why various groups responded to calls for the expansion of civil rights from 1960 to 1980."
            },
            {
              "id": "Unit 8: Learning Objective M",
              "summary": "Explain the various ways in which the federal government responded to the calls for the expansion of civil rights."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-8.2.I.A",
              "summary": "Civil rights activists and leaders, most notably Martin Luther King Jr., combated racial discrimination utilizing strategies like legal challenges, direct action, and nonviolent protest."
            },
            {
              "id": "KC-8.2.1.C",
              "summary": "Continuing resistance slowed desegregation efforts, sparking social and political unrest. Debates among civil rights activists over the efficacy of nonviolence increased after 1965."
            },
            {
              "id": "KC-8.2.I.B.ii",
              "summary": "The three branches of the federal government used measures including the Civil Rights Act of 1964 to promote greater racial equality."
            },
            {
              "id": "KC-8.2.III.B.ii",
              "summary": "A series of Supreme Court decisions expanded civil rights and individual liberties."
            }
          ]
        },
        {
          "topic_number": "8.11",
          "topic_title": "The Civil Rights Movement Expands",
          "learning_objectives": [
            {
              "id": "Unit 8: Learning Objective L",
              "summary": "Explain how and why various groups responded to calls for the expansion of civil rights from 1960 to 1980."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-8.2.II.B",
              "summary": "Latino, American Indian, and Asian American movements continued to demand social and economic equality and a redress of past injustices."
            },
            {
              "id": "KC-8.2.II.A",
              "summary": "Feminist and LGBTQ+ activists mobilized behind claims for legal, economic, and social equality."
            },
            {
              "id": "KC-8.3.II.B.i",
              "summary": "Feminists who participated in the counterculture of the 1960s rejected many of the social, economic, and political values of their parents’ generation and advocated changes in sexual norms."
            }
          ]
        },
        {
          "topic_number": "8.12",
          "topic_title": "Youth Culture of the 1960s",
          "learning_objectives": [
            {
              "id": "Unit 8: Learning Objective N",
              "summary": "Explain how and why opposition to existing policies and values developed and changed over the course of the 20th century."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-8.1.II.B",
              "summary": "The Vietnam War inspired sizable and passionate anti-war protests that became more numerous as the war escalated and sometimes led to violence."
            },
            {
              "id": "KC-8.2.III.D",
              "summary": "Some groups on the left rejected liberal policies, arguing that political leaders did too little to transform the racial and economic status quo at home and pursued immoral policies abroad."
            },
            {
              "id": "KC-8.3.II.B.ii",
              "summary": "Young people in the 1960s counterculture rejected many of their parents' social, economic, and political values, introduced greater informality into U.S. culture, and advocated changes in sexual norms."
            }
          ]
        },
        {
          "topic_number": "8.13",
          "topic_title": "The Environment and Natural Resources from 1968 to 1980",
          "learning_objectives": [
            {
              "id": "Unit 8: Learning Objective O",
              "summary": "Explain how and why policies related to the environment developed and changed from 1968 to 1980."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-8.1.II.D",
              "summary": "Ideological, military, and economic concerns shaped U.S. involvement in the Middle East, with several oil crises in the region eventually sparking attempts at creating a national energy policy."
            },
            {
              "id": "KC-8.2.II.D",
              "summary": "Environmental problems and accidents led to a growing environmental movement that aimed to use legislative and public efforts to combat pollution and protect natural resources. The federal government established new environmental programs and regulations."
            }
          ]
        },
        {
          "topic_number": "8.14",
          "topic_title": "Society in Transition",
          "learning_objectives": [
            {
              "id": "Unit 8: Learning Objective J",
              "summary": "Explain the causes and effects of continuing policy debates about the role of the federal government over time."
            },
            {
              "id": "Unit 8: Learning Objective P",
              "summary": "Explain the effects of the growth of religious movements over the course of the 20th century."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-8.2.III.C",
              "summary": "In the 1960s, conservatives challenged liberal laws and court decisions and perceived moral and cultural decline, seeking to limit the role of the federal government and enact more assertive foreign policies."
            },
            {
              "id": "KC-8.2.III.E",
              "summary": "Public confidence in government’s ability to solve social and economic problems declined in the 1970s in the wake of economic challenges, political scandals, and foreign policy crises."
            },
            {
              "id": "KC-8.2.III.F",
              "summary": "The 1970s saw growing clashes between conservatives and liberals over social and cultural issues, the power of the federal government, race, and movements for greater individual rights."
            },
            {
              "id": "KC-8.3.II.C",
              "summary": "The rapid and substantial growth of evangelical Christian churches and organizations was accompanied by greater political and social activism on the part of religious conservatives."
            }
          ]
        },
        {
          "topic_number": "8.15",
          "topic_title": "Continuity and Change in Period 8",
          "learning_objectives": [
            {
              "id": "Unit 8: Learning Objective Q",
              "summary": "Explain the extent to which the events of the period from 1945 to 1980 reshaped national identity."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-8.1",
              "summary": "The United States responded to an uncertain and unstable postwar world by asserting and working to maintain a position of global leadership, with far-reaching domestic and international consequences."
            },
            {
              "id": "KC-8.1.I",
              "summary": "U.S. policymakers engaged in a cold war with the Soviet Union, seeking to limit the growth of Communist power and influence, create a free-market global economy, and build an international security system."
            },
            {
              "id": "KC-8.1.II",
              "summary": "Cold War policies led to public debates over the power of the federal government and acceptable means for pursuing international and domestic goals while protecting civil liberties."
            },
            {
              "id": "KC-8.2",
              "summary": "New movements for civil rights and liberal efforts to expand the role of government generated a range of political and cultural responses."
            },
            {
              "id": "KC-8.2.I",
              "summary": "Seeking to fulfill Reconstruction-era promises, civil rights activists and political leaders achieved some legal and political successes in ending segregation, although progress toward racial equality was slow."
            },
            {
              "id": "KC-8.2.II",
              "summary": "Responding to social conditions and the African American civil rights movement, a variety of movements emerged that focused on issues of identity, social justice, and the environment."
            },
            {
              "id": "KC-8.2.III",
              "summary": "Liberalism influenced postwar politics and court decisions, but it came under increasing attack from the left as well as from a resurgent conservative movement."
            },
            {
              "id": "KC-8.3",
              "summary": "Postwar economic and demographic changes had far-reaching consequences for American society, politics, and culture."
            },
            {
              "id": "KC-8.3.I",
              "summary": "Rapid economic and social changes in American society fostered a sense of optimism in the postwar years."
            },
            {
              "id": "KC-8.3.II",
              "summary": "New demographic and social developments, along with anxieties over the Cold War, changed U.S. culture and led to significant political and moral debates that sharply divided the nation."
            }
          ]
        }
      ]
    },
    {
      "unit_number": 9,
      "unit_title": "Period 9: 1980-Present",
      "ced_class_periods": "~8 Class Periods",
      "exam_weight": "4-6%",
      "topics": [
        {
          "topic_number": "9.1",
          "topic_title": "Contextualizing Period 9",
          "learning_objectives": [
            {
              "id": "Unit 9: Learning Objective A",
              "summary": "Explain the context in which the United States faced international and domestic challenges after 1980."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-9.1",
              "summary": "A newly ascendant conservative movement achieved several political and policy goals during the 1980s and continued to strongly influence public discourse in the following decades."
            },
            {
              "id": "KC-9.1.I",
              "summary": "Conservative beliefs regarding the need for traditional social values and a reduced role for government advanced in U.S. politics after 1980."
            },
            {
              "id": "KC-9.2",
              "summary": "Moving into the 21st century, the nation experienced significant technological, economic, and demographic changes."
            },
            {
              "id": "KC-9.2.I",
              "summary": "New developments in science and technology enhanced the economy and transformed society, while manufacturing decreased."
            },
            {
              "id": "KC-9.2.II",
              "summary": "The U.S. population continued to undergo demographic shifts that had significant cultural and political consequences."
            },
            {
              "id": "KC-9.3",
              "summary": "The end of the Cold War and new challenges to U.S. leadership forced the nation to redefine its foreign policy and role in the world."
            },
            {
              "id": "KC-9.3.I",
              "summary": "The Reagan administration promoted an interventionist foreign policy that continued in later administrations, even after the end of the Cold War."
            },
            {
              "id": "KC-9.3.II",
              "summary": "Following the attacks of September 11, 2001, U.S. foreign policy efforts focused on fighting terrorism around the world."
            }
          ]
        },
        {
          "topic_number": "9.2",
          "topic_title": "Reagan and Conservatism",
          "learning_objectives": [
            {
              "id": "Unit 9: Learning Objective B",
              "summary": "Explain the causes and effects of continuing policy debates about the role of the federal government over time."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-9.1.I.A",
              "summary": "Ronald Reagan’s victory in 1980 represented an important milestone, allowing conservatives to enact significant tax cuts and continue the deregulation of many industries."
            },
            {
              "id": "KC-9.1.I.B",
              "summary": "Conservatives argued that liberal programs were counterproductive in fighting poverty and stimulating economic growth. Some of their efforts to reduce the size of government met with opposition, as many programs remained popular."
            },
            {
              "id": "KC-9.1.I.C",
              "summary": "Policy debates continued over free-trade agreements, the scope of the government social safety net, and calls to reform the U.S. financial system."
            },
            {
              "id": "KC-9.1.I",
              "summary": "Conservative beliefs regarding the need for traditional social values and a reduced role for government advanced in U.S. politics after 1980."
            },
            {
              "id": "KC-9.2.II.C",
              "summary": "Intense political and cultural debates continued over issues such as immigration policy, diversity, gender roles, and family structures."
            }
          ]
        },
        {
          "topic_number": "9.3",
          "topic_title": "The End of the Cold War",
          "learning_objectives": [
            {
              "id": "Unit 9: Learning Objective C",
              "summary": "Explain the causes and effects of the end of the Cold War and its legacy."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-9.3.I.A",
              "summary": "Reagan asserted U.S. opposition to communism through speeches, diplomatic efforts, limited military interventions, and a buildup of nuclear and conventional weapons."
            },
            {
              "id": "KC-9.3.I.B",
              "summary": "Increased U.S. military spending, Reagan’s diplomatic initiatives, and political and economic problems in Eastern Europe and the Soviet Union were all important in ending the Cold War."
            },
            {
              "id": "KC-9.3.I.C",
              "summary": "The end of the Cold War led to new diplomatic relationships but also new U.S. military and peacekeeping interventions, as well as continued debates over the appropriate use of American power in the world."
            }
          ]
        },
        {
          "topic_number": "9.4",
          "topic_title": "A Changing Economy",
          "learning_objectives": [
            {
              "id": "Unit 9: Learning Objective D",
              "summary": "Explain the causes and effects of economic and technological change over time."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-9.2.I.A",
              "summary": "Economic productivity increased as improvements in digital communications enabled increased American participation in worldwide economic opportunities."
            },
            {
              "id": "KC-9.2.I.B",
              "summary": "Technological innovations in computing, digital mobile technology, and the internet transformed daily life, increased access to information, and led to new social behaviors and networks."
            },
            {
              "id": "KC-9.2.I.C",
              "summary": "Employment increased in service sectors and decreased in manufacturing, and union membership declined."
            },
            {
              "id": "KC-9.2.I.D",
              "summary": "Real wages stagnated for the working and middle class amid growing economic inequality."
            }
          ]
        },
        {
          "topic_number": "9.5",
          "topic_title": "Migration and Immigration in the 1990s and 2000s",
          "learning_objectives": [
            {
              "id": "Unit 9: Learning Objective E",
              "summary": "Explain the causes and effects of domestic and international migration over time."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-9.2.II.A",
              "summary": "After 1980, the political, economic, and cultural influence of the American South and West continued to increase as population shifted to those areas."
            },
            {
              "id": "KC-9.2.II.B",
              "summary": "International migration from Latin America and Asia increased dramatically. The new immigrants affected U.S. culture in many ways and supplied the economy with an important labor force."
            }
          ]
        },
        {
          "topic_number": "9.6",
          "topic_title": "Challenges of the 21st Century",
          "learning_objectives": [
            {
              "id": "Unit 9: Learning Objective F",
              "summary": "Explain the causes and effects of the domestic and international challenges the United States has faced in the 21st century."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-9.3.II.A",
              "summary": "In the wake of the 9/11 attacks, the United States launched military efforts against terrorism and lengthy, controversial conflicts in Afghanistan and Iraq."
            },
            {
              "id": "KC-9.3.II.B",
              "summary": "The war on terrorism sought to improve security within the United States but also raised questions about the protection of civil liberties and human rights."
            },
            {
              "id": "KC-9.3.II.C",
              "summary": "Conflicts in the Middle East and concerns about climate change led to debates over U.S. dependence on fossil fuels and the impact of economic consumption on the environment."
            },
            {
              "id": "KC-9.3.II.D",
              "summary": "Despite economic and foreign policy challenges, the United States continued as the world’s leading superpower in the 21st century."
            }
          ]
        },
        {
          "topic_number": "9.7",
          "topic_title": "Causation in Period 9",
          "learning_objectives": [
            {
              "id": "Unit 9: Learning Objective G",
              "summary": "Explain the relative significance of the effects of change in the period after 1980 on American national identity."
            }
          ],
          "essential_knowledge": [
            {
              "id": "KC-9.1",
              "summary": "A newly ascendant conservative movement achieved several political and policy goals during the 1980s and continued to strongly influence public discourse in the following decades."
            },
            {
              "id": "KC-9.1.I",
              "summary": "Conservative beliefs regarding the need for traditional social values and a reduced role for government advanced in U.S. politics after 1980."
            },
            {
              "id": "KC-9.2",
              "summary": "Moving into the 21st century, the nation experienced significant technological, economic, and demographic changes."
            },
            {
              "id": "KC-9.2.I",
              "summary": "New developments in science and technology enhanced the economy and transformed society, while manufacturing decreased."
            },
            {
              "id": "KC-9.2.II",
              "summary": "The U.S. population continued to undergo demographic shifts that had significant cultural and political consequences."
            },
            {
              "id": "KC-9.3",
              "summary": "The end of the Cold War and new challenges to U.S. leadership forced the nation to redefine its foreign policy and role in the world."
            },
            {
              "id": "KC-9.3.I",
              "summary": "The Reagan administration promoted an interventionist foreign policy that continued in later administrations, even after the end of the Cold War."
            },
            {
              "id": "KC-9.3.II",
              "summary": "Following the attacks of September 11, 2001, U.S. foreign policy efforts focused on fighting terrorism around the world."
            }
          ]
        }
      ]
    }
  ]
}